{
  "articles": [
    {
      "id": 20,
      "title": "React Tutorial",
      "subTitle": "",
      "image": "https://source.unsplash.com/q10VITrVYUM",
      "content": "This tutorial doesn't assume any existing React knowledge.\n\n## Before We Start the Tutorial {#before-we-start-the-tutorial}\n\nWe will build a small game during this tutorial. **You might be tempted to skip it because you're not building games -- but give it a chance.** The techniques you'll learn in the tutorial are fundamental to building any React app, and mastering it will give you a deep understanding of React.\n\n>Tip\n>\n>This tutorial is designed for people who prefer to **learn by doing**. If you prefer learning concepts from the ground up, check out our [step-by-step guide](/docs/hello-world.html). You might find this tutorial and the guide complementary to each other.\n\nThe tutorial is divided into several sections:\n\n* [Setup for the Tutorial](#setup-for-the-tutorial) will give you **a starting point** to follow the tutorial.\n* [Overview](#overview) will teach you **the fundamentals** of React: components, props, and state.\n* [Completing the Game](#completing-the-game) will teach you **the most common techniques** in React development.\n* [Adding Time Travel](#adding-time-travel) will give you **a deeper insight** into the unique strengths of React.\n\nYou don't have to complete all of the sections at once to get the value out of this tutorial. Try to get as far as you can -- even if it's one or two sections.\n\n### What Are We Building? {#what-are-we-building}\n\nIn this tutorial, we'll show how to build an interactive tic-tac-toe game with React.\n\nYou can see what we'll be building here: **[Final Result](https://codepen.io/gaearon/pen/gWWZgR?editors=0010)**. If the code doesn't make sense to you, or if you are unfamiliar with the code's syntax, don't worry! The goal of this tutorial is to help you understand React and its syntax.\n\nWe recommend that you check out the tic-tac-toe game before continuing with the tutorial. One of the features that you'll notice is that there is a numbered list to the right of the game's board. This list gives you a history of all of the moves that have occurred in the game, and is updated as the game progresses.\n\nYou can close the tic-tac-toe game once you're familiar with it. We'll be starting from a simpler template in this tutorial. Our next step is to set you up so that you can start building the game.\n\n### Prerequisites {#prerequisites}\n\nWe'll assume that you have some familiarity with HTML and JavaScript, but you should be able to follow along even if you're coming from a different programming language. We'll also assume that you're familiar with programming concepts like functions, objects, arrays, and to a lesser extent, classes.\n\nIf you need to review JavaScript, we recommend reading [this guide](https://developer.mozilla.org/en-US/docs/Web/JavaScript/A_re-introduction_to_JavaScript). Note that we're also using some features from ES6 -- a recent version of JavaScript. In this tutorial, we're using [arrow functions](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/Arrow_functions), [classes](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Classes), [`let`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/let), and [`const`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/const) statements. You can use the [Babel REPL](babel://es5-syntax-example) to check what ES6 code compiles to.\n\n## Setup for the Tutorial {#setup-for-the-tutorial}\n\nThere are two ways to complete this tutorial: you can either write the code in your browser, or you can set up a local development environment on your computer.\n\n### Setup Option 1: Write Code in the Browser {#setup-option-1-write-code-in-the-browser}\n\nThis is the quickest way to get started!\n\nFirst, open this **[Starter Code](https://codepen.io/gaearon/pen/oWWQNa?editors=0010)** in a new tab. The new tab should display an empty tic-tac-toe game board and React code. We will be editing the React code in this tutorial.\n\nYou can now skip the second setup option, and go to the [Overview](#overview) section to get an overview of React.\n\n### Setup Option 2: Local Development Environment {#setup-option-2-local-development-environment}\n\nThis is completely optional and not required for this tutorial!\n\n<br>\n\n<details>\n\n<summary><b>Optional: Instructions for following along locally using your preferred text editor</b></summary>\n\nThis setup requires more work but allows you to complete the tutorial using an editor of your choice. Here are the steps to follow:\n\n1. Make sure you have a recent version of [Node.js](https://nodejs.org/en/) installed.\n2. Follow the [installation instructions for Create React App](/docs/create-a-new-react-app.html#create-react-app) to make a new project.\n\n```bash\nnpx create-react-app my-app\n```\n\n3. Delete all files in the `src/` folder of the new project \n\n> Note:\n>\n>**Don't delete the entire `src` folder, just the original source files inside it.** We'll replace the default source files with examples for this project in the next step.\n\n```bash\ncd my-app\ncd src\n\n# If you're using a Mac or Linux:\nrm -f *\n\n# Or, if you're on Windows:\ndel *\n\n# Then, switch back to the project folder\ncd ..\n```\n\n4. Add a file named `index.css` in the `src/` folder with [this CSS code](https://codepen.io/gaearon/pen/oWWQNa?editors=0100).\n\n5. Add a file named `index.js` in the `src/` folder with [this JS code](https://codepen.io/gaearon/pen/oWWQNa?editors=0010).\n\n6. Add these three lines to the top of `index.js` in the `src/` folder:\n\n```js\nimport React from 'react';\nimport ReactDOM from 'react-dom';\nimport './index.css';\n```\n\nNow if you run `npm start` in the project folder and open `http://localhost:3000` in the browser, you should see an empty tic-tac-toe field.\n\nWe recommend following [these instructions](https://babeljs.io/docs/editors/) to configure syntax highlighting for your editor.\n\n</details>\n\n### Help, I'm Stuck! {#help-im-stuck}\n\nIf you get stuck, check out the [community support resources](/community/support.html). In particular, [Reactiflux Chat](https://discord.gg/reactiflux) is a great way to get help quickly. If you don't receive an answer, or if you remain stuck, please file an issue, and we'll help you out.\n\n## Overview {#overview}\n\nNow that you're set up, let's get an overview of React!\n\n### What Is React? {#what-is-react}\n\nReact is a declarative, efficient, and flexible JavaScript library for building user interfaces. It lets you compose complex UIs from small and isolated pieces of code called \"components\".\n\nReact has a few different kinds of components, but we'll start with `React.Component` subclasses:\n\n```javascript\nclass ShoppingList extends React.Component {\n  render() {\n    return (\n      <div className=\"shopping-list\">\n        <h1>Shopping List for {this.props.name}</h1>\n        <ul>\n          <li>Instagram</li>\n          <li>WhatsApp</li>\n          <li>Oculus</li>\n        </ul>\n      </div>\n    );\n  }\n}\n\n// Example usage: <ShoppingList name=\"Mark\" />\n```\n\nWe'll get to the funny XML-like tags soon. We use components to tell React what we want to see on the screen. When our data changes, React will efficiently update and re-render our components.\n\nHere, ShoppingList is a **React component class**, or **React component type**. A component takes in parameters, called `props` (short for \"properties\"), and returns a hierarchy of views to display via the `render` method.\n\nThe `render` method returns a *description* of what you want to see on the screen. React takes the description and displays the result. In particular, `render` returns a **React element**, which is a lightweight description of what to render. Most React developers use a special syntax called \"JSX\" which makes these structures easier to write. The `<div />` syntax is transformed at build time to `React.createElement('div')`. The example above is equivalent to:\n\n```javascript\nreturn React.createElement('div', {className: 'shopping-list'},\n  React.createElement('h1', /* ... h1 children ... */),\n  React.createElement('ul', /* ... ul children ... */)\n);\n```\n\n[See full expanded version.](babel://tutorial-expanded-version)\n\nIf you're curious, `createElement()` is described in more detail in the [API reference](/docs/react-api.html#createelement), but we won't be using it in this tutorial. Instead, we will keep using JSX.\n\nJSX comes with the full power of JavaScript. You can put *any* JavaScript expressions within braces inside JSX. Each React element is a JavaScript object that you can store in a variable or pass around in your program.\n\nThe `ShoppingList` component above only renders built-in DOM components like `<div />` and `<li />`. But you can compose and render custom React components too. For example, we can now refer to the whole shopping list by writing `<ShoppingList />`. Each React component is encapsulated and can operate independently; this allows you to build complex UIs from simple components.\n\n## Inspecting the Starter Code {#inspecting-the-starter-code}\n\nIf you're going to work on the tutorial **in your browser,** open this code in a new tab: **[Starter Code](https://codepen.io/gaearon/pen/oWWQNa?editors=0010)**. If you're going to work on the tutorial **locally,** instead open `src/index.js` in your project folder (you have already touched this file during the [setup](#setup-option-2-local-development-environment)).\n\nThis Starter Code is the base of what we're building. We've provided the CSS styling so that you only need to focus on learning React and programming the tic-tac-toe game.\n\nBy inspecting the code, you'll notice that we have three React components:\n\n* Square\n* Board\n* Game\n\nThe Square component renders a single `<button>` and the Board renders 9 squares. The Game component renders a board with placeholder values which we'll modify later. There are currently no interactive components.\n\n### Passing Data Through Props {#passing-data-through-props}\n\nTo get our feet wet, let's try passing some data from our Board component to our Square component.\n\nWe strongly recommend typing code by hand as you're working through the tutorial and not using copy/paste. This will help you develop muscle memory and a stronger understanding.\n\nIn Board's `renderSquare` method, change the code to pass a prop called `value` to the Square:\n\n```js{3}\nclass Board extends React.Component {\n  renderSquare(i) {\n    return <Square value={i} />;\n  }\n}\n```\n\nChange Square's `render` method to show that value by replacing `{/* TODO */}` with `{this.props.value}`:\n\n```js{5}\nclass Square extends React.Component {\n  render() {\n    return (\n      <button className=\"square\">\n        {this.props.value}\n      </button>\n    );\n  }\n}\n```\n\nBefore:\n\n![React Devtools](../images/tutorial/tictac-empty.png)\n\nAfter: You should see a number in each square in the rendered output.\n\n![React Devtools](../images/tutorial/tictac-numbers.png)\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/aWWQOG?editors=0010)**\n\nCongratulations! You've just \"passed a prop\" from a parent Board component to a child Square component. Passing props is how information flows in React apps, from parents to children.\n\n### Making an Interactive Component {#making-an-interactive-component}\n\nLet's fill the Square component with an \"X\" when we click it.\nFirst, change the button tag that is returned from the Square component's `render()` function to this:\n\n```javascript{4}\nclass Square extends React.Component {\n  render() {\n    return (\n      <button className=\"square\" onClick={function() { alert('click'); }}>\n        {this.props.value}\n      </button>\n    );\n  }\n}\n```\n\nIf you click on a Square now, you should see an alert in your browser.\n\n>Note\n>\n>To save typing and avoid the [confusing behavior of `this`](https://yehudakatz.com/2011/08/11/understanding-javascript-function-invocation-and-this/), we will use the [arrow function syntax](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/Arrow_functions) for event handlers here and further below:\n>\n>```javascript{4}\n>class Square extends React.Component {\n>  render() {\n>    return (\n>      <button className=\"square\" onClick={() => alert('click')}>\n>        {this.props.value}\n>      </button>\n>    );\n>  }\n>}\n>```\n>\n>Notice how with `onClick={() => alert('click')}`, we're passing *a function* as the `onClick` prop. React will only call this function after a click. Forgetting `() =>` and writing `onClick={alert('click')}` is a common mistake, and would fire the alert every time the component re-renders.\n\nAs a next step, we want the Square component to \"remember\" that it got clicked, and fill it with an \"X\" mark. To \"remember\" things, components use **state**.\n\nReact components can have state by setting `this.state` in their constructors. `this.state` should be considered as private to a React component that it's defined in. Let's store the current value of the Square in `this.state`, and change it when the Square is clicked.\n\nFirst, we'll add a constructor to the class to initialize the state:\n\n```javascript{2-7}\nclass Square extends React.Component {\n  constructor(props) {\n    super(props);\n    this.state = {\n      value: null,\n    };\n  }\n\n  render() {\n    return (\n      <button className=\"square\" onClick={() => alert('click')}>\n        {this.props.value}\n      </button>\n    );\n  }\n}\n```\n\n>Note\n>\n>In [JavaScript classes](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Classes), you need to always call `super` when defining the constructor of a subclass. All React component classes that have a `constructor` should start it with a `super(props)` call.\n\nNow we'll change the Square's `render` method to display the current state's value when clicked:\n\n* Replace `this.props.value` with `this.state.value` inside the `<button>` tag.\n* Replace the `onClick={...}` event handler with `onClick={() => this.setState({value: 'X'})}`.\n* Put the `className` and `onClick` props on separate lines for better readability.\n\nAfter these changes, the `<button>` tag that is returned by the Square's `render` method looks like this:\n\n```javascript{12-13,15}\nclass Square extends React.Component {\n  constructor(props) {\n    super(props);\n    this.state = {\n      value: null,\n    };\n  }\n\n  render() {\n    return (\n      <button\n        className=\"square\"\n        onClick={() => this.setState({value: 'X'})}\n      >\n        {this.state.value}\n      </button>\n    );\n  }\n}\n```\n\nBy calling `this.setState` from an `onClick` handler in the Square's `render` method, we tell React to re-render that Square whenever its `<button>` is clicked. After the update, the Square's `this.state.value` will be `'X'`, so we'll see the `X` on the game board. If you click on any Square, an `X` should show up.\n\nWhen you call `setState` in a component, React automatically updates the child components inside of it too.\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/VbbVLg?editors=0010)**\n\n### Developer Tools {#developer-tools}\n\nThe React Devtools extension for [Chrome](https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi?hl=en) and [Firefox](https://addons.mozilla.org/en-US/firefox/addon/react-devtools/) lets you inspect a React component tree with your browser's developer tools.\n\n<img src=\"../images/tutorial/devtools.png\" alt=\"React Devtools\" style=\"max-width: 100%\">\n\nThe React DevTools let you check the props and the state of your React components.\n\nAfter installing React DevTools, you can right-click on any element on the page, click \"Inspect\" to open the developer tools, and the React tabs (\"⚛️ Components\" and \"⚛️ Profiler\") will appear as the last tabs to the right. Use \"⚛️ Components\" to inspect the component tree.\n\n**However, note there are a few extra steps to get it working with CodePen:**\n\n1. Log in or register and confirm your email (required to prevent spam).\n2. Click the \"Fork\" button.\n3. Click \"Change View\" and then choose \"Debug mode\".\n4. In the new tab that opens, the devtools should now have a React tab.\n\n## Completing the Game {#completing-the-game}\n\nWe now have the basic building blocks for our tic-tac-toe game. To have a complete game, we now need to alternate placing \"X\"s and \"O\"s on the board, and we need a way to determine a winner.\n\n### Lifting State Up {#lifting-state-up}\n\nCurrently, each Square component maintains the game's state. To check for a winner, we'll maintain the value of each of the 9 squares in one location.\n\nWe may think that Board should just ask each Square for the Square's state. Although this approach is possible in React, we discourage it because the code becomes difficult to understand, susceptible to bugs, and hard to refactor. Instead, the best approach is to store the game's state in the parent Board component instead of in each Square. The Board component can tell each Square what to display by passing a prop, [just like we did when we passed a number to each Square](#passing-data-through-props).\n\n**To collect data from multiple children, or to have two child components communicate with each other, you need to declare the shared state in their parent component instead. The parent component can pass the state back down to the children by using props; this keeps the child components in sync with each other and with the parent component.**\n\nLifting state into a parent component is common when React components are refactored -- let's take this opportunity to try it out.\n\nAdd a constructor to the Board and set the Board's initial state to contain an array of 9 nulls corresponding to the 9 squares:\n\n```javascript{2-7}\nclass Board extends React.Component {\n  constructor(props) {\n    super(props);\n    this.state = {\n      squares: Array(9).fill(null),\n    };\n  }\n\n  renderSquare(i) {\n    return <Square value={i} />;\n  }\n```\n\nWhen we fill the board in later, the `this.state.squares` array will look something like this:\n\n```javascript\n[\n  'O', null, 'X',\n  'X', 'X', 'O',\n  'O', null, null,\n]\n```\n\nThe Board's `renderSquare` method currently looks like this:\n\n```javascript\n  renderSquare(i) {\n    return <Square value={i} />;\n  }\n```\n\nIn the beginning, we [passed the `value` prop down](#passing-data-through-props) from the Board to show numbers from 0 to 8 in every Square. In a different previous step, we replaced the numbers with an \"X\" mark [determined by Square's own state](#making-an-interactive-component). This is why Square currently ignores the `value` prop passed to it by the Board.\n\nWe will now use the prop passing mechanism again. We will modify the Board to instruct each individual Square about its current value (`'X'`, `'O'`, or `null`). We have already defined the `squares` array in the Board's constructor, and we will modify the Board's `renderSquare` method to read from it:\n\n```javascript{2}\n  renderSquare(i) {\n    return <Square value={this.state.squares[i]} />;\n  }\n```\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/gWWQPY?editors=0010)**\n\nEach Square will now receive a `value` prop that will either be `'X'`, `'O'`, or `null` for empty squares.\n\nNext, we need to change what happens when a Square is clicked. The Board component now maintains which squares are filled. We need to create a way for the Square to update the Board's state. Since state is considered to be private to a component that defines it, we cannot update the Board's state directly from Square.\n\nInstead, we'll pass down a function from the Board to the Square, and we'll have Square call that function when a square is clicked. We'll change the `renderSquare` method in Board to:\n\n```javascript{5}\n  renderSquare(i) {\n    return (\n      <Square\n        value={this.state.squares[i]}\n        onClick={() => this.handleClick(i)}\n      />\n    );\n  }\n```\n\n>Note\n>\n>We split the returned element into multiple lines for readability, and added parentheses so that JavaScript doesn't insert a semicolon after `return` and break our code.\n\nNow we're passing down two props from Board to Square: `value` and `onClick`. The `onClick` prop is a function that Square can call when clicked. We'll make the following changes to Square:\n\n* Replace `this.state.value` with `this.props.value` in Square's `render` method\n* Replace `this.setState()` with `this.props.onClick()` in Square's `render` method\n* Delete the `constructor` from Square because Square no longer keeps track of the game's state\n\nAfter these changes, the Square component looks like this:\n\n```javascript{1,2,6,8}\nclass Square extends React.Component {\n  render() {\n    return (\n      <button\n        className=\"square\"\n        onClick={() => this.props.onClick()}\n      >\n        {this.props.value}\n      </button>\n    );\n  }\n}\n```\n\nWhen a Square is clicked, the `onClick` function provided by the Board is called. Here's a review of how this is achieved:\n\n1. The `onClick` prop on the built-in DOM `<button>` component tells React to set up a click event listener.\n2. When the button is clicked, React will call the `onClick` event handler that is defined in Square's `render()` method.\n3. This event handler calls `this.props.onClick()`. The Square's `onClick` prop was specified by the Board.\n4. Since the Board passed `onClick={() => this.handleClick(i)}` to Square, the Square calls `this.handleClick(i)` when clicked.\n5. We have not defined the `handleClick()` method yet, so our code crashes. If you click a square now, you should see a red error screen saying something like \"this.handleClick is not a function\".\n\n>Note\n>\n>The DOM `<button>` element's `onClick` attribute has a special meaning to React because it is a built-in component. For custom components like Square, the naming is up to you. We could give any name to the Square's `onClick` prop or Board's `handleClick` method, and the code would work the same. In React, it's conventional to use `on[Event]` names for props which represent events and `handle[Event]` for the methods which handle the events.\n\nWhen we try to click a Square, we should get an error because we haven't defined `handleClick` yet. We'll now add `handleClick` to the Board class:\n\n```javascript{9-13}\nclass Board extends React.Component {\n  constructor(props) {\n    super(props);\n    this.state = {\n      squares: Array(9).fill(null),\n    };\n  }\n\n  handleClick(i) {\n    const squares = this.state.squares.slice();\n    squares[i] = 'X';\n    this.setState({squares: squares});\n  }\n\n  renderSquare(i) {\n    return (\n      <Square\n        value={this.state.squares[i]}\n        onClick={() => this.handleClick(i)}\n      />\n    );\n  }\n\n  render() {\n    const status = 'Next player: X';\n\n    return (\n      <div>\n        <div className=\"status\">{status}</div>\n        <div className=\"board-row\">\n          {this.renderSquare(0)}\n          {this.renderSquare(1)}\n          {this.renderSquare(2)}\n        </div>\n        <div className=\"board-row\">\n          {this.renderSquare(3)}\n          {this.renderSquare(4)}\n          {this.renderSquare(5)}\n        </div>\n        <div className=\"board-row\">\n          {this.renderSquare(6)}\n          {this.renderSquare(7)}\n          {this.renderSquare(8)}\n        </div>\n      </div>\n    );\n  }\n}\n```\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/ybbQJX?editors=0010)**\n\nAfter these changes, we're again able to click on the Squares to fill them, the same as we had before. However, now the state is stored in the Board component instead of the individual Square components. When the Board's state changes, the Square components re-render automatically. Keeping the state of all squares in the Board component will allow it to determine the winner in the future.\n\nSince the Square components no longer maintain state, the Square components receive values from the Board component and inform the Board component when they're clicked. In React terms, the Square components are now **controlled components**. The Board has full control over them.\n\nNote how in `handleClick`, we call `.slice()` to create a copy of the `squares` array to modify instead of modifying the existing array. We will explain why we create a copy of the `squares` array in the next section.\n\n### Why Immutability Is Important {#why-immutability-is-important}\n\nIn the previous code example, we suggested that you use the `.slice()` method to create a copy of the `squares` array to modify instead of modifying the existing array. We'll now discuss immutability and why immutability is important to learn.\n\nThere are generally two approaches to changing data. The first approach is to *mutate* the data by directly changing the data's values. The second approach is to replace the data with a new copy which has the desired changes.\n\n#### Data Change with Mutation {#data-change-with-mutation}\n```javascript\nvar player = {score: 1, name: 'Jeff'};\nplayer.score = 2;\n// Now player is {score: 2, name: 'Jeff'}\n```\n\n#### Data Change without Mutation {#data-change-without-mutation}\n```javascript\nvar player = {score: 1, name: 'Jeff'};\n\nvar newPlayer = Object.assign({}, player, {score: 2});\n// Now player is unchanged, but newPlayer is {score: 2, name: 'Jeff'}\n\n// Or if you are using object spread syntax proposal, you can write:\n// var newPlayer = {...player, score: 2};\n```\n\nThe end result is the same but by not mutating (or changing the underlying data) directly, we gain several benefits described below.\n\n#### Complex Features Become Simple {#complex-features-become-simple}\n\nImmutability makes complex features much easier to implement. Later in this tutorial, we will implement a \"time travel\" feature that allows us to review the tic-tac-toe game's history and \"jump back\" to previous moves. This functionality isn't specific to games -- an ability to undo and redo certain actions is a common requirement in applications. Avoiding direct data mutation lets us keep previous versions of the game's history intact, and reuse them later.\n\n#### Detecting Changes {#detecting-changes}\n\nDetecting changes in mutable objects is difficult because they are modified directly. This detection requires the mutable object to be compared to previous copies of itself and the entire object tree to be traversed.\n\nDetecting changes in immutable objects is considerably easier. If the immutable object that is being referenced is different than the previous one, then the object has changed.\n\n#### Determining When to Re-Render in React {#determining-when-to-re-render-in-react}\n\nThe main benefit of immutability is that it helps you build _pure components_ in React. Immutable data can easily determine if changes have been made which helps to determine when a component requires re-rendering.\n\nYou can learn more about `shouldComponentUpdate()` and how you can build *pure components* by reading [Optimizing Performance](/docs/optimizing-performance.html#examples).\n\n### Function Components {#function-components}\n\nWe'll now change the Square to be a **function component**.\n\nIn React, **function components** are a simpler way to write components that only contain a `render` method and don't have their own state. Instead of defining a class which extends `React.Component`, we can write a function that takes `props` as input and returns what should be rendered. Function components are less tedious to write than classes, and many components can be expressed this way.\n\nReplace the Square class with this function:\n\n```javascript\nfunction Square(props) {\n  return (\n    <button className=\"square\" onClick={props.onClick}>\n      {props.value}\n    </button>\n  );\n}\n```\n\nWe have changed `this.props` to `props` both times it appears.\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/QvvJOv?editors=0010)**\n\n>Note\n>\n>When we modified the Square to be a function component, we also changed `onClick={() => this.props.onClick()}` to a shorter `onClick={props.onClick}` (note the lack of parentheses on *both* sides).\n\n### Taking Turns {#taking-turns}\n\nWe now need to fix an obvious defect in our tic-tac-toe game: the \"O\"s cannot be marked on the board.\n\nWe'll set the first move to be \"X\" by default. We can set this default by modifying the initial state in our Board constructor:\n\n```javascript{6}\nclass Board extends React.Component {\n  constructor(props) {\n    super(props);\n    this.state = {\n      squares: Array(9).fill(null),\n      xIsNext: true,\n    };\n  }\n```\n\nEach time a player moves, `xIsNext` (a boolean) will be flipped to determine which player goes next and the game's state will be saved. We'll update the Board's `handleClick` function to flip the value of `xIsNext`:\n\n```javascript{3,6}\n  handleClick(i) {\n    const squares = this.state.squares.slice();\n    squares[i] = this.state.xIsNext ? 'X' : 'O';\n    this.setState({\n      squares: squares,\n      xIsNext: !this.state.xIsNext,\n    });\n  }\n```\n\nWith this change, \"X\"s and \"O\"s can take turns. Try it!\n\nLet's also change the \"status\" text in Board's `render` so that it displays which player has the next turn:\n\n```javascript{2}\n  render() {\n    const status = 'Next player: ' + (this.state.xIsNext ? 'X' : 'O');\n\n    return (\n      // the rest has not changed\n```\n\nAfter applying these changes, you should have this Board component:\n\n```javascript{6,11-16,29}\nclass Board extends React.Component {\n  constructor(props) {\n    super(props);\n    this.state = {\n      squares: Array(9).fill(null),\n      xIsNext: true,\n    };\n  }\n\n  handleClick(i) {\n    const squares = this.state.squares.slice();\n    squares[i] = this.state.xIsNext ? 'X' : 'O';\n    this.setState({\n      squares: squares,\n      xIsNext: !this.state.xIsNext,\n    });\n  }\n\n  renderSquare(i) {\n    return (\n      <Square\n        value={this.state.squares[i]}\n        onClick={() => this.handleClick(i)}\n      />\n    );\n  }\n\n  render() {\n    const status = 'Next player: ' + (this.state.xIsNext ? 'X' : 'O');\n\n    return (\n      <div>\n        <div className=\"status\">{status}</div>\n        <div className=\"board-row\">\n          {this.renderSquare(0)}\n          {this.renderSquare(1)}\n          {this.renderSquare(2)}\n        </div>\n        <div className=\"board-row\">\n          {this.renderSquare(3)}\n          {this.renderSquare(4)}\n          {this.renderSquare(5)}\n        </div>\n        <div className=\"board-row\">\n          {this.renderSquare(6)}\n          {this.renderSquare(7)}\n          {this.renderSquare(8)}\n        </div>\n      </div>\n    );\n  }\n}\n```\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/KmmrBy?editors=0010)**\n\n### Declaring a Winner {#declaring-a-winner}\n\nNow that we show which player's turn is next, we should also show when the game is won and there are no more turns to make. Copy this helper function and paste it at the end of the file:\n\n```javascript\nfunction calculateWinner(squares) {\n  const lines = [\n    [0, 1, 2],\n    [3, 4, 5],\n    [6, 7, 8],\n    [0, 3, 6],\n    [1, 4, 7],\n    [2, 5, 8],\n    [0, 4, 8],\n    [2, 4, 6],\n  ];\n  for (let i = 0; i < lines.length; i++) {\n    const [a, b, c] = lines[i];\n    if (squares[a] && squares[a] === squares[b] && squares[a] === squares[c]) {\n      return squares[a];\n    }\n  }\n  return null;\n}\n```\n\nGiven an array of 9 squares, this function will check for a winner and return `'X'`, `'O'`, or `null` as appropriate.\n\nWe will call `calculateWinner(squares)` in the Board's `render` function to check if a player has won. If a player has won, we can display text such as \"Winner: X\" or \"Winner: O\". We'll replace the `status` declaration in Board's `render` function with this code:\n\n```javascript{2-8}\n  render() {\n    const winner = calculateWinner(this.state.squares);\n    let status;\n    if (winner) {\n      status = 'Winner: ' + winner;\n    } else {\n      status = 'Next player: ' + (this.state.xIsNext ? 'X' : 'O');\n    }\n\n    return (\n      // the rest has not changed\n```\n\nWe can now change the Board's `handleClick` function to return early by ignoring a click if someone has won the game or if a Square is already filled:\n\n```javascript{3-5}\n  handleClick(i) {\n    const squares = this.state.squares.slice();\n    if (calculateWinner(squares) || squares[i]) {\n      return;\n    }\n    squares[i] = this.state.xIsNext ? 'X' : 'O';\n    this.setState({\n      squares: squares,\n      xIsNext: !this.state.xIsNext,\n    });\n  }\n```\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/LyyXgK?editors=0010)**\n\nCongratulations! You now have a working tic-tac-toe game. And you've just learned the basics of React too. So *you're* probably the real winner here.\n\n## Adding Time Travel {#adding-time-travel}\n\nAs a final exercise, let's make it possible to \"go back in time\" to the previous moves in the game.\n\n### Storing a History of Moves {#storing-a-history-of-moves}\n\nIf we mutated the `squares` array, implementing time travel would be very difficult.\n\nHowever, we used `slice()` to create a new copy of the `squares` array after every move, and [treated it as immutable](#why-immutability-is-important). This will allow us to store every past version of the `squares` array, and navigate between the turns that have already happened.\n\nWe'll store the past `squares` arrays in another array called `history`. The `history` array represents all board states, from the first to the last move, and has a shape like this:\n\n```javascript\nhistory = [\n  // Before first move\n  {\n    squares: [\n      null, null, null,\n      null, null, null,\n      null, null, null,\n    ]\n  },\n  // After first move\n  {\n    squares: [\n      null, null, null,\n      null, 'X', null,\n      null, null, null,\n    ]\n  },\n  // After second move\n  {\n    squares: [\n      null, null, null,\n      null, 'X', null,\n      null, null, 'O',\n    ]\n  },\n  // ...\n]\n```\n\nNow we need to decide which component should own the `history` state.\n\n### Lifting State Up, Again {#lifting-state-up-again}\n\nWe'll want the top-level Game component to display a list of past moves. It will need access to the `history` to do that, so we will place the `history` state in the top-level Game component.\n\nPlacing the `history` state into the Game component lets us remove the `squares` state from its child Board component. Just like we [\"lifted state up\"](#lifting-state-up) from the Square component into the Board component, we are now lifting it up from the Board into the top-level Game component. This gives the Game component full control over the Board's data, and lets it instruct the Board to render previous turns from the `history`.\n\nFirst, we'll set up the initial state for the Game component within its constructor:\n\n```javascript{2-10}\nclass Game extends React.Component {\n  constructor(props) {\n    super(props);\n    this.state = {\n      history: [{\n        squares: Array(9).fill(null),\n      }],\n      xIsNext: true,\n    };\n  }\n\n  render() {\n    return (\n      <div className=\"game\">\n        <div className=\"game-board\">\n          <Board />\n        </div>\n        <div className=\"game-info\">\n          <div>{/* status */}</div>\n          <ol>{/* TODO */}</ol>\n        </div>\n      </div>\n    );\n  }\n}\n```\n\nNext, we'll have the Board component receive `squares` and `onClick` props from the Game component. Since we now have a single click handler in Board for many Squares, we'll need to pass the location of each Square into the `onClick` handler to indicate which Square was clicked. Here are the required steps to transform the Board component:\n\n* Delete the `constructor` in Board.\n* Replace `this.state.squares[i]` with `this.props.squares[i]` in Board's `renderSquare`.\n* Replace `this.handleClick(i)` with `this.props.onClick(i)` in Board's `renderSquare`.\n\nThe Board component now looks like this:\n\n```javascript{17,18}\nclass Board extends React.Component {\n  handleClick(i) {\n    const squares = this.state.squares.slice();\n    if (calculateWinner(squares) || squares[i]) {\n      return;\n    }\n    squares[i] = this.state.xIsNext ? 'X' : 'O';\n    this.setState({\n      squares: squares,\n      xIsNext: !this.state.xIsNext,\n    });\n  }\n\n  renderSquare(i) {\n    return (\n      <Square\n        value={this.props.squares[i]}\n        onClick={() => this.props.onClick(i)}\n      />\n    );\n  }\n\n  render() {\n    const winner = calculateWinner(this.state.squares);\n    let status;\n    if (winner) {\n      status = 'Winner: ' + winner;\n    } else {\n      status = 'Next player: ' + (this.state.xIsNext ? 'X' : 'O');\n    }\n\n    return (\n      <div>\n        <div className=\"status\">{status}</div>\n        <div className=\"board-row\">\n          {this.renderSquare(0)}\n          {this.renderSquare(1)}\n          {this.renderSquare(2)}\n        </div>\n        <div className=\"board-row\">\n          {this.renderSquare(3)}\n          {this.renderSquare(4)}\n          {this.renderSquare(5)}\n        </div>\n        <div className=\"board-row\">\n          {this.renderSquare(6)}\n          {this.renderSquare(7)}\n          {this.renderSquare(8)}\n        </div>\n      </div>\n    );\n  }\n}\n```\n\nWe'll update the Game component's `render` function to use the most recent history entry to determine and display the game's status:\n\n```javascript{2-11,16-19,22}\n  render() {\n    const history = this.state.history;\n    const current = history[history.length - 1];\n    const winner = calculateWinner(current.squares);\n\n    let status;\n    if (winner) {\n      status = 'Winner: ' + winner;\n    } else {\n      status = 'Next player: ' + (this.state.xIsNext ? 'X' : 'O');\n    }\n\n    return (\n      <div className=\"game\">\n        <div className=\"game-board\">\n          <Board\n            squares={current.squares}\n            onClick={(i) => this.handleClick(i)}\n          />\n        </div>\n        <div className=\"game-info\">\n          <div>{status}</div>\n          <ol>{/* TODO */}</ol>\n        </div>\n      </div>\n    );\n  }\n```\n\nSince the Game component is now rendering the game's status, we can remove the corresponding code from the Board's `render` method. After refactoring, the Board's `render` function looks like this:\n\n```js{1-4}\n  render() {\n    return (\n      <div>\n        <div className=\"board-row\">\n          {this.renderSquare(0)}\n          {this.renderSquare(1)}\n          {this.renderSquare(2)}\n        </div>\n        <div className=\"board-row\">\n          {this.renderSquare(3)}\n          {this.renderSquare(4)}\n          {this.renderSquare(5)}\n        </div>\n        <div className=\"board-row\">\n          {this.renderSquare(6)}\n          {this.renderSquare(7)}\n          {this.renderSquare(8)}\n        </div>\n      </div>\n    );\n  }\n```\n\nFinally, we need to move the `handleClick` method from the Board component to the Game component. We also need to modify `handleClick` because the Game component's state is structured differently. Within the Game's `handleClick` method, we concatenate new history entries onto `history`.\n\n```javascript{2-4,10-12}\n  handleClick(i) {\n    const history = this.state.history;\n    const current = history[history.length - 1];\n    const squares = current.squares.slice();\n    if (calculateWinner(squares) || squares[i]) {\n      return;\n    }\n    squares[i] = this.state.xIsNext ? 'X' : 'O';\n    this.setState({\n      history: history.concat([{\n        squares: squares,\n      }]),\n      xIsNext: !this.state.xIsNext,\n    });\n  }\n```\n\n>Note\n>\n>Unlike the array `push()` method you might be more familiar with, the `concat()` method doesn't mutate the original array, so we prefer it.\n\nAt this point, the Board component only needs the `renderSquare` and `render` methods. The game's state and the `handleClick` method should be in the Game component.\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/EmmOqJ?editors=0010)**\n\n### Showing the Past Moves {#showing-the-past-moves}\n\nSince we are recording the tic-tac-toe game's history, we can now display it to the player as a list of past moves.\n\nWe learned earlier that React elements are first-class JavaScript objects; we can pass them around in our applications. To render multiple items in React, we can use an array of React elements.\n\nIn JavaScript, arrays have a [`map()` method](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/map) that is commonly used for mapping data to other data, for example:\n\n```js\nconst numbers = [1, 2, 3];\nconst doubled = numbers.map(x => x * 2); // [2, 4, 6]\n```\n\nUsing the `map` method, we can map our history of moves to React elements representing buttons on the screen, and display a list of buttons to \"jump\" to past moves.\n\nLet's `map` over the `history` in the Game's `render` method:\n\n```javascript{6-15,34}\n  render() {\n    const history = this.state.history;\n    const current = history[history.length - 1];\n    const winner = calculateWinner(current.squares);\n\n    const moves = history.map((step, move) => {\n      const desc = move ?\n        'Go to move #' + move :\n        'Go to game start';\n      return (\n        <li>\n          <button onClick={() => this.jumpTo(move)}>{desc}</button>\n        </li>\n      );\n    });\n\n    let status;\n    if (winner) {\n      status = 'Winner: ' + winner;\n    } else {\n      status = 'Next player: ' + (this.state.xIsNext ? 'X' : 'O');\n    }\n\n    return (\n      <div className=\"game\">\n        <div className=\"game-board\">\n          <Board\n            squares={current.squares}\n            onClick={(i) => this.handleClick(i)}\n          />\n        </div>\n        <div className=\"game-info\">\n          <div>{status}</div>\n          <ol>{moves}</ol>\n        </div>\n      </div>\n    );\n  }\n```\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/EmmGEa?editors=0010)**\n\nFor each move in the tic-tac-toes's game's history, we create a list item `<li>` which contains a button `<button>`. The button has a `onClick` handler which calls a method called `this.jumpTo()`. We haven't implemented the `jumpTo()` method yet. For now, we should see a list of the moves that have occurred in the game and a warning in the developer tools console that says:\n\n>  Warning:\n>  Each child in an array or iterator should have a unique \"key\" prop. Check the render method of \"Game\".\n\nLet's discuss what the above warning means.\n\n### Picking a Key {#picking-a-key}\n\nWhen we render a list, React stores some information about each rendered list item. When we update a list, React needs to determine what has changed. We could have added, removed, re-arranged, or updated the list's items.\n\nImagine transitioning from\n\n```html\n<li>Alexa: 7 tasks left</li>\n<li>Ben: 5 tasks left</li>\n```\n\nto\n\n```html\n<li>Ben: 9 tasks left</li>\n<li>Claudia: 8 tasks left</li>\n<li>Alexa: 5 tasks left</li>\n```\n\nIn addition to the updated counts, a human reading this would probably say that we swapped Alexa and Ben's ordering and inserted Claudia between Alexa and Ben. However, React is a computer program and does not know what we intended. Because React cannot know our intentions, we need to specify a *key* property for each list item to differentiate each list item from its siblings. One option would be to use the strings `alexa`, `ben`, `claudia`. If we were displaying data from a database, Alexa, Ben, and Claudia's database IDs could be used as keys.\n\n```html\n<li key={user.id}>{user.name}: {user.taskCount} tasks left</li>\n```\n\nWhen a list is re-rendered, React takes each list item's key and searches the previous list's items for a matching key. If the current list has a key that didn't exist before, React creates a component. If the current list is missing a key that existed in the previous list, React destroys the previous component. If two keys match, the corresponding component is moved. Keys tell React about the identity of each component which allows React to maintain state between re-renders. If a component's key changes, the component will be destroyed and re-created with a new state.\n\n`key` is a special and reserved property in React (along with `ref`, a more advanced feature). When an element is created, React extracts the `key` property and stores the key directly on the returned element. Even though `key` may look like it belongs in `props`, `key` cannot be referenced using `this.props.key`. React automatically uses `key` to decide which components to update. A component cannot inquire about its `key`.\n\n**It's strongly recommended that you assign proper keys whenever you build dynamic lists.** If you don't have an appropriate key, you may want to consider restructuring your data so that you do.\n\nIf no key is specified, React will present a warning and use the array index as a key by default. Using the array index as a key is problematic when trying to re-order a list's items or inserting/removing list items. Explicitly passing `key={i}` silences the warning but has the same problems as array indices and is not recommended in most cases.\n\nKeys do not need to be globally unique; they only need to be unique between components and their siblings.\n\n\n### Implementing Time Travel {#implementing-time-travel}\n\nIn the tic-tac-toe game's history, each past move has a unique ID associated with it: it's the sequential number of the move. The moves are never re-ordered, deleted, or inserted in the middle, so it's safe to use the move index as a key.\n\nIn the Game component's `render` method, we can add the key as `<li key={move}>` and React's warning about keys should disappear:\n\n```js{6}\n    const moves = history.map((step, move) => {\n      const desc = move ?\n        'Go to move #' + move :\n        'Go to game start';\n      return (\n        <li key={move}>\n          <button onClick={() => this.jumpTo(move)}>{desc}</button>\n        </li>\n      );\n    });\n```\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/PmmXRE?editors=0010)**\n\nClicking any of the list item's buttons throws an error because the `jumpTo` method is undefined. Before we implement `jumpTo`, we'll add `stepNumber` to the Game component's state to indicate which step we're currently viewing.\n\nFirst, add `stepNumber: 0` to the initial state in Game's `constructor`:\n\n```js{8}\nclass Game extends React.Component {\n  constructor(props) {\n    super(props);\n    this.state = {\n      history: [{\n        squares: Array(9).fill(null),\n      }],\n      stepNumber: 0,\n      xIsNext: true,\n    };\n  }\n```\n\nNext, we'll define the `jumpTo` method in Game to update that `stepNumber`. We also set `xIsNext` to true if the number that we're changing `stepNumber` to is even:\n\n```javascript{5-10}\n  handleClick(i) {\n    // this method has not changed\n  }\n\n  jumpTo(step) {\n    this.setState({\n      stepNumber: step,\n      xIsNext: (step % 2) === 0,\n    });\n  }\n\n  render() {\n    // this method has not changed\n  }\n```\n\nWe will now make a few changes to the Game's `handleClick` method which fires when you click on a square.\n\nThe `stepNumber` state we've added reflects the move displayed to the user now. After we make a new move, we need to update `stepNumber` by adding `stepNumber: history.length` as part of the `this.setState` argument. This ensures we don't get stuck showing the same move after a new one has been made.\n\nWe will also replace reading `this.state.history` with `this.state.history.slice(0, this.state.stepNumber + 1)`. This ensures that if we \"go back in time\" and then make a new move from that point, we throw away all the \"future\" history that would now become incorrect.\n\n```javascript{2,13}\n  handleClick(i) {\n    const history = this.state.history.slice(0, this.state.stepNumber + 1);\n    const current = history[history.length - 1];\n    const squares = current.squares.slice();\n    if (calculateWinner(squares) || squares[i]) {\n      return;\n    }\n    squares[i] = this.state.xIsNext ? 'X' : 'O';\n    this.setState({\n      history: history.concat([{\n        squares: squares\n      }]),\n      stepNumber: history.length,\n      xIsNext: !this.state.xIsNext,\n    });\n  }\n```\n\nFinally, we will modify the Game component's `render` method from always rendering the last move to rendering the currently selected move according to `stepNumber`:\n\n```javascript{3}\n  render() {\n    const history = this.state.history;\n    const current = history[this.state.stepNumber];\n    const winner = calculateWinner(current.squares);\n\n    // the rest has not changed\n```\n\nIf we click on any step in the game's history, the tic-tac-toe board should immediately update to show what the board looked like after that step occurred.\n\n**[View the full code at this point](https://codepen.io/gaearon/pen/gWWZgR?editors=0010)**\n\n### Wrapping Up {#wrapping-up}\n\nCongratulations! You've created a tic-tac-toe game that:\n\n* Lets you play tic-tac-toe,\n* Indicates when a player has won the game,\n* Stores a game's history as a game progresses,\n* Allows players to review a game's history and see previous versions of a game's board.\n\nNice work! We hope you now feel like you have a decent grasp on how React works.\n\nCheck out the final result here: **[Final Result](https://codepen.io/gaearon/pen/gWWZgR?editors=0010)**.\n\nIf you have extra time or want to practice your new React skills, here are some ideas for improvements that you could make to the tic-tac-toe game which are listed in order of increasing difficulty:\n\n1. Display the location for each move in the format (col, row) in the move history list.\n2. Bold the currently selected item in the move list.\n3. Rewrite Board to use two loops to make the squares instead of hardcoding them.\n4. Add a toggle button that lets you sort the moves in either ascending or descending order.\n5. When someone wins, highlight the three squares that caused the win.\n6. When no one wins, display a message about the result being a draw.\n\nThroughout this tutorial, we touched on React concepts including elements, components, props, and state. For a more detailed explanation of each of these topics, check out [the rest of the documentation](/docs/hello-world.html). To learn more about defining components, check out the [`React.Component` API reference](/docs/react-component.html).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": "https://github.com/reactjs/reactjs.org/blob/master/content/tutorial/tutorial.md"
    },
    {
      "id": 19,
      "title": "Next.js",
      "subTitle": "",
      "image": "https://source.unsplash.com/WiONHd_zYI4",
      "content": "## How to use\n\n### Setup\n\n#### Quick Start\n\n```bash\nnpx create-next-app\n```\n\n_([npx](https://medium.com/@maybekatz/introducing-npx-an-npm-package-runner-55f7d4bd282b) comes with npm 5.2+ and higher, see [instructions for older npm versions](https://gist.github.com/timer/833d9946fa8a05ba855729d05a38ac23))_\n\n#### Manual Setup\n\nInstall it in your project:\n\n```bash\nnpm install --save next react react-dom\n```\n\nand add a script to your package.json like this:\n\n```json\n{\n  \"scripts\": {\n    \"dev\": \"next\",\n    \"build\": \"next build\",\n    \"start\": \"next start\"\n  }\n}\n```\n\nAfter that, the file-system is the main API. Every `.js` file becomes a route that gets automatically processed and rendered.\n\nPopulate `./pages/index.js` inside your project:\n\n```jsx\nfunction Home() {\n  return <div>Welcome to Next.js!</div>\n}\n\nexport default Home\n```\n\nand then just run `npm run dev` and go to `http://localhost:3000`. To use another port, you can run `npm run dev -- -p <your port here>`.\n\nSo far, we get:\n\n- Automatic transpilation and bundling (with webpack and babel)\n- Hot code reloading\n- Server rendering and indexing of `./pages/`\n- Static file serving. `./public/` is mapped to `/` (given you [create a `./public/` directory](#static-file-serving-eg-images) inside your project)\n\n### Automatic code splitting\n\nEvery `import` you declare gets bundled and served with each page. That means pages never load unnecessary code!\n\n```jsx\nimport cowsay from 'cowsay-browser'\n\nfunction CowsayHi() {\n  return <pre>{cowsay.say({ text: 'hi there!' })}</pre>\n}\n\nexport default CowsayHi\n```\n\n### CSS\n\n#### Built-in CSS support\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/basic-css\">Basic css</a></li>\n  </ul>\n</details>\n\nWe bundle [styled-jsx](https://github.com/zeit/styled-jsx) to provide support for isolated scoped CSS. The aim is to support \"shadow CSS\" similar to Web Components, which unfortunately [do not support server-rendering and are JS-only](https://github.com/w3c/webcomponents/issues/71).\n\n```jsx\nfunction HelloWorld() {\n  return (\n    <div>\n      Hello world\n      <p>scoped!</p>\n      <style jsx>{`\n        p {\n          color: blue;\n        }\n        div {\n          background: red;\n        }\n        @media (max-width: 600px) {\n          div {\n            background: blue;\n          }\n        }\n      `}</style>\n      <style global jsx>{`\n        body {\n          background: black;\n        }\n      `}</style>\n    </div>\n  )\n}\n\nexport default HelloWorld\n```\n\nPlease see the [styled-jsx documentation](https://www.npmjs.com/package/styled-jsx) for more examples.\n\n#### CSS-in-JS\n\n<details>\n  <summary>\n    <b>Examples</b>\n  </summary>\n  <ul>\n    <li><a href=\"/examples/with-styled-components\">Styled components</a></li>\n    <li><a href=\"/examples/with-styletron\">Styletron</a></li>\n    <li><a href=\"/examples/with-glamor\">Glamor</a></li>\n    <li><a href=\"/examples/with-cxs\">Cxs</a></li>\n    <li><a href=\"/examples/with-aphrodite\">Aphrodite</a></li>\n    <li><a href=\"/examples/with-fela\">Fela</a></li>\n  </ul>\n</details>\n\nIt's possible to use any existing CSS-in-JS solution. The simplest one is inline styles:\n\n```jsx\nfunction HiThere() {\n  return <p style={{ color: 'red' }}>hi there</p>\n}\n\nexport default HiThere\n```\n\nTo use more sophisticated CSS-in-JS solutions, you typically have to implement style flushing for server-side rendering. We enable this by allowing you to define your own [custom `<Document>`](#custom-document) component that wraps each page.\n\n#### Importing CSS / Sass / Less / Stylus files\n\nTo support importing `.css`, `.scss`, `.less` or `.styl` files you can use these modules, which configure sensible defaults for server rendered applications.\n\n- [@zeit/next-css](https://github.com/zeit/next-plugins/tree/master/packages/next-css)\n- [@zeit/next-sass](https://github.com/zeit/next-plugins/tree/master/packages/next-sass)\n- [@zeit/next-less](https://github.com/zeit/next-plugins/tree/master/packages/next-less)\n- [@zeit/next-stylus](https://github.com/zeit/next-plugins/tree/master/packages/next-stylus)\n\n### Static file serving (e.g.: images)\n\nCreate a folder called `public` in your project root directory. From your code you can then reference those files starting from the baseURL `/`\n\n```jsx\nfunction MyImage() {\n  return <img src=\"/my-image.png\" alt=\"my image\" />\n}\n\nexport default MyImage\n```\n\n_Note: Don't name the `public` directory anything else. The name can't be changed and is the only directory that Next.js uses for serving static assets._\n\n### Dynamic Routing\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/dynamic-routing\">Dynamic routing</a></li>\n  </ul>\n</details>\n\nDefining routes by using predefined paths is not always enough for complex applications, in Next.js you can add brackets to a page (`[param]`) to create a dynamic route (a.k.a. url slugs, pretty urls, et al).\n\nConsider the following page `pages/post/[pid].js`:\n\n```jsx\nimport { useRouter } from 'next/router'\n\nconst Post = () => {\n  const router = useRouter()\n  const { pid } = router.query\n\n  return <p>Post: {pid}</p>\n}\n\nexport default Post\n```\n\nAny route like `/post/1`, `/post/abc`, etc will be matched by `pages/post/[pid].js`.\nThe matched path parameter will be sent as a query parameter to the page.\n\nFor example, the route `/post/abc` will have the following `query` object: `{ pid: 'abc' }`.\nSimilarly, the route `/post/abc?foo=bar` will have the `query` object: `{ foo: 'bar', pid: 'abc' }`.\n\n> Note: Multiple dynamic route segments work the same way.\n>\n> For example, `pages/post/[pid]/[comment].js` would match `/post/1/a-comment`.\n> Its `query` object would be: `{ pid: '1', comment: 'a-comment' }`.\n\nA `<Link>` for `/post/abc` looks like so:\n\n```jsx\n<Link href=\"/post/[pid]\" as=\"/post/abc\">\n  <a>First Post</a>\n</Link>\n```\n\n- `href`: the path inside `pages` directory.\n- `as`: the path that will be rendered in the browser URL bar.\n\nAs `href` is a filesystem path, it shouldn't change at runtime, instead, you will probably need to change `as`\ndynamically according to your needs. Here's an example to create a list of links:\n\n```jsx\nconst pids = ['id1', 'id2', 'id3']\n{\n  pids.map(pid => (\n    <Link href=\"/post/[pid]\" as={`/post/${pid}`}>\n      <a>Post {pid}</a>\n    </Link>\n  ))\n}\n```\n\n> You can [read more about `<Link>` here](#with-link).\n\nHowever, if a query and route param name are the same, route parameters will override the matching query params.\nFor example, `/post/abc?pid=bcd` will have the `query` object: `{ pid: 'abc' }`.\n\n> **Note**: Predefined routes take precedence over dynamic routes.\n> For example, if you have `pages/post/[pid].js` and `pages/post/create.js`, the route `/post/create` will be matched by `pages/post/create.js` instead of the dynamic route (`[pid]`).\n\n> **Note**: Pages that are statically optimized by [automatic static optimization](#automatic-static-optimization) will be hydrated without their route parameters provided (`query` will be empty, i.e. `{}`).\n> After hydration, Next.js will trigger an update to your application to provide the route parameters in the `query` object.\n> If your application cannot tolerate this behavior, you can opt-out of static optimization by capturing the query parameter in `getInitialProps`.\n\n> **Note**: If deploying to [ZEIT Now](https://zeit.co/now) dynamic routes will work out-of-the-box.\n> You do not need to configure custom routes in a `now.json` file.\n>\n> If you are new to ZEIT Now, you can learn how to deploy a Next.js app to it in the [_Deploying a Next.js App_ Learn section](https://nextjs.org/learn/basics/deploying-a-nextjs-app).\n\n### Populating `<head>`\n\n<details>\n<summary><b>Examples</b></summary>\n<ul>\n <li><a href=\"/examples/head-elements\">Head elements</a></li>\n <li><a href=\"/examples/layout-component\">Layout component</a></li>\n</ul>\n</details>\n\nWe expose a built-in component for appending elements to the `<head>` of the page.\n\n```jsx\nimport Head from 'next/head'\n\nfunction IndexPage() {\n  return (\n    <div>\n      <Head>\n        <title>My page title</title>\n        <meta name=\"viewport\" content=\"initial-scale=1.0, width=device-width\" />\n      </Head>\n      <p>Hello world!</p>\n    </div>\n  )\n}\n\nexport default IndexPage\n```\n\nTo avoid duplicate tags in your `<head>` you can use the `key` property, which will make sure the tag is only rendered once:\n\n```jsx\nimport Head from 'next/head'\n\nfunction IndexPage() {\n  return (\n    <div>\n      <Head>\n        <title>My page title</title>\n        <meta\n          name=\"viewport\"\n          content=\"initial-scale=1.0, width=device-width\"\n          key=\"viewport\"\n        />\n      </Head>\n      <Head>\n        <meta\n          name=\"viewport\"\n          content=\"initial-scale=1.2, width=device-width\"\n          key=\"viewport\"\n        />\n      </Head>\n      <p>Hello world!</p>\n    </div>\n  )\n}\n\nexport default IndexPage\n```\n\nIn this case only the second `<meta name=\"viewport\" />` is rendered.\n\n_Note: The contents of `<head>` get cleared upon unmounting the component, so make sure each page completely defines what it needs in `<head>`, without making assumptions about what other pages added._\n\n_Note: `<title>` and `<meta>` elements need to be contained as **direct** children of the `<Head>` element, or wrapped into maximum one level of `<React.Fragment>`, otherwise the metatags won't be correctly picked up on clientside navigation._\n\n### Fetching data and component lifecycle\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/data-fetch\">Data fetch</a></li>\n  </ul>\n</details>\n\nWhen you need state, lifecycle hooks or **initial data population** you can export a function component that uses [Hooks](https://reactjs.org/docs/hooks-intro.html) or a [class component](https://reactjs.org/docs/react-component.html).\n\nUsing a function component:\n\n```jsx\nimport fetch from 'isomorphic-unfetch'\n\nfunction Page({ stars }) {\n  return <div>Next stars: {stars}</div>\n}\n\nPage.getInitialProps = async ({ req }) => {\n  const res = await fetch('https://api.github.com/repos/zeit/next.js')\n  const json = await res.json()\n  return { stars: json.stargazers_count }\n}\n\nexport default Page\n```\n\nUsing a class component:\n\n```jsx\nimport React from 'react'\n\nclass HelloUA extends React.Component {\n  static async getInitialProps({ req }) {\n    const userAgent = req ? req.headers['user-agent'] : navigator.userAgent\n    return { userAgent }\n  }\n\n  render() {\n    return <div>Hello World {this.props.userAgent}</div>\n  }\n}\n\nexport default HelloUA\n```\n\nNotice that to load data when the page loads, we use `getInitialProps` which is an [`async`](https://zeit.co/blog/async-and-await) static method. It can asynchronously fetch anything that resolves to a JavaScript plain `Object`, which populates `props`.\n\nData returned from `getInitialProps` is serialized when server rendering, similar to a `JSON.stringify`. Make sure the returned object from `getInitialProps` is a plain `Object` and not using `Date`, `Map` or `Set`.\n\nFor the initial page load, `getInitialProps` will execute on the server only. `getInitialProps` will only be executed on the client when navigating to a different route via the `Link` component or using the routing APIs.\n\n<br/>\n\n> - `getInitialProps` can **not** be used in children components. Only in `pages`.\n> - If you are using some server only modules inside `getInitialProps`, make sure to [import them properly](https://arunoda.me/blog/ssr-and-server-only-modules), otherwise, it'll slow down your app.\n\n<br/>\n\n`getInitialProps` receives a context object with the following properties:\n\n- `pathname` - path section of URL\n- `query` - query string section of URL parsed as an object\n- `asPath` - `String` of the actual path (including the query) shows in the browser\n- `req` - HTTP request object (server only)\n- `res` - HTTP response object (server only)\n- `err` - Error object if any error is encountered during the rendering\n\n### Routing\n\nNext.js does not ship a routes manifest with every possible route in the application, so the current page is not aware of any other pages on the client side. All subsequent routes get lazy-loaded, for scalability sake.\n\n#### With `<Link>`\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/hello-world\">Hello World</a></li>\n  </ul>\n</details>\n\nClient-side transitions between routes can be enabled via a `<Link>` component.\n\n> This component is not required for navigations to static pages that require a hard refresh, like when using [AMP](#amp-support).\n\n**Basic Example**\n\nConsider these two pages:\n\n```jsx\n// pages/index.js\nimport Link from 'next/link'\n\nfunction Home() {\n  return (\n    <>\n      <ul>\n        <li>Home</li>\n        <li>\n          <Link href=\"/about\">\n            <a>About Us</a>\n          </Link>\n        </li>\n      </ul>\n\n      <h1>This is our homepage.</h1>\n    </>\n  )\n}\n\nexport default Home\n```\n\n```jsx\n// pages/about.js\nimport Link from 'next/link'\n\nfunction About() {\n  return (\n    <>\n      <ul>\n        <li>\n          <Link href=\"/\">\n            <a>Home</a>\n          </Link>\n        </li>\n        <li>About Us</li>\n      </ul>\n\n      <h1>About</h1>\n      <p>We are a cool company.</p>\n    </>\n  )\n}\n\nexport default About\n```\n\nNote: if passing a functional component as a child of `<Link>` you will need to wrap it in [`React.forwardRef`](https://reactjs.org/docs/react-api.html#reactforwardref)\n\n**Example with `React.forwardRef`**\n\n```jsx\nimport React from 'react'\nimport Link from 'next/link'\n\n// `onClick`, `href`, and `ref` need to be passed to the DOM element\n// for proper handling\nconst MyButton = React.forwardRef(({ onClick, href }, ref) => (\n  <a href={href} onClick={onClick} ref={ref}>\n    Click Me\n  </a>\n))\n\nexport default () => (\n  <>\n    <Link href=\"/another\">\n      <MyButton />\n    </Link>\n  </>\n)\n```\n\n**Custom routes (using props from URL)**\n\nIf you find that your use case is not covered by [Dynamic Routing](#dynamic-routing) then you can create a custom server and manually add dynamic routes.\n\nExample:\n\n1. Consider you have the URL `/post/:slug`.\n\n2. You created `pages/post.js`:\n\n   ```jsx\n   import { useRouter } from 'next/router'\n\n   const Post = () => {\n     const router = useRouter()\n     const { slug } = router.query\n\n     return <p>My Blog Post: {slug}</p>\n   }\n\n   export default Post\n   ```\n\n3. You add the route to `express` (or any other server) on `server.js` file (this is only for SSR). This will route the url `/post/:slug` to `pages/post.js` and provide `slug` as part of the `query` object to the page.\n\n   ```jsx\n   server.get('/post/:slug', (req, res) => {\n     return app.render(req, res, '/post', { slug: req.params.slug })\n   })\n   ```\n\n4. For client side routing, use `next/link`:\n\n   ```jsx\n   <Link href=\"/post?slug=something\" as=\"/post/something\">\n   ```\n\n   - `href`: the path inside `pages` directory\n   - `as`: the path used by your server routes\n\nClient-side routing behaves exactly like the browser:\n\n1. The component is fetched.\n2. If it defines `getInitialProps`, data is fetched. If an error occurs, `_error.js` is rendered.\n3. After 1 and 2 complete, `pushState` is performed and the new component is rendered.\n\nTo inject the `pathname`, `query` or `asPath` in your component, you can use the [useRouter](#userouter) hook, or [withRouter](#using-a-higher-order-component) for class components.\n\n##### With URL object\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-url-object-routing\">With URL Object Routing</a></li>\n  </ul>\n</details>\n\nThe component `<Link>` can also receive a URL object and it will automatically format it to create the URL string.\n\n```jsx\n// pages/index.js\nimport Link from 'next/link'\n\nfunction Home() {\n  return (\n    <div>\n      Click{' '}\n      <Link href={{ pathname: '/about', query: { name: 'Zeit' } }}>\n        <a>here</a>\n      </Link>{' '}\n      to read more\n    </div>\n  )\n}\n\nexport default Home\n```\n\nThat will generate the URL string `/about?name=Zeit`, you can use every property as defined in the [Node.js URL module documentation](https://nodejs.org/api/url.html#url_url_strings_and_url_objects).\n\n##### Replace instead of push url\n\nThe default behaviour for the `<Link>` component is to `push` a new url into the stack. You can use the `replace` prop to prevent adding a new entry.\n\n```jsx\n// pages/index.js\nimport Link from 'next/link'\n\nfunction Home() {\n  return (\n    <div>\n      Click{' '}\n      <Link href=\"/about\" replace>\n        <a>here</a>\n      </Link>{' '}\n      to read more\n    </div>\n  )\n}\n\nexport default Home\n```\n\n##### Using a component that supports `onClick`\n\n`<Link>` supports any component that supports the `onClick` event. In case you don't provide an `<a>` tag, it will only add the `onClick` event handler and won't pass the `href` property.\n\n```jsx\n// pages/index.js\nimport Link from 'next/link'\n\nfunction Home() {\n  return (\n    <div>\n      Click{' '}\n      <Link href=\"/about\">\n        <img src=\"/static/image.png\" alt=\"image\" />\n      </Link>\n    </div>\n  )\n}\n\nexport default Home\n```\n\n##### Forcing the Link to expose `href` to its child\n\nIf child is an `<a>` tag and doesn't have a href attribute we specify it so that the repetition is not needed by the user. However, sometimes, you’ll want to pass an `<a>` tag inside of a wrapper and the `Link` won’t recognize it as a _hyperlink_, and, consequently, won’t transfer its `href` to the child. In cases like that, you should define a boolean `passHref` property to the `Link`, forcing it to expose its `href` property to the child.\n\n**Please note**: using a tag other than `a` and failing to pass `passHref` may result in links that appear to navigate correctly, but, when being crawled by search engines, will not be recognized as links (owing to the lack of `href` attribute). This may result in negative effects on your site’s SEO.\n\n```jsx\nimport Link from 'next/link'\nimport Unexpected_A from 'third-library'\n\nfunction NavLink({ href, name }) {\n  return (\n    <Link href={href} passHref>\n      <Unexpected_A>{name}</Unexpected_A>\n    </Link>\n  )\n}\n\nexport default NavLink\n```\n\n##### Disabling the scroll changes to top on page\n\nThe default behaviour of `<Link>` is to scroll to the top of the page. When there is a hash defined it will scroll to the specific id, just like a normal `<a>` tag. To prevent scrolling to the top / hash `scroll={false}` can be added to `<Link>`:\n\n```jsx\n<Link scroll={false} href=\"/?counter=10\"><a>Disables scrolling</a></Link>\n<Link href=\"/?counter=10\"><a>Changes with scrolling to top</a></Link>\n```\n\n#### Imperatively\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/using-router\">Basic routing</a></li>\n    <li><a href=\"/examples/with-loading\">With a page loading indicator</a></li>\n  </ul>\n</details>\n\nYou can also do client-side page transitions using `next/router`:\n\n```jsx\nimport Router from 'next/router'\n\nfunction ReadMore() {\n  return (\n    <div>\n      Click <span onClick={() => Router.push('/about')}>here</span> to read more\n    </div>\n  )\n}\n\nexport default ReadMore\n```\n\n#### Intercepting `popstate`\n\nIn some cases (for example, if using a [custom router](#custom-server-and-routing)), you may wish\nto listen to [`popstate`](https://developer.mozilla.org/en-US/docs/Web/Events/popstate) and react before the router acts on it.\nFor example, you could use this to manipulate the request, or force an SSR refresh.\n\n```jsx\nimport Router from 'next/router'\n\nRouter.beforePopState(({ url, as, options }) => {\n  // I only want to allow these two routes!\n  if (as !== '/' && as !== '/other') {\n    // Have SSR render bad routes as a 404.\n    window.location.href = as\n    return false\n  }\n\n  return true\n})\n```\n\nIf the function you pass into `beforePopState` returns `false`, `Router` will not handle `popstate`;\nyou'll be responsible for handling it, in that case.\nSee [Disabling File-System Routing](#disabling-file-system-routing).\n\nAbove `Router` object comes with the following API:\n\n- `route` - `String` of the current route\n- `pathname` - `String` of the current path excluding the query string\n- `query` - `Object` with the parsed query string. Defaults to `{}`.\n- `asPath` - `String` of the actual path (including the query) shows in the browser\n- `push(url, as=url)` - performs a `pushState` call with the given url\n- `replace(url, as=url)` - performs a `replaceState` call with the given url\n- `beforePopState(cb=function)` - intercept popstate before router processes the event\n\nThe second `as` parameter for `push` and `replace` is an optional _decoration_ of the URL. Useful if you configured custom routes on the server.\n\n##### With URL object\n\nYou can use a URL object the same way you use it in a `<Link>` component to `push` and `replace` a URL.\n\n```jsx\nimport Router from 'next/router'\n\nconst handler = () => {\n  Router.push({\n    pathname: '/about',\n    query: { name: 'Zeit' },\n  })\n}\n\nfunction ReadMore() {\n  return (\n    <div>\n      Click <span onClick={handler}>here</span> to read more\n    </div>\n  )\n}\n\nexport default ReadMore\n```\n\nThis uses the same exact parameters as [in the `<Link>` component](#with-url-object). The first parameter maps to `href` while the second parameter maps to `as` in the `<Link>` component as documented [here](#with-url-object).\n\n##### Router Events\n\nYou can also listen to different events happening inside the Router.\nHere's a list of supported events:\n\n- `routeChangeStart(url)` - Fires when a route starts to change\n- `routeChangeComplete(url)` - Fires when a route changed completely\n- `routeChangeError(err, url)` - Fires when there's an error when changing routes, or a route load is cancelled\n- `beforeHistoryChange(url)` - Fires just before changing the browser's history\n- `hashChangeStart(url)` - Fires when the hash will change but not the page\n- `hashChangeComplete(url)` - Fires when the hash has changed but not the page\n\n> Here `url` is the URL shown in the browser. If you call `Router.push(url, as)` (or similar), then the value of `url` will be `as`.\n\nHere's how to properly listen to the router event `routeChangeStart`:\n\n```js\nconst handleRouteChange = url => {\n  console.log('App is changing to: ', url)\n}\n\nRouter.events.on('routeChangeStart', handleRouteChange)\n```\n\nIf you no longer want to listen to that event, you can unsubscribe with the `off` method:\n\n```js\nRouter.events.off('routeChangeStart', handleRouteChange)\n```\n\nIf a route load is cancelled (for example by clicking two links rapidly in succession), `routeChangeError` will fire. The passed `err` will contain a `cancelled` property set to `true`.\n\n```js\nRouter.events.on('routeChangeError', (err, url) => {\n  if (err.cancelled) {\n    console.log(`Route to ${url} was cancelled!`)\n  }\n})\n```\n\n> **Note**: Using router events in `getInitialProps` is discouraged as it may result in unexpected behavior.<br/>\n> Router events should be registered when a component mounts (`useEffect` or `componentDidMount`/`componentWillUnmount`) or imperatively when an event happens.\n>\n> ```js\n> useEffect(() => {\n>   const handleRouteChange = url => {\n>     console.log('App is changing to: ', url)\n>   }\n>\n>   Router.events.on('routeChangeStart', handleRouteChange)\n>   return () => {\n>     Router.events.off('routeChangeStart', handleRouteChange)\n>   }\n> }, [])\n> ```\n\n##### Shallow Routing\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-shallow-routing\">Shallow Routing</a></li>\n  </ul>\n</details>\n\nShallow routing allows you to change the URL without running `getInitialProps`. You'll receive the updated `pathname` and the `query` via the `router` prop (injected by using [`useRouter`](#userouter) or [`withRouter`](#using-a-higher-order-component)), without losing state.\n\nYou can do this by invoking either `Router.push` or `Router.replace` with the `shallow: true` option. Here's an example:\n\n```js\n// Current URL is \"/\"\nconst href = '/?counter=10'\nconst as = href\nRouter.push(href, as, { shallow: true })\n```\n\nNow, the URL is updated to `/?counter=10`. You can see the updated URL with `this.props.router.query` inside the `Component` (make sure you are using [`withRouter`](#using-a-higher-order-component) around your `Component` to inject the `router` prop).\n\nYou can watch for URL changes via [`componentDidUpdate`](https://reactjs.org/docs/react-component.html#componentdidupdate) hook as shown below:\n\n```js\ncomponentDidUpdate(prevProps) {\n  const { pathname, query } = this.props.router\n  // verify props have changed to avoid an infinite loop\n  if (query.id !== prevProps.router.query.id) {\n    // fetch data based on the new query\n  }\n}\n```\n\n> NOTES:\n>\n> Shallow routing works **only** for same page URL changes. For an example, let's assume we have another page called `about`, and you run this:\n>\n> ```js\n> Router.push('/?counter=10', '/about?counter=10', { shallow: true })\n> ```\n>\n> Since that's a new page, it'll unload the current page, load the new one and call `getInitialProps` even though we asked to do shallow routing.\n\n#### useRouter\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/dynamic-routing\">Dynamic routing</a></li>\n  </ul>\n</details>\n\nIf you want to access the `router` object inside any functional component in your app, you can use the `useRouter` hook, here's how to use it:\n\n```jsx\nimport { useRouter } from 'next/router'\n\nexport default function ActiveLink({ children, href }) {\n  const router = useRouter()\n  const style = {\n    marginRight: 10,\n    color: router.pathname === href ? 'red' : 'black',\n  }\n\n  const handleClick = e => {\n    e.preventDefault()\n    router.push(href)\n  }\n\n  return (\n    <a href={href} onClick={handleClick} style={style}>\n      {children}\n    </a>\n  )\n}\n```\n\n> **Note**: `useRouter` is a React hook, meaning it cannot be used with classes.\n> You can either use [`withRouter`](#using-a-higher-order-component) (a higher order component) or wrap your class in a functional component.\n\nThe above `router` object comes with an API similar to [`next/router`](#imperatively).\n\n#### Using a Higher Order Component\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/using-with-router\">Using the `withRouter` utility</a></li>\n  </ul>\n</details>\n\nIf [useRouter](#userouter) is not the best fit for you, `withRouter` can also add the same `router` object to any component, here's how to use it:\n\n```jsx\nimport { withRouter } from 'next/router'\n\nfunction Page({ router }) {\n  return <p>{router.pathname}</p>\n}\n\nexport default withRouter(Page)\n```\n\n### Prefetching Pages\n\n⚠️ This is a production only feature ⚠️\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-prefetching\">Prefetching</a></li>\n  </ul>\n</details>\n\nNext.js has an API which allows you to prefetch pages.\n\nSince Next.js server-renders your pages, this allows all the future interaction paths of your app to be instant. Effectively Next.js gives you the great initial download performance of a _website_, with the ahead-of-time download capabilities of an _app_. [Read more](https://zeit.co/blog/next#anticipation-is-the-key-to-performance).\n\n> With prefetching Next.js only downloads JS code. When the page is getting rendered, you may need to wait for the data.\n\n> Automatic prefetching is disabled if your device is connected with 2G network or [Save-Data](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Save-Data) header is `on`.\n\n> `<link rel=\"preload\">` is used for prefetching. Sometimes browsers will show a warning if the resource is not used within 3 seconds, these warnings can be ignored as per https://github.com/zeit/next.js/issues/6517#issuecomment-469063892.\n\n#### With `<Link>`\n\n`<Link>` will automatically prefetch pages in the background as they appear in the view. If certain pages are rarely visited you can manually set `prefetch` to `false`, here's how:\n\n```jsx\n<Link href=\"/about\" prefetch={false}>\n  <a>About</a>\n</Link>\n```\n\n#### Imperatively\n\nMost prefetching needs are addressed by `<Link />`, but we also expose an imperative API for advanced usage:\n\n```jsx\nimport { useRouter } from 'next/router'\n\nexport default function MyLink() {\n  const router = useRouter()\n\n  return (\n    <>\n      <a onClick={() => setTimeout(() => router.push('/dynamic'), 100)}>\n        A route transition will happen after 100ms\n      </a>\n      {// and we can prefetch it!\n      router.prefetch('/dynamic')}\n    </>\n  )\n}\n```\n\n`router` methods should be only used inside the client side of your app though. In order to prevent any error regarding this subject use the imperative `prefetch` method in the `useEffect()` hook:\n\n```jsx\nimport { useRouter } from 'next/router'\n\nexport default function MyLink() {\n  const router = useRouter()\n\n  useEffect(() => {\n    router.prefetch('/dynamic')\n  })\n\n  return (\n    <a onClick={() => setTimeout(() => router.push('/dynamic'), 100)}>\n      A route transition will happen after 100ms\n    </a>\n  )\n}\n```\n\nYou can also add it to the `componentDidMount()` lifecycle method when using `React.Component`:\n\n```jsx\nimport React from 'react'\nimport { withRouter } from 'next/router'\n\nclass MyLink extends React.Component {\n  componentDidMount() {\n    const { router } = this.props\n    router.prefetch('/dynamic')\n  }\n\n  render() {\n    const { router } = this.props\n\n    return (\n      <a onClick={() => setTimeout(() => router.push('/dynamic'), 100)}>\n        A route transition will happen after 100ms\n      </a>\n    )\n  }\n}\n\nexport default withRouter(MyLink)\n```\n\n### API Routes\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/api-routes\">Basic API routes</a></li>\n    <li><a href=\"/examples/api-routes-micro\">API routes with micro</a></li>\n    <li><a href=\"/examples/api-routes-middleware\">API routes with middleware</a></li>\n    <li><a href=\"/examples/api-routes-graphql\">API routes with GraphQL server</a></li>\n    <li><a href=\"/examples/api-routes-rest\">API routes with REST</a></li>\n  </ul>\n</details>\n\nAPI routes provide a straightforward solution to build your **API** with Next.js.\nStart by creating the `api/` folder inside the `./pages/` folder.\n\nEvery file inside `./pages/api` is mapped to `/api/*`.\nFor example, `./pages/api/posts.js` is mapped to the route `/api/posts`.\n\nHere's an example API route file:\n\n```js\nexport default (req, res) => {\n  res.setHeader('Content-Type', 'application/json')\n  res.statusCode = 200\n  res.end(JSON.stringify({ name: 'Nextjs' }))\n}\n```\n\n- `req` refers to [NextApiRequest](https://github.com/zeit/next.js/blob/v9.0.0/packages/next-server/lib/utils.ts#L143-L158) which extends [http.IncomingMessage](https://nodejs.org/api/http.html#http_class_http_incomingmessage)\n\n- `res` refers to [NextApiResponse](https://github.com/zeit/next.js/blob/v9.0.0/packages/next-server/lib/utils.ts#L168-L178) which extends [http.ServerResponse](https://nodejs.org/api/http.html#http_class_http_serverresponse)\n\nFor [API routes](#api-routes) there are built-in types `NextApiRequest` and `NextApiResponse`, which extend the `Node.js` request and response objects.\n\n```ts\nimport { NextApiRequest, NextApiResponse } from 'next'\n\nexport default (req: NextApiRequest, res: NextApiResponse) => {\n  res.status(200).json({ title: 'Next.js' })\n}\n```\n\nTo handle different HTTP methods for API calls you can access `req.method` in your resolver function:\n\n```js\nexport default (req, res) => {\n  if (req.method === 'POST') {\n    // Process your POST request\n  } else {\n    // Handle the rest of your HTTP methods\n  }\n}\n```\n\n> **Note**: API Routes [do not specify CORS headers](https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS), so they'll be **same-origin only** by default.\n> You can customize this behavior by wrapping your export with CORS middleware.\n> We provide an [example of this below](#api-middlewares).\n\nAPI Routes do not increase your client-side bundle size. They are server-side only bundles.\n\n#### Dynamic routes support\n\nAPI pages support [dynamic routing](#dynamic-routing), so you can use all benefits mentioned already above.\n\nConsider the following page `./pages/api/post/[pid].js`, here is how you get parameters inside the resolver method:\n\n```js\nexport default (req, res) => {\n  const {\n    query: { pid },\n  } = req\n\n  res.end(`Post: ${pid}`)\n}\n```\n\n#### API Middlewares\n\nAPI routes provides built in middlewares which parse the incoming `req`.\nThose middlewares are:\n\n- `req.cookies` - an object containing the cookies sent by the request. Defaults to `{}`\n- `req.query` - an object containing the [query string](https://en.wikipedia.org/wiki/Query_string). Defaults to `{}`\n- `req.body` - an object containing the body parsed by `content-type`, or `null` if no body is sent\n\nBody parsing is enabled by default with a size limit of `1mb` for the parsed body.\nYou can opt-out of automatic body parsing if you need to consume it as a `Stream`:\n\n```js\n// ./pages/api/my-endpoint.js\nexport default (req, res) => {\n  // ...\n}\n\nexport const config = {\n  api: {\n    bodyParser: false,\n  },\n}\n```\n\nYou can adjust size of parsed body by adding `sizeLimit` key to `bodyParser`, supported values are by [bytes](https://github.com/visionmedia/bytes.js) library.\n\n```js\n// ./pages/api/my-endpoint.js\nexport default (req, res) => {\n  // ...\n}\n\nexport const config = {\n  api: {\n    bodyParser: {\n      sizeLimit: '1mb',\n    },\n  },\n}\n```\n\nAs an added bonus, you can also use any [Micro](https://github.com/zeit/micro) compatible [middleware](https://github.com/amio/awesome-micro)!\n\nFor example, [configuring CORS](https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS) for your API endpoint can be done leveraging `micro-cors`.\n\nFirst, install `micro-cors`:\n\n```bash\nnpm i micro-cors\n# or\nyarn add micro-cors\n```\n\nThen, import `micro-cors` and [configure it](https://github.com/possibilities/micro-cors#readme). Finally, wrap your exported function in the middleware:\n\n```js\nimport Cors from 'micro-cors'\n\nconst cors = Cors({\n  allowMethods: ['GET', 'HEAD'],\n})\n\nfunction Endpoint(req, res) {\n  res.json({ message: 'Hello Everyone!' })\n}\n\nexport default cors(Endpoint)\n```\n\n#### Helper Functions\n\nWe're providing a set of Express.js-like methods to improve the developer experience and increase the speed of creating new API endpoints:\n\n```js\nexport default (req, res) => {\n  res.status(200).json({ name: 'Next.js' })\n}\n```\n\n- `res.status(code)` - a function to set the status code. `code` must be a valid [HTTP status code](https://en.wikipedia.org/wiki/List_of_HTTP_status_codes)\n- `res.json(json)` - Sends a `JSON` response. `json` must be a valid `JSON` object\n- `res.send(body)` - Sends the HTTP response. `body` can be a `string`, an `object` or a `Buffer`\n\n### Custom server and routing\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/custom-server\">Basic custom server</a></li>\n    <li><a href=\"/examples/custom-server-express\">Express integration</a></li>\n    <li><a href=\"/examples/custom-server-hapi\">Hapi integration</a></li>\n    <li><a href=\"/examples/custom-server-koa\">Koa integration</a></li>\n    <li><a href=\"/examples/ssr-caching\">SSR caching</a></li>\n  </ul>\n</details>\n\nTypically you start your next server with `next start`. It's possible, however, to start a server 100% programmatically in order to customize routes, use route patterns, etc.\n\nWhen using a custom server with a server file, for example called `server.js`, make sure you update the scripts key in `package.json` to:\n\n```json\n{\n  \"scripts\": {\n    \"dev\": \"node server.js\",\n    \"build\": \"next build\",\n    \"start\": \"NODE_ENV=production node server.js\"\n  }\n}\n```\n\nThis example makes `/a` resolve to `./pages/b`, and `/b` resolve to `./pages/a`:\n\n```js\n// This file doesn't go through babel or webpack transformation.\n// Make sure the syntax and sources this file requires are compatible with the current node version you are running\n// See https://github.com/zeit/next.js/issues/1245 for discussions on Universal Webpack or universal Babel\nconst { createServer } = require('http')\nconst { parse } = require('url')\nconst next = require('next')\n\nconst dev = process.env.NODE_ENV !== 'production'\nconst app = next({ dev })\nconst handle = app.getRequestHandler()\n\napp.prepare().then(() => {\n  createServer((req, res) => {\n    // Be sure to pass `true` as the second argument to `url.parse`.\n    // This tells it to parse the query portion of the URL.\n    const parsedUrl = parse(req.url, true)\n    const { pathname, query } = parsedUrl\n\n    if (pathname === '/a') {\n      app.render(req, res, '/b', query)\n    } else if (pathname === '/b') {\n      app.render(req, res, '/a', query)\n    } else {\n      handle(req, res, parsedUrl)\n    }\n  }).listen(3000, err => {\n    if (err) throw err\n    console.log('> Ready on http://localhost:3000')\n  })\n})\n```\n\nThe `next` API is as follows:\n\n- `next(opts: object)`\n\nSupported options:\n\n- `dev` (`bool`) whether to launch Next.js in dev mode - default `false`\n- `dir` (`string`) where the Next project is located - default `'.'`\n- `quiet` (`bool`) Hide error messages containing server information - default `false`\n- `conf` (`object`) the same object you would use in `next.config.js` - default `{}`\n\nThen, change your `start` script to `NODE_ENV=production node server.js`.\n\n#### Disabling file-system routing\n\nBy default, `Next` will serve each file in `/pages` under a pathname matching the filename (eg, `/pages/some-file.js` is served at `site.com/some-file`.\n\nIf your project uses custom routing, this behavior may result in the same content being served from multiple paths, which can present problems with SEO and UX.\n\nTo disable this behavior & prevent routing based on files in `/pages`, simply set the following option in your `next.config.js`:\n\n```js\n// next.config.js\nmodule.exports = {\n  useFileSystemPublicRoutes: false,\n}\n```\n\nNote that `useFileSystemPublicRoutes` simply disables filename routes from SSR; client-side routing may still access those paths. If using this option, you should guard against navigation to routes you do not want programmatically.\n\nYou may also wish to configure the client-side Router to disallow client-side redirects to filename routes; please refer to [Intercepting `popstate`](#intercepting-popstate).\n\n#### Dynamic assetPrefix\n\nSometimes we need to set the `assetPrefix` dynamically. This is useful when changing the `assetPrefix` based on incoming requests.\nFor that, we can use `app.setAssetPrefix`.\n\nHere's an example usage of it:\n\n```js\nconst next = require('next')\nconst http = require('http')\n\nconst dev = process.env.NODE_ENV !== 'production'\nconst app = next({ dev })\nconst handleNextRequests = app.getRequestHandler()\n\napp.prepare().then(() => {\n  const server = new http.Server((req, res) => {\n    // Add assetPrefix support based on the hostname\n    if (req.headers.host === 'my-app.com') {\n      app.setAssetPrefix('http://cdn.com/myapp')\n    } else {\n      app.setAssetPrefix('')\n    }\n\n    handleNextRequests(req, res)\n  })\n\n  server.listen(port, err => {\n    if (err) {\n      throw err\n    }\n\n    console.log(`> Ready on http://localhost:${port}`)\n  })\n})\n```\n\n#### Changing x-powered-by\n\nBy default Next.js will add `x-powered-by` to the request headers. There's an optional way to opt-out of this:\n\n```js\n// next.config.js\nmodule.exports = {\n  poweredByHeader: false,\n}\n```\n\n### Dynamic Import\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-dynamic-import\">With Dynamic Import</a></li>\n  </ul>\n</details>\n\nNext.js supports ES2020 [dynamic `import()`](https://github.com/tc39/proposal-dynamic-import) for JavaScript.\nWith that, you could import JavaScript modules (inc. React Components) dynamically and work with them.\n\nYou can think dynamic imports as another way to split your code into manageable chunks.\nSince Next.js supports dynamic imports with SSR, you could do amazing things with it.\n\nHere are a few ways to use dynamic imports.\n\n#### Basic Usage (Also does SSR)\n\n```jsx\nimport dynamic from 'next/dynamic'\n\nconst DynamicComponent = dynamic(() => import('../components/hello'))\n\nfunction Home() {\n  return (\n    <div>\n      <Header />\n      <DynamicComponent />\n      <p>HOME PAGE is here!</p>\n    </div>\n  )\n}\n\nexport default Home\n```\n\n#### With named exports\n\n```jsx\n// components/hello.js\nexport function Hello() {\n  return <p>Hello!</p>\n}\n```\n\n```jsx\nimport dynamic from 'next/dynamic'\n\nconst DynamicComponent = dynamic(() =>\n  import('../components/hello').then(mod => mod.Hello)\n)\n\nfunction Home() {\n  return (\n    <div>\n      <Header />\n      <DynamicComponent />\n      <p>HOME PAGE is here!</p>\n    </div>\n  )\n}\n\nexport default Home\n```\n\n#### With Custom Loading Component\n\n```jsx\nimport dynamic from 'next/dynamic'\n\nconst DynamicComponentWithCustomLoading = dynamic(\n  () => import('../components/hello2'),\n  { loading: () => <p>...</p> }\n)\n\nfunction Home() {\n  return (\n    <div>\n      <Header />\n      <DynamicComponentWithCustomLoading />\n      <p>HOME PAGE is here!</p>\n    </div>\n  )\n}\n\nexport default Home\n```\n\n#### With No SSR\n\n```jsx\nimport dynamic from 'next/dynamic'\n\nconst DynamicComponentWithNoSSR = dynamic(\n  () => import('../components/hello3'),\n  { ssr: false }\n)\n\nfunction Home() {\n  return (\n    <div>\n      <Header />\n      <DynamicComponentWithNoSSR />\n      <p>HOME PAGE is here!</p>\n    </div>\n  )\n}\n\nexport default Home\n```\n\n### Custom `<App>`\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-app-layout\">Using `_app.js` for layout</a></li>\n    <li><a href=\"/examples/with-componentdidcatch\">Using `_app.js` to override `componentDidCatch`</a></li>\n  </ul>\n</details>\n\nNext.js uses the `App` component to initialize pages. You can override it and control the page initialization. Which allows you to do amazing things like:\n\n- Persisting layout between page changes\n- Keeping state when navigating pages\n- Inject additional data into pages (for example by processing GraphQL queries)\n\nTo override, create the `./pages/_app.js` file and override the App class as shown below:\n\n```js\nfunction MyApp({ Component, pageProps }) {\n  return <Component {...pageProps} />\n}\n\n// Only uncomment this method if you have blocking data requirements for\n// every single page in your application. This disables the ability to\n// perform automatic static optimization, causing every page in your app to\n// be server-side rendered.\n//\n// MyApp.getInitialProps = async (appContext) => {\n//   // calls page's `getInitialProps` and fills `appProps.pageProps`\n//   const appProps = await App.getInitialProps(appContext);\n//\n//   return { ...appProps }\n// }\n\nexport default MyApp\n```\n\n> **Note:** Adding a custom `getInitialProps` in App will affect [Automatic Static Optimization](#automatic-static-optimization)\n\n### Custom `<Document>`\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-styled-components\">Styled components custom document</a></li>\n  </ul>\n</details>\n\nA custom `<Document>` is commonly used to augment your application's `<html>` and `<body>` tags.\nThis is necessary because Next.js pages skip the definition of the surrounding document's markup.\n\nThis allows you to support Server-Side Rendering for CSS-in-JS libraries like\n[styled-components](/examples/with-styled-components) or [emotion](/examples/with-emotion).\nNote, [styled-jsx](https://github.com/zeit/styled-jsx) is included in Next.js by default.\n\nA custom `<Document>` can also include `getInitialProps` for expressing asynchronous server-rendering data requirements.\n\n> **Note**: `<Document>`'s `getInitialProps` function is not called during client-side transitions,\n> nor when a page is [automatically statically optimized](#automatic-static-optimization).\n\n> **Note**: Make sure to check if `ctx.req` / `ctx.res` are defined in `getInitialProps`.\n> These variables will be `undefined` when a page is being statically exported for `next export` or [automatic static optimization](#automatic-static-optimization).\n\nTo use a custom `<Document>`, you must create a file at `./pages/_document.js` and extend the `Document` class:\n\n```jsx\n// _document is only rendered on the server side and not on the client side\n// Event handlers like onClick can't be added to this file\n\n// ./pages/_document.js\nimport Document, { Html, Head, Main, NextScript } from 'next/document'\n\nclass MyDocument extends Document {\n  static async getInitialProps(ctx) {\n    const initialProps = await Document.getInitialProps(ctx)\n    return { ...initialProps }\n  }\n\n  render() {\n    return (\n      <Html>\n        <Head />\n        <body>\n          <Main />\n          <NextScript />\n        </body>\n      </Html>\n    )\n  }\n}\n\nexport default MyDocument\n```\n\nAll of `<Html>`, `<Head />`, `<Main />` and `<NextScript />` are required for page to be properly rendered.\n\n**Note: React-components outside of `<Main />` will not be initialised by the browser. Do _not_ add application logic here. If you need shared components in all your pages (like a menu or a toolbar), take a look at the [`<App>`](#custom-app) component instead.**\n\nThe `ctx` object is equivalent to the one received in all [`getInitialProps`](#fetching-data-and-component-lifecycle) hooks, with one addition:\n\n- `renderPage` (`Function`) a callback that executes the actual React rendering logic (synchronously). It's useful to decorate this function in order to support server-rendering wrappers like Aphrodite's [`renderStatic`](https://github.com/Khan/aphrodite#server-side-rendering).\n\n#### Customizing `renderPage`\n\n🚧 It should be noted that the only reason you should be customizing `renderPage` is for usage with css-in-js libraries\nthat need to wrap the application to properly work with server-rendering. 🚧\n\n- It takes as argument an options object for further customization:\n\n```js\nimport Document from 'next/document'\n\nclass MyDocument extends Document {\n  static async getInitialProps(ctx) {\n    const originalRenderPage = ctx.renderPage\n\n    ctx.renderPage = () =>\n      originalRenderPage({\n        // useful for wrapping the whole react tree\n        enhanceApp: App => App,\n        // useful for wrapping in a per-page basis\n        enhanceComponent: Component => Component,\n      })\n\n    // Run the parent `getInitialProps` using `ctx` that now includes our custom `renderPage`\n    const initialProps = await Document.getInitialProps(ctx)\n\n    return initialProps\n  }\n}\n\nexport default MyDocument\n```\n\n### Custom error handling\n\n404 or 500 errors are handled both client and server side by a default component `error.js`. If you wish to override it, define a `_error.js` in the pages folder:\n\n⚠️ The `pages/_error.js` component is only used in production. In development you get an error with call stack to know where the error originated from. ⚠️\n\n```jsx\nimport React from 'react'\n\nfunction Error({ statusCode }) {\n  return (\n    <p>\n      {statusCode\n        ? `An error ${statusCode} occurred on server`\n        : 'An error occurred on client'}\n    </p>\n  )\n}\n\nError.getInitialProps = ({ res, err }) => {\n  const statusCode = res ? res.statusCode : err ? err.statusCode : 404\n  return { statusCode }\n}\n\nexport default Error\n```\n\n### Reusing the built-in error page\n\nIf you want to render the built-in error page you can by using `next/error`:\n\n```jsx\nimport React from 'react'\nimport Error from 'next/error'\nimport fetch from 'isomorphic-unfetch'\n\nconst Page = ({ errorCode, stars }) => {\n  if (errorCode) {\n    return <Error statusCode={errorCode} />\n  }\n\n  return <div>Next stars: {stars}</div>\n}\n\nPage.getInitialProps = async () => {\n  const res = await fetch('https://api.github.com/repos/zeit/next.js')\n  const errorCode = res.statusCode > 200 ? res.statusCode : false\n  const json = await res.json()\n\n  return { errorCode, stars: json.stargazers_count }\n}\n\nexport default Page\n```\n\n> If you have created a custom error page you have to import your own `_error` component from `./_error` instead of `next/error`.\n\nThe Error component also takes `title` as a property if you want to pass in a text message along with a `statusCode`.\n\n### Custom configuration\n\nFor custom advanced behavior of Next.js, you can create a `next.config.js` in the root of your project directory (next to `pages/` and `package.json`).\n\nNote: `next.config.js` is a regular Node.js module, not a JSON file. It gets used by the Next server and build phases, and not included in the browser build.\n\n```js\n// next.config.js\nmodule.exports = {\n  /* config options here */\n}\n```\n\nOr use a function:\n\n```js\nmodule.exports = (phase, { defaultConfig }) => {\n  return {\n    /* config options here */\n  }\n}\n```\n\n`phase` is the current context in which the configuration is loaded. You can see all phases here: [constants](/packages/next/next-server/lib/constants.ts)\nPhases can be imported from `next/constants`:\n\n```js\nconst { PHASE_DEVELOPMENT_SERVER } = require('next/constants')\nmodule.exports = (phase, { defaultConfig }) => {\n  if (phase === PHASE_DEVELOPMENT_SERVER) {\n    return {\n      /* development only config options here */\n    }\n  }\n\n  return {\n    /* config options for all phases except development here */\n  }\n}\n```\n\n#### Setting a custom build directory\n\nYou can specify a name to use for a custom build directory. For example, the following config will create a `build` folder instead of a `.next` folder. If no configuration is specified then next will create a `.next` folder.\n\n```js\n// next.config.js\nmodule.exports = {\n  distDir: 'build',\n}\n```\n\n#### Disabling etag generation\n\nYou can disable etag generation for HTML pages depending on your cache strategy. If no configuration is specified then Next will generate etags for every page.\n\n```js\n// next.config.js\nmodule.exports = {\n  generateEtags: false,\n}\n```\n\n#### Configuring the onDemandEntries\n\nNext exposes some options that give you some control over how the server will dispose or keep in memories pages built:\n\n```js\nmodule.exports = {\n  onDemandEntries: {\n    // period (in ms) where the server will keep pages in the buffer\n    maxInactiveAge: 25 * 1000,\n    // number of pages that should be kept simultaneously without being disposed\n    pagesBufferLength: 2,\n  },\n}\n```\n\nThis is development-only feature. If you want to cache SSR pages in production, please see [SSR-caching](https://github.com/zeit/next.js/tree/canary/examples/ssr-caching) example.\n\n#### Configuring extensions looked for when resolving pages in `pages`\n\nAimed at modules like [`@next/mdx`](https://github.com/zeit/next.js/tree/canary/packages/next-mdx), that add support for pages ending with `.mdx`. `pageExtensions` allows you to configure the extensions looked for in the `pages` directory when resolving pages.\n\n```js\n// next.config.js\nmodule.exports = {\n  pageExtensions: ['mdx', 'jsx', 'js'],\n}\n```\n\n#### Configuring the build ID\n\nNext.js uses a constant generated at build time to identify which version of your application is being served. This can cause problems in multi-server deployments when `next build` is ran on every server. In order to keep a static build id between builds you can provide the `generateBuildId` function:\n\n```js\n// next.config.js\nmodule.exports = {\n  generateBuildId: async () => {\n    // For example get the latest git commit hash here\n    return 'my-build-id'\n  },\n}\n```\n\nTo fall back to the default of generating a unique id return `null` from the function:\n\n```js\nmodule.exports = {\n  generateBuildId: async () => {\n    // When process.env.YOUR_BUILD_ID is undefined we fall back to the default\n    if (process.env.YOUR_BUILD_ID) {\n      return process.env.YOUR_BUILD_ID\n    }\n\n    return null\n  },\n}\n```\n\n#### Configuring next process script\n\nYou can pass any node arguments to `next` CLI command.\n\n```bash\nNODE_OPTIONS=\"--throw-deprecation\" next\nNODE_OPTIONS=\"-r esm\" next\nNODE_OPTIONS=\"--inspect\" next\n```\n\n### Customizing webpack config\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-webpack-bundle-analyzer\">Custom webpack bundle analyzer</a></li>\n  </ul>\n</details>\n\nSome commonly asked for features are available as modules:\n\n- [@zeit/next-css](https://github.com/zeit/next-plugins/tree/master/packages/next-css)\n- [@zeit/next-sass](https://github.com/zeit/next-plugins/tree/master/packages/next-sass)\n- [@zeit/next-less](https://github.com/zeit/next-plugins/tree/master/packages/next-less)\n- [@zeit/next-preact](https://github.com/zeit/next-plugins/tree/master/packages/next-preact)\n- [@next/mdx](https://github.com/zeit/next.js/tree/canary/packages/next-mdx)\n\n> **Warning:** The `webpack` function is executed twice, once for the server and once for the client. This allows you to distinguish between client and server configuration using the `isServer` property.\n\nMultiple configurations can be combined together with function composition. For example:\n\n```js\nconst withMDX = require('@next/mdx')\nconst withSass = require('@zeit/next-sass')\n\nmodule.exports = withMDX(\n  withSass({\n    webpack(config, options) {\n      // Further custom configuration here\n      return config\n    },\n  })\n)\n```\n\nIn order to extend our usage of `webpack`, you can define a function that extends its config via `next.config.js`.\n\n```js\n// next.config.js is not transformed by Babel. So you can only use javascript features supported by your version of Node.js.\n\nmodule.exports = {\n  webpack: (config, { buildId, dev, isServer, defaultLoaders, webpack }) => {\n    // Note: we provide webpack above so you should not `require` it\n    // Perform customizations to webpack config\n    // Important: return the modified config\n\n    // Example using webpack option\n    config.plugins.push(new webpack.IgnorePlugin(/\\/__tests__\\//))\n    return config\n  },\n  webpackDevMiddleware: config => {\n    // Perform customizations to webpack dev middleware config\n    // Important: return the modified config\n    return config\n  },\n}\n```\n\nThe second argument to `webpack` is an object containing properties useful when customizing its configuration:\n\n- `buildId` - `String` the build id used as a unique identifier between builds\n- `dev` - `Boolean` shows if the compilation is done in development mode\n- `isServer` - `Boolean` shows if the resulting configuration will be used for server side (`true`), or client side compilation (`false`)\n- `defaultLoaders` - `Object` Holds loader objects Next.js uses internally, so that you can use them in custom configuration\n  - `babel` - `Object` the `babel-loader` configuration for Next.js\n\nExample usage of `defaultLoaders.babel`:\n\n```js\n// Example next.config.js for adding a loader that depends on babel-loader\n// This source was taken from the @next/mdx plugin source:\n// https://github.com/zeit/next.js/tree/canary/packages/next-mdx\nmodule.exports = {\n  webpack: (config, options) => {\n    config.module.rules.push({\n      test: /\\.mdx/,\n      use: [\n        options.defaultLoaders.babel,\n        {\n          loader: '@mdx-js/loader',\n          options: pluginOptions.options,\n        },\n      ],\n    })\n\n    return config\n  },\n}\n```\n\n### Customizing babel config\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-custom-babel-config\">Custom babel configuration</a></li>\n  </ul>\n</details>\n\nIn order to extend our usage of `babel`, you can simply define a `.babelrc` file at the root of your app. This file is optional.\n\nIf found, we're going to consider it the _source of truth_, therefore it needs to define what next needs as well, which is the `next/babel` preset.\n\nThis is designed so that you are not surprised by modifications we could make to the babel configurations.\n\nHere's an example `.babelrc` file:\n\n```json\n{\n  \"presets\": [\"next/babel\"],\n  \"plugins\": []\n}\n```\n\nThe `next/babel` preset includes everything needed to transpile React applications. This includes:\n\n- preset-env\n- preset-react\n- preset-typescript\n- plugin-proposal-class-properties\n- plugin-proposal-object-rest-spread\n- plugin-transform-runtime\n- styled-jsx\n\nThese presets / plugins **should not** be added to your custom `.babelrc`. Instead, you can configure them on the `next/babel` preset:\n\n```json\n{\n  \"presets\": [\n    [\n      \"next/babel\",\n      {\n        \"preset-env\": {},\n        \"transform-runtime\": {},\n        \"styled-jsx\": {},\n        \"class-properties\": {}\n      }\n    ]\n  ],\n  \"plugins\": []\n}\n```\n\nThe `modules` option on `\"preset-env\"` should be kept to `false` otherwise webpack code splitting is disabled.\n\n### Exposing configuration to the server / client side\n\nThere is a common need in applications to provide configuration values.\n\nNext.js supports 2 ways of providing configuration:\n\n- Build-time configuration\n- Runtime configuration\n\n#### Build-time configuration\n\nThe way build-time configuration works is by inlining the provided values into the Javascript bundle.\n\nYou can add the `env` key in `next.config.js`:\n\n```js\n// next.config.js\nmodule.exports = {\n  env: {\n    customKey: 'value',\n  },\n}\n```\n\nThis will allow you to use `process.env.customKey` in your code. For example:\n\n```jsx\n// pages/index.js\nfunction Index() {\n  return <h1>The value of customKey is: {process.env.customKey}</h1>\n}\n\nexport default Index\n```\n\n> **Warning:** Note that it is not possible to destructure process.env variables due to the webpack `DefinePlugin` replacing process.env.XXXX inline at build time.\n\n```js\n// Will not work\nconst { CUSTOM_KEY, CUSTOM_SECRET } = process.env\nAuthMethod({ key: CUSTOM_KEY, secret: CUSTOM_SECRET })\n\n// Will work as replaced inline\nAuthMethod({ key: process.env.CUSTOM_KEY, secret: process.env.CUSTOM_SECRET })\n```\n\n#### Runtime configuration\n\n> **Warning:** Note that these options are not available when using `target: 'serverless'`\n\n> **Warning:** Generally you want to use build-time configuration to provide your configuration.\n> The reason for this is that runtime configuration adds rendering / initialization overhead and is **incompatible with [automatic static optimization](#automatic-static-optimization)**.\n\nThe `next/config` module gives your app access to the `publicRuntimeConfig` and `serverRuntimeConfig` stored in your `next.config.js`.\n\nPlace any server-only runtime config under a `serverRuntimeConfig` property.\n\nAnything accessible to both client and server-side code should be under `publicRuntimeConfig`.\n\n> **Note**: A page that relies on `publicRuntimeConfig` **must** use `getInitialProps` to opt-out of [automatic static optimization](#automatic-static-optimization).\n> You can also de-optimize your entire application by creating a [Custom `<App>`](#custom-app) with `getInitialProps`.\n\n```js\n// next.config.js\nmodule.exports = {\n  serverRuntimeConfig: {\n    // Will only be available on the server side\n    mySecret: 'secret',\n    secondSecret: process.env.SECOND_SECRET, // Pass through env variables\n  },\n  publicRuntimeConfig: {\n    // Will be available on both server and client\n    staticFolder: '/static',\n  },\n}\n```\n\n```js\n// pages/index.js\nimport getConfig from 'next/config'\n// Only holds serverRuntimeConfig and publicRuntimeConfig from next.config.js nothing else.\nconst { serverRuntimeConfig, publicRuntimeConfig } = getConfig()\n\nconsole.log(serverRuntimeConfig.mySecret) // Will only be available on the server side\nconsole.log(publicRuntimeConfig.staticFolder) // Will be available on both server and client\n\nfunction MyImage() {\n  return (\n    <div>\n      <img src={`${publicRuntimeConfig.staticFolder}/logo.png`} alt=\"logo\" />\n    </div>\n  )\n}\n\nexport default MyImage\n```\n\n### Starting the server on alternative hostname\n\nTo start the development server using a different default hostname you can use `--hostname hostname_here` or `-H hostname_here` option with next dev. This will start a TCP server listening for connections on the provided host.\n\n### CDN support with Asset Prefix\n\nTo set up a CDN, you can set up the `assetPrefix` setting and configure your CDN's origin to resolve to the domain that Next.js is hosted on.\n\n```js\nconst isProd = process.env.NODE_ENV === 'production'\nmodule.exports = {\n  // You may only need to add assetPrefix in the production.\n  assetPrefix: isProd ? 'https://cdn.mydomain.com' : '',\n}\n```\n\nNote: Next.js will automatically use that prefix in the scripts it loads, but this has no effect whatsoever on `/static`. If you want to serve those assets over the CDN, you'll have to introduce the prefix yourself. One way of introducing a prefix that works inside your components and varies by environment is documented [in this example](https://github.com/zeit/next.js/tree/master/examples/with-universal-configuration-build-time).\n\nIf your CDN is on a separate domain and you would like assets to be requested using a [CORS aware request](https://developer.mozilla.org/en-US/docs/Web/HTML/CORS_settings_attributes) you can set a config option for that.\n\n```js\n// next.config.js\nmodule.exports = {\n  crossOrigin: 'anonymous',\n}\n```\n\n## Automatic Static Optimization\n\nNext.js automatically determines that a page is static (can be prerendered) if it has no blocking data requirements.\nThis determination is made by the absence of `getInitialProps` in the page.\n\nIf `getInitialProps` is present, Next.js will not statically optimize the page.\nInstead, Next.js will use its default behavior and render the page on-demand, per-request (meaning Server-Side Rendering).\n\nIf `getInitialProps` is absent, Next.js will **statically optimize** your page automatically by prerendering it to static HTML. During prerendering, the router's `query` object will be empty since we do not have `query` information to provide during this phase. Any `query` values will be populated client side after hydration.\n\nThis feature allows Next.js to emit hybrid applications that contain **both server-rendered and statically generated pages**.\nThis ensures Next.js always emits applications that are **fast by default**.\n\n> **Note**: Statically generated pages are still reactive: Next.js will hydrate your application client-side to give it full interactivity.\n\nThis feature provides many benefits.\nFor example, optimized pages require no server-side computation and can be instantly streamed to the end-user from CDN locations.\n\nThe result is an _ultra fast_ loading experience for your users.\n\n`next build` will emit `.html` files for statically optimized pages.\nThe result will be a file named `.next/server/static/${BUILD_ID}/about.html` instead of `.next/server/static/${BUILD_ID}/about.js`.\nThis behavior is similar for `target: 'serverless'`.\n\nThe built-in Next.js server (`next start`) and programmatic API (`app.getRequestHandler()`) both support this build output transparently.\nThere is no configuration or special handling required.\n\n> **Note**: If you have a [custom `<App>`](#custom-app) with `getInitialProps` then this optimization will be disabled.\n\n> **Note**: If you have a [custom `<Document>`](#custom-document) with `getInitialProps` be sure you check if `ctx.req` is defined before assuming the page is server-side rendered.\n> `ctx.req` will be `undefined` for pages that are prerendered.\n\n## Automatic Static Optimization Indicator\n\nWhen a page qualifies for automatic static optimization we show an indicator to let you know.\nThis is helpful since the automatic static optimization can be very beneficial and knowing immediately in development if it qualifies can be useful.\nSee above for information on the benefits of this optimization.\n\nIn some cases this indicator might not be as useful like when working on electron applications. For these cases you can disable the indicator in your `next.config.js` by setting\n\n```js\nmodule.exports = {\n  devIndicators: {\n    autoPrerender: false,\n  },\n}\n```\n\n## Production deployment\n\nTo deploy, instead of running `next`, you want to build for production usage ahead of time. Therefore, building and starting are separate commands:\n\n```bash\nnext build\nnext start\n```\n\nTo deploy Next.js with [ZEIT Now](https://zeit.co/now) see the [ZEIT Guide for Deploying Next.js](https://zeit.co/guides/deploying-nextjs-with-now/) or the [Next.js Learn section about deploying on ZEIT Now](https://nextjs.org/learn/basics/deploying-a-nextjs-app/deploying-to-zeit-now).\n\nNext.js can be deployed to other hosting solutions too. Please have a look at the ['Deployment'](https://github.com/zeit/next.js/wiki/Deployment) section of the wiki.\n\nNote: `NODE_ENV` is properly configured by the `next` subcommands, if absent, to maximize performance. if you’re using Next.js [programmatically](#custom-server-and-routing), it’s your responsibility to set `NODE_ENV=production` manually!\n\nNote: we recommend putting `.next`, or your [custom dist folder](https://github.com/zeit/next.js#custom-configuration), in `.gitignore` or `.npmignore`. Otherwise, use `files` or `now.files` to opt-into a whitelist of files you want to deploy, excluding `.next` or your custom dist folder.\n\n### Compression\n\nNext.js provides [gzip](https://tools.ietf.org/html/rfc6713#section-3) compression to compress rendered content and static files. Compression only works with the `server` target. In general you will want to enable compression on a HTTP proxy like [nginx](https://www.nginx.com/), to offload load from the `Node.js` process.\n\nTo disable **compression** in Next.js, set `compress` to `false` in `next.config.js`:\n\n```js\n// next.config.js\nmodule.exports = {\n  compress: false,\n}\n```\n\n### Serverless deployment\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"https://github.com/zeit/now-examples/tree/master/nextjs\">now.sh</a></li>\n    <li><a href=\"https://github.com/TejasQ/anna-artemov.now.sh\">anna-artemov.now.sh</a></li>\n    <li>We encourage contributing more examples to this section</li>\n  </ul>\n</details>\n\nServerless deployment dramatically improves reliability and scalability by splitting your application into smaller parts (also called [**lambdas**](https://zeit.co/docs/v2/deployments/concepts/lambdas/)).\nIn the case of Next.js, each page in the `pages` directory becomes a serverless lambda.\n\nThere are [a number of benefits](https://zeit.co/blog/serverless-express-js-lambdas-with-now-2#benefits-of-serverless-express) to serverless.\nThe referenced link talks about some of them in the context of Express, but the principles apply universally:\nserverless allows for distributed points of failure, infinite scalability, and is incredibly affordable with a \"pay for what you use\" model.\n\nTo enable **serverless mode** in Next.js, add the `serverless` build `target` in `next.config.js`:\n\n```js\n// next.config.js\nmodule.exports = {\n  target: 'serverless',\n}\n```\n\nThe `serverless` target will output a single lambda or [HTML file](#automatic-static-optimization) per page.\nThis file is completely standalone and doesn't require any dependencies to run:\n\n- `pages/index.js` => `.next/serverless/pages/index.js`\n- `pages/about.js` => `.next/serverless/pages/about.js`\n- `pages/blog.js` => `.next/serverless/pages/blog.html`\n\nThe signature of the Next.js Serverless function is similar to the Node.js HTTP server callback:\n\n```ts\nexport function render(req: http.IncomingMessage, res: http.ServerResponse) => void\n```\n\n- [http.IncomingMessage](https://nodejs.org/api/http.html#http_class_http_incomingmessage)\n- [http.ServerResponse](https://nodejs.org/api/http.html#http_class_http_serverresponse)\n- `void` refers to the function not having a return value and is equivalent to JavaScript's `undefined`. Calling the function will finish the request.\n\nThe static HTML files are ready to be served as-is.\nYou can read more about this feature, including how to opt-out, in the [Automatic Static Optimization section](#automatic-static-optimization).\n\nUsing the serverless target, you can deploy Next.js to [ZEIT Now](https://zeit.co/now) with all of the benefits and added ease of control like for example; [custom routes](https://zeit.co/guides/custom-next-js-server-to-routes/) and caching headers. See the [ZEIT Guide for Deploying Next.js with Now](https://zeit.co/guides/deploying-nextjs-with-now/) for more information.\n\n#### One Level Lower\n\nNext.js provides low-level APIs for serverless deployments as hosting platforms have different function signatures. In general you will want to wrap the output of a Next.js serverless build with a compatibility layer.\n\nFor example if the platform supports the Node.js [`http.Server`](https://nodejs.org/api/http.html#http_class_http_server) class:\n\n```js\nconst http = require('http')\nconst page = require('./.next/serverless/pages/about.js')\nconst server = new http.Server((req, res) => page.render(req, res))\nserver.listen(3000, () => console.log('Listening on http://localhost:3000'))\n```\n\nFor specific platform examples see [the examples section above](#serverless-deployment).\n\n#### Summary\n\n- Low-level API for implementing serverless deployment\n- Every page in the `pages` directory becomes a serverless function (lambda)\n- Creates the smallest possible serverless function (50Kb base zip size)\n- Optimized for fast [cold start](https://zeit.co/blog/serverless-ssr#cold-start) of the function\n- The serverless function has 0 dependencies (they are included in the function bundle)\n- Uses the [http.IncomingMessage](https://nodejs.org/api/http.html#http_class_http_incomingmessage) and [http.ServerResponse](https://nodejs.org/api/http.html#http_class_http_serverresponse) from Node.js\n- opt-in using `target: 'serverless'` in `next.config.js`\n- Does not load `next.config.js` when executing the function, note that this means `publicRuntimeConfig` / `serverRuntimeConfig` are not supported\n\n## Browser support\n\nNext.js supports IE11 and all modern browsers out of the box using [`@babel/preset-env`](https://new.babeljs.io/docs/en/next/babel-preset-env.html). In order to support IE11 Next.js adds a global `Promise` polyfill. In cases where your own code or any external NPM dependencies you are using requires features not supported by your target browsers you will need to implement polyfills.\n\nThe [polyfills](https://github.com/zeit/next.js/tree/canary/examples/with-polyfills) example demonstrates the recommended approach to implement polyfills.\n\n## TypeScript\n\nNext.js provides an integrated TypeScript experience out of the box, similar to an IDE.\n\nTo get started, create a empty `tsconfig.json` file in the root of your project:\n\n```bash\ntouch tsconfig.json\n```\n\nNext.js will automatically configure this file with default values (providing [your own `tsconfig.json`](https://www.typescriptlang.org/docs/handbook/compiler-options.html) is also supported).\n\nThen, run `next dev` (normally `npm run dev`) and Next.js will guide you through installing the necessary packages to complete setup.\n\n```bash\nnpm run dev\n\n# You'll see instructions like these:\n#\n# Please install typescript, @types/react, and @types/node by running:\n#\n#         yarn add --dev typescript @types/react @types/node\n#\n# ...\n```\n\nYou're now ready to start converting files from `.js` to `.tsx` and leveraging the benefits TypeScript provides!\n\nTo learn more about TypeScript checkout its [documentation](https://www.typescriptlang.org/).\n\n> **Note**: Next.js will create a file named `next-env.d.ts` in the root of your project.\n> This file ensures Next.js' types are picked up by the TypeScript compiler.\n>\n> **You cannot remove this file, however, you can edit it (but don't need to).**\n\n> **Note**: Next.js does not enable TypeScript's `strict` mode by default.\n> When you feel comfortable with TypeScript, you may turn this option on in your `tsconfig.json`.\n\n> **Note**: By default, Next.js reports TypeScript errors during development for pages you are actively working on.\n> TypeScript errors for inactive pages **do not** block the development process.\n>\n> If you don't want to leverage this behavior and instead, e.g. prefer your editor's integration, you can set the following option in `next.config.js`:\n>\n> ```js\n> // next.config.js\n> module.exports = {\n>   typescript: {\n>     ignoreDevErrors: true,\n>   },\n> }\n> ```\n>\n> Next.js will still fail your **production build** (`next build`) when TypeScript errors are present in your project.\n>\n> If you'd like Next.js to dangerously produce production code even when your application is broken, you can set the following option in your `next.config.js`.\n> Be sure you are running type checks as part of your build or deploy process!\n>\n> ```js\n> // next.config.js\n> module.exports = {\n>   typescript: {\n>     // !! WARN !!\n>     // Dangerously allow production builds to successfully complete even if\n>     // your project has type errors.\n>     //\n>     // This option is rarely needed, and should be reserved for advanced\n>     // setups. You may be looking for `ignoreDevErrors` instead.\n>     // !! WARN !!\n>     ignoreBuildErrors: true,\n>   },\n> }\n> ```\n\n### Exported types\n\nNext.js provides `NextPage` type that can be used for pages in the `pages` directory. `NextPage` adds definitions for [`getInitialProps`](#fetching-data-and-component-lifecycle) so that it can be used without any extra typing needed.\n\n```tsx\nimport { NextPage } from 'next'\n\ninterface Props {\n  userAgent?: string\n}\n\nconst Page: NextPage<Props> = ({ userAgent }) => (\n  <main>Your user agent: {userAgent}</main>\n)\n\nPage.getInitialProps = async ({ req }) => {\n  const userAgent = req ? req.headers['user-agent'] : navigator.userAgent\n  return { userAgent }\n}\n\nexport default Page\n```\n\nFor `React.Component` you can use `NextPageContext`:\n\n```tsx\nimport React from 'react'\nimport { NextPageContext } from 'next'\n\ninterface Props {\n  userAgent?: string\n}\n\nexport default class Page extends React.Component<Props> {\n  static async getInitialProps({ req }: NextPageContext) {\n    const userAgent = req ? req.headers['user-agent'] : navigator.userAgent\n    return { userAgent }\n  }\n\n  render() {\n    const { userAgent } = this.props\n    return <main>Your user agent: {userAgent}</main>\n  }\n}\n```\n\n## AMP Support\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"https://github.com/zeit/next.js/tree/canary/examples/amp\">amp</a></li>\n  </ul>\n</details>\n\n### Enabling AMP Support\n\nTo enable AMP support for a page, add `export const config = { amp: true }` to your page.\n\n### AMP First Page\n\n```js\n// pages/about.js\nexport const config = { amp: true }\n\nexport default function AboutPage(props) {\n  return <h3>My AMP About Page!</h3>\n}\n```\n\n### Hybrid AMP Page\n\n```js\n// pages/hybrid-about.js\nimport { useAmp } from 'next/amp'\n\nexport const config = { amp: 'hybrid' }\n\nexport default function AboutPage(props) {\n  return (\n    <div>\n      <h3>My AMP Page</h3>\n      {useAmp() ? (\n        <amp-img\n          width=\"300\"\n          height=\"300\"\n          src=\"/my-img.jpg\"\n          alt=\"a cool image\"\n          layout=\"responsive\"\n        />\n      ) : (\n        <img width=\"300\" height=\"300\" src=\"/my-img.jpg\" alt=\"a cool image\" />\n      )}\n    </div>\n  )\n}\n```\n\n### AMP Page Modes\n\nAMP pages can specify two modes:\n\n- AMP-only (default)\n  - Pages have no Next.js or React client-side runtime\n  - Pages are automatically optimized with [AMP Optimizer](https://github.com/ampproject/amp-toolbox/tree/master/packages/optimizer), an optimizer that applies the same transformations as AMP caches (improves performance by up to 42%)\n  - Pages have a user-accessible (optimized) version of the page and a search-engine indexable (unoptimized) version of the page\n  - Opt-in via `export const config = { amp: true }`\n- Hybrid\n  - Pages are able to be rendered as traditional HTML (default) and AMP HTML (by adding `?amp=1` to the URL)\n  - The AMP version of the page only has valid optimizations applied with AMP Optimizer so that it is indexable by search-engines\n  - Opt-in via `export const config = { amp: 'hybrid' }`\n  - Able to differentiate between modes using `useAmp` from `next/amp`\n\nBoth of these page modes provide a consistently fast experience for users accessing pages through search engines.\n\n### AMP Behavior with `next export`\n\nWhen using `next export` to statically prerender pages Next.js will detect if the page supports AMP and change the exporting behavior based on that.\n\nHybrid AMP (`pages/about.js`) would output:\n\n- `out/about.html` - with client-side React runtime\n- `out/about.amp.html` - AMP page\n\nAMP-only (`pages/about.js`) would output:\n\n- `out/about.html` - Optimized AMP page\n\nDuring export Next.js automatically detects if a page is hybrid AMP and outputs the AMP version to `page.amp.html`. We also automatically insert the `<link rel=\"amphtml\" href=\"/page.amp\" />` and `<link rel=\"canonical\" href=\"/\" />` tags for you.\n\n> **Note**: When using `exportTrailingSlash: true` in `next.config.js`, output will be different. For Hybrid AMP pages, output will be `out/page/index.html` and `out/page.amp/index.html`, and for AMP-only pages, output will be `out/page/index.html`\n\n### Adding AMP Components\n\nThe AMP community provides [many components](https://amp.dev/documentation/components/) to make AMP pages more interactive. You can add these components to your page by using `next/head`:\n\n```js\n// pages/hello.js\nimport Head from 'next/head'\n\nexport const config = { amp: true }\n\nexport default function MyAmpPage() {\n  return (\n    <div>\n      <Head>\n        <script\n          async\n          key=\"amp-timeago\"\n          custom-element=\"amp-timeago\"\n          src=\"https://cdn.ampproject.org/v0/amp-timeago-0.1.js\"\n        />\n      </Head>\n\n      <p>Some time: {date.toJSON()}</p>\n      <amp-timeago\n        width=\"0\"\n        height=\"15\"\n        datetime={date.toJSON()}\n        layout=\"responsive\"\n      >\n        .\n      </amp-timeago>\n    </div>\n  )\n}\n```\n\n### AMP Validation\n\nAMP pages are automatically validated with [amphtml-validator](https://www.npmjs.com/package/amphtml-validator) during development. Errors and warnings will appear in the terminal where you started Next.js.\n\nPages are also validated during `next export` and any warnings / errors will be printed to the terminal.\nAny AMP errors will cause `next export` to exit with status code `1` because the export is not valid AMP.\n\n### TypeScript Support\n\nAMP currently doesn't have built-in types for TypeScript, but it's in their roadmap ([#13791](https://github.com/ampproject/amphtml/issues/13791)). As a workaround you can manually add the types to `amp.d.ts` like [here](https://stackoverflow.com/a/50601125).\n\n## Static HTML export\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-static-export\">Static export</a></li>\n  </ul>\n</details>\n\n`next export` is a way to run your Next.js app as a standalone static app without the need for a Node.js server.\nThe exported app supports almost every feature of Next.js, including dynamic urls, prefetching, preloading and dynamic imports.\n\nThe way `next export` works is by prerendering all pages possible to HTML. It does so based on a mapping of `pathname` key to page object. This mapping is called the `exportPathMap`.\n\nThe page object has 2 values:\n\n- `page` - `String` the page inside the `pages` directory to render\n- `query` - `Object` the `query` object passed to `getInitialProps` when prerendering. Defaults to `{}`\n\n### Usage\n\nSimply develop your app as you normally do with Next.js. Then run:\n\n```\nnext build\nnext export\n```\n\nBy default `next export` doesn't require any configuration. It will generate a default `exportPathMap` containing the routes to pages inside the `pages` directory. This default mapping is available as `defaultPathMap` in the example below.\n\nIf your application has dynamic routes you can add a dynamic `exportPathMap` in `next.config.js`.\nThis function is asynchronous and gets the default `exportPathMap` as a parameter.\n\n```js\n// next.config.js\nmodule.exports = {\n  exportPathMap: async function(\n    defaultPathMap,\n    { dev, dir, outDir, distDir, buildId }\n  ) {\n    return {\n      '/': { page: '/' },\n      '/about': { page: '/about' },\n      '/readme.md': { page: '/readme' },\n      '/p/hello-nextjs': { page: '/post', query: { title: 'hello-nextjs' } },\n      '/p/learn-nextjs': { page: '/post', query: { title: 'learn-nextjs' } },\n      '/p/deploy-nextjs': { page: '/post', query: { title: 'deploy-nextjs' } },\n    }\n  },\n}\n```\n\nThe pages will be exported as html files, i.e. `/about` will become `/about.html`.\n\nIt is possible to configure Next.js to export pages as `index.html` files and require trailing slashes, i.e. `/about` becomes `/about/index.html` and is routable via `/about/`.\nThis was the default behavior prior to Next.js 9.\nYou can use the following `next.config.js` to switch back to this behavior:\n\n```js\n// next.config.js\nmodule.exports = {\n  exportTrailingSlash: true,\n}\n```\n\n> **Note**: If the export path is a filename (e.g. `/readme.md`) and is different than `.html`, you may need to set the `Content-Type` header to `text/html` when serving this content.\n\nThe second argument is an `object` with:\n\n- `dev` - `true` when `exportPathMap` is being called in development. `false` when running `next export`. In development `exportPathMap` is used to define routes.\n- `dir` - Absolute path to the project directory\n- `outDir` - Absolute path to the `out/` directory (configurable with `-o` or `--outdir`). When `dev` is `true` the value of `outDir` will be `null`.\n- `distDir` - Absolute path to the `.next/` directory (configurable using the `distDir` config key)\n- `buildId` - The `buildId` the export is running for\n\nThen simply run these commands:\n\n```bash\nnext build\nnext export\n```\n\nFor that you may need to add a NPM script to `package.json` like this:\n\n```json\n{\n  \"scripts\": {\n    \"build\": \"next build\",\n    \"export\": \"npm run build && next export\"\n  }\n}\n```\n\nAnd run it at once with:\n\n```bash\nnpm run export\n```\n\nThen you have a static version of your app in the `out` directory.\n\n> You can also customize the output directory. For that run `next export -h` for the help.\n\nNow you can deploy the `out` directory to any static hosting service. Note that there is an additional step for deploying to GitHub Pages, [documented here](https://github.com/zeit/next.js/wiki/Deploying-a-Next.js-app-into-GitHub-Pages).\n\nFor an example, simply visit the `out` directory and run following command to deploy your app to [ZEIT Now](https://zeit.co/now).\n\n```bash\nnow\n```\n\n### Limitation\n\nWith `next export`, we build a HTML version of your app. At export time we will run `getInitialProps` of your pages.\n\nThe `req` and `res` fields of the `context` object passed to `getInitialProps` are empty objects during export as there is no server running.\n\n> **Note**: If your pages don't have `getInitialProps` you may not need `next export` at all, `next build` is already enough thanks to [automatic static optimization](#automatic-static-optimization).\n\n> You won't be able to render HTML dynamically when static exporting, as we pre-build the HTML files. If you want to do dynamic rendering use `next start` or the custom server API\n\n## Multi Zones\n\n<details>\n  <summary><b>Examples</b></summary>\n  <ul>\n    <li><a href=\"/examples/with-zones\">With Zones</a></li>\n  </ul>\n</details>\n\nA zone is a single deployment of a Next.js app. Just like that, you can have multiple zones and then you can merge them as a single app.\n\nFor an example, you can have two zones like this:\n\n- An app for serving `/blog/**`\n- Another app for serving all other pages\n\nWith multi zones support, you can merge both these apps into a single one allowing your customers to browse it using a single URL, but you can develop and deploy both apps independently.\n\n> This is exactly the same concept of microservices, but for frontend apps.\n\n### How to define a zone\n\nThere are no special zones related APIs. You only need to do following:\n\n- Make sure to keep only the pages you need in your app, meaning that an app can't have pages from another app, if app `A` has `/blog` then app `B` shouldn't have it too.\n- Make sure to add an [assetPrefix](https://github.com/zeit/next.js#cdn-support-with-asset-prefix) to avoid conflicts with static files.\n\n### How to merge them\n\nYou can merge zones using any HTTP proxy.\n\nYou can use [now dev](https://zeit.co/docs/v2/development/basics) as your local development server. It allows you to easily define routing routes for multiple apps like below:\n\n```json\n{\n  \"version\": 2,\n  \"builds\": [\n    { \"src\": \"docs/next.config.js\", \"use\": \"@now/next\" },\n    { \"src\": \"home/next.config.js\", \"use\": \"@now/next\" }\n  ],\n  \"routes\": [\n    { \"src\": \"/docs(.*)\", \"dest\": \"docs$1\", \"continue\": true },\n    { \"src\": \"(?!/?docs)(.*)\", \"dest\": \"home$1\", \"continue\": true }\n  ]\n}\n```\n\nFor the production deployment, you can use the same configuration and run `now` to do the deployment with [ZEIT Now](https://zeit.co/now). Otherwise you can also configure a proxy server to route using a set of routes like the ones above, e.g deploy the docs app to `https://docs.example.com` and the home app to `https://home.example.com` and then add a proxy server for both apps in `https://example.com`.\n\n## FAQ\n\n<details>\n  <summary>Is this production ready?</summary>\n  Next.js has been powering https://zeit.co since its inception.\n\nWe’re ecstatic about both the developer experience and end-user performance, so we decided to share it with the community.\n\n</details>\n\n<details>\n  <summary>How big is it?</summary>\n\nThe client side bundle size should be measured in a per-app basis.\nA small Next main bundle is around 65kb gzipped.\n\n</details>\n\n<details>\n  <summary>Is this like `create-react-app`?</summary>\n\nYes and No.\n\nYes in that both make your life easier.\n\nNo in that it enforces a _structure_ so that we can do more advanced things like:\n\n- Server side rendering\n- Automatic code splitting\n\nIn addition, Next.js provides two built-in features that are critical for every single website:\n\n- Routing with lazy component loading: `<Link>` (by importing `next/link`)\n- A way for components to alter `<head>`: `<Head>` (by importing `next/head`)\n\nIf you want to create re-usable React components that you can embed in your Next.js app or other React applications, using `create-react-app` is a great idea. You can later `import` it and keep your codebase clean!\n\n</details>\n\n<details>\n  <summary>How do I use CSS-in-JS solutions?</summary>\n\nNext.js bundles [styled-jsx](https://github.com/zeit/styled-jsx) supporting scoped css. However you can use any CSS-in-JS solution in your Next app by just including your favorite library [as mentioned before](#css-in-js) in the document.\n\n</details>\n\n<details>\n  <summary>What syntactic features are transpiled? How do I change them?</summary>\n\nWe track V8. Since V8 has wide support for ES6 and `async` and `await`, we transpile those. Since V8 doesn’t support class decorators, we don’t transpile those.\n\nSee the documentation about [customizing the babel config](#customizing-babel-config) and [next/preset](/packages/next/build/babel/preset.ts) for more information.\n\n</details>\n\n<details>\n  <summary>Why a new Router?</summary>\n\nNext.js is special in that:\n\n- Routes don’t need to be known ahead of time\n- Routes are always lazy-loadable\n- Top-level components can define `getInitialProps` that should _block_ the loading of the route (either when server-rendering or lazy-loading)\n\nAs a result, we were able to introduce a very simple approach to routing that consists of two pieces:\n\n- Every top level component receives a `url` object to inspect the url or perform modifications to the history\n- A `<Link />` component is used to wrap elements like anchors (`<a/>`) to perform client-side transitions\n\n</details>\n\n<details>\n<summary>How do I define a custom fancy route?</summary>\n\nNext.js provide [dynamic routing](#dynamic-routing) solution out of the box. This allows to use pretty links in url.\n\nYou can check an [example](https://github.com/zeit/next.js/tree/canary/examples/dynamic-routing) to see how it works.\n\n</details>\n\n<details>\n<summary>How do I fetch data?</summary>\n\nIt’s up to you. `getInitialProps` is an `async` function (or a regular function that returns a `Promise`). It can retrieve data from anywhere.\n\n</details>\n\n<details>\n  <summary>Can I use it with GraphQL?</summary>\n\nYes! Here's an example with [Apollo](/examples/with-apollo).\n\n</details>\n\n<details>\n<summary>Can I use it with Redux and thunk?</summary>\n\nYes! Here's an [example](/examples/with-redux-thunk).\n\n</details>\n\n<details>\n<summary>Can I use it with Redux?</summary>\n\nYes! Here's an [example](/examples/with-redux).\n\n</details>\n\n<details>\n<summary>Can I use Next with my favorite Javascript library or toolkit?</summary>\n\nSince our first release we've had **many** example contributions, you can check them out in the [examples](/examples) directory.\n\n</details>\n\n<details>\n<summary>What is this inspired by?</summary>\n\nMany of the goals we set out to accomplish were the ones listed in [The 7 principles of Rich Web Applications](http://rauchg.com/2014/7-principles-of-rich-web-applications/) by Guillermo Rauch.\n\nThe ease-of-use of PHP is a great inspiration. We feel Next.js is a suitable replacement for many scenarios where you otherwise would use PHP to output HTML.\n\nUnlike PHP, we benefit from the ES6 module system and every file exports a **component or function** that can be easily imported for lazy evaluation or testing.\n\nAs we were researching options for server-rendering React that didn’t involve a large number of steps, we came across [react-page](https://github.com/facebookarchive/react-page) (now deprecated), a similar approach to Next.js by the creator of React Jordan Walke.\n\n</details>\n\n## Contributing\n\nPlease see our [contributing.md](/contributing.md).\n\n## Authors\n\n- Arunoda Susiripala ([@arunoda](https://twitter.com/arunoda)) – [ZEIT](https://zeit.co)\n- Tim Neutkens ([@timneutkens](https://twitter.com/timneutkens)) – [ZEIT](https://zeit.co)\n- Naoyuki Kanezawa ([@nkzawa](https://twitter.com/nkzawa)) – [ZEIT](https://zeit.co)\n- Tony Kovanen ([@tonykovanen](https://twitter.com/tonykovanen)) – [ZEIT](https://zeit.co)\n- Guillermo Rauch ([@rauchg](https://twitter.com/rauchg)) – [ZEIT](https://zeit.co)\n- Dan Zajdband ([@impronunciable](https://twitter.com/impronunciable)) – Knight-Mozilla / Coral Project",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": "https://github.com/zeit/next.js/blob/canary/packages/next/README.md"
    },
    {
      "id": 18,
      "title": "React Fiber Architecture",
      "subTitle": "",
      "image": "https://source.unsplash.com/95YRwf6CNw8",
      "content": "# React Fiber Architecture\n\n## Introduction\n\nReact Fiber is an ongoing reimplementation of React's core algorithm. It is the culmination of over two years of research by the React team.\n\nThe goal of React Fiber is to increase its suitability for areas like animation, layout, and gestures. Its headline feature is **incremental rendering**: the ability to split rendering work into chunks and spread it out over multiple frames.\n\nOther key features include the ability to pause, abort, or reuse work as new updates come in; the ability to assign priority to different types of updates; and new concurrency primitives.\n\n### About this document\n\nFiber introduces several novel concepts that are difficult to grok solely by looking at code. This document began as a collection of idtes I took as I followed along with Fiber's implementation in the React project. As it grew, I realized it may be a helpful resource for others, too.\n\nI'll attempt to use the plainest language possible, and to avoid jargon by explicitly defining key terms. I'll also link heavily to external resources when possible.\n\nPlease note that I am not on the React team, and do not speak from any authority. **This is not an official document**. I have asked members of the React team to review it for accuracy.\n\nThis is also a work in progress. **Fiber is an ongoing project that will likely undergo significant refactors before it's completed.** Also ongoing are my attempts at documenting its design here. Improvements and suggestions are highly welcome.\n\nMy goal is that after reading this document, you will understand Fiber well enough to [follow along as it's implemented](https://github.com/facebook/react/commits/master/src/renderers/shared/fiber), and eventually even be able to contribute back to React.\n\n### Prerequisites\n\nI strongly suggest that you are familiar with the following resources before continuing:\n\n- [React Components, Elements, and Instances](https://facebook.github.io/react/blog/2015/12/18/react-components-elements-and-instances.html) - \"Component\" is often an overloaded term. A firm grasp of these terms is crucial.\n- [Reconciliation](https://facebook.github.io/react/docs/reconciliation.html) - A high-level description of React's reconciliation algorithm.\n- [React Basic Theoretical Concepts](https://github.com/reactjs/react-basic) - A description of the conceptual model of React without implementation burden. Some of this may not make sense on first reading. That's okay, it will make more sense with time.\n- [React Design Principles](https://facebook.github.io/react/contributing/design-principles.html) - Pay special attention to the section on scheduling. It does a great job of explaining the *why* of React Fiber.\n\n## Review\n\nPlease check out the prerequisites section if you haven't already.\n\nBefore we dive into the new stuff, let's review a few concepts.\n\n### What is reconciliation?\n\n<dl>\n  <dt>reconciliation</dt>\n  <dd>The algorithm React uses to diff one tree with another to determine which parts need to be changed.</dd>\n\n  <dt>update</dt>\n  <dd>A change in the data used to render a React app. Usually the result of `setState`. Eventually results in a re-render.</dd>\n</dl>\n\nThe central idea of React's API is to think of updates as if they cause the entire app to re-render. This allows the developer to reason declaratively, rather than worry about how to efficiently transition the app from any particular state to another (A to B, B to C, C to A, and so on).\n\nActually re-rendering the entire app on each change only works for the most trivial apps; in a real-world app, it's prohibitively costly in terms of performance. React has optimizations which create the appearance of whole app re-rendering while maintaining great performance. The bulk of these optimizations are part of a process called **reconciliation**.\n\nReconciliation is the algorithm behind what is popularly understood as the \"virtual DOM.\" A high-level description goes something like this: when you render a React application, a tree of nodes that describes the app is generated and saved in memory. This tree is then flushed to the rendering environment — for example, in the case of a browser application, it's translated to a set of DOM operations. When the app is updated (usually via `setState`), a new tree is generated. The new tree is diffed with the previous tree to compute which operations are needed to update the rendered app.\n\nAlthough Fiber is a ground-up rewrite of the reconciler, the high-level algorithm [described in the React docs](https://facebook.github.io/react/docs/reconciliation.html) will be largely the same. The key points are:\n\n- Different component types are assumed to generate substantially different trees. React will not attempt to diff them, but rather replace the old tree completely.\n- Diffing of lists is performed using keys. Keys should be \"stable, predictable, and unique.\"\n\n### Reconciliation versus rendering\n\nThe DOM is just one of the rendering environments React can render to, the other major targets being native iOS and Android views via React Native. (This is why \"virtual DOM\" is a bit of a misnomer.)\n\nThe reason it can support so many targets is because React is designed so that reconciliation and rendering are separate phases. The reconciler does the work of computing which parts of a tree have changed; the renderer then uses that information to actually update the rendered app.\n\nThis separation means that React DOM and React Native can use their own renderers while sharing the same reconciler, provided by React core.\n\nFiber reimplements the reconciler. It is not principally concerned with rendering, though renderers will need to change to support (and take advantage of) the new architecture.\n\n### Scheduling\n\n<dl>\n  <dt>scheduling</dt>\n  <dd>the process of determining when work should be performed.</dd>\n\n  <dt>work</dt>\n  <dd>any computations that must be performed. Work is usually the result of an update (e.g. <code>setState</code>).\n</dl>\n\nReact's [Design Principles](https://facebook.github.io/react/contributing/design-principles.html#scheduling) document is so good on this subject that I'll just quote it here:\n\n> In its current implementation React walks the tree recursively and calls render functions of the whole updated tree during a single tick. However in the future it might start delaying some updates to avoid dropping frames.\n>\n> This is a common theme in React design. Some popular libraries implement the \"push\" approach where computations are performed when the new data is available. React, however, sticks to the \"pull\" approach where computations can be delayed until necessary.\n>\n> React is not a generic data processing library. It is a library for building user interfaces. We think that it is uniquely positioned in an app to know which computations are relevant right now and which are not.\n>\n> If something is offscreen, we can delay any logic related to it. If data is arriving faster than the frame rate, we can coalesce and batch updates. We can prioritize work coming from user interactions (such as an animation caused by a button click) over less important background work (such as rendering new content just loaded from the network) to avoid dropping frames.\n\nThe key points are:\n\n- In a UI, it's not necessary for every update to be applied immediately; in fact, doing so can be wasteful, causing frames to drop and degrading the user experience.\n- Different types of updates have different priorities — an animation update needs to complete more quickly than, say, an update from a data store.\n- A push-based approach requires the app (you, the programmer) to decide how to schedule work. A pull-based approach allows the framework (React) to be smart and make those decisions for you.\n\nReact doesn't currently take advantage of scheduling in a significant way; an update results in the entire subtree being re-rendered immediately. Overhauling React's core algorithm to take advantage of scheduling is the driving idea behind Fiber.\n\n---\n\nNow we're ready to dive into Fiber's implementation. The next section is more technical than what we've discussed so far. Please make sure you're comfortable with the previous material before moving on.\n\n## What is a fiber?\n\nWe're about to discuss the heart of React Fiber's architecture. Fibers are a much lower-level abstraction than application developers typically think about. If you find yourself frustrated in your attempts to understand it, don't feel discouraged. Keep trying and it will eventually make sense. (When you do finally get it, please suggest how to improve this section.)\n\nHere we go!\n\n---\n\nWe've established that a primary goal of Fiber is to enable React to take advantage of scheduling. Specifically, we need to be able to\n\n- pause work and come back to it later.\n- assign priority to different types of work.\n- reuse previously completed work.\n- abort work if it's no longer needed.\n\nIn order to do any of this, we first need a way to break work down into units. In one sense, that's what a fiber is. A fiber represents a **unit of work**.\n\nTo go further, let's go back to the conception of [React components as functions of data](https://github.com/reactjs/react-basic#transformation), commonly expressed as\n\n```\nv = f(d)\n```\n\nIt follows that rendering a React app is akin to calling a function whose body contains calls to other functions, and so on. This analogy is useful when thinking about fibers.\n\nThe way computers typically track a program's execution is using the [call stack](https://en.wikipedia.org/wiki/Call_stack). When a function is executed, a new **stack frame** is added to the stack. That stack frame represents the work that is performed by that function.\n\nWhen dealing with UIs, the problem is that if too much work is executed all at once, it can cause animations to drop frames and look choppy. What's more, some of that work may be unnecessary if it's superseded by a more recent update. This is where the comparison between UI components and function breaks down, because components have more specific concerns than functions in general.\n\nNewer browsers (and React Native) implement APIs that help address this exact problem: `requestIdleCallback` schedules a low priority function to be called during an idle period, and `requestAnimationFrame` schedules a high priority function to be called on the next animation frame. The problem is that, in order to use those APIs, you need a way to break rendering work into incremental units. If you rely only on the call stack, it will keep doing work until the stack is empty.\n\nWouldn't it be great if we could customize the behavior of the call stack to optimize for rendering UIs? Wouldn't it be great if we could interrupt the call stack at will and manipulate stack frames manually?\n\nThat's the purpose of React Fiber. Fiber is reimplementation of the stack, specialized for React components. You can think of a single fiber as a **virtual stack frame**.\n\nThe advantage of reimplementing the stack is that you can [keep stack frames in memory](https://www.facebook.com/groups/2003630259862046/permalink/2054053404819731/) and execute them however (and *whenever*) you want. This is crucial for accomplishing the goals we have for scheduling.\n\nAside from scheduling, manually dealing with stack frames unlocks the potential for features such as concurrency and error boundaries. We will cover these topics in future sections.\n\nIn the next section, we'll look more at the structure of a fiber.\n\n### Structure of a fiber\n\n*Note: as we get more specific about implementation details, the likelihood that something may change increases. Please file a PR if you notice any mistakes or outdated information.*\n\nIn concrete terms, a fiber is a JavaScript object that contains information about a component, its input, and its output.\n\nA fiber corresponds to a stack frame, but it also corresponds to an instance of a component.\n\nHere are some of the important fields that belong to a fiber. (This list is not exhaustive.)\n\n#### `type` and `key`\n\nThe type and key of a fiber serve the same purpose as they do for React elements. (In fact, when a fiber is created from an element, these two fields are copied over directly.)\n\nThe type of a fiber describes the component that it corresponds to. For composite components, the type is the function or class component itself. For host components (`div`, `span`, etc.), the type is a string.\n\nConceptually, the type is the function (as in `v = f(d)`) whose execution is being tracked by the stack frame.\n\nAlong with the type, the key is used during reconciliation to determine whether the fiber can be reused.\n\n#### `child` and `sibling`\n\nThese fields point to other fibers, describing the recursive tree structure of a fiber.\n\nThe child fiber corresponds to the value returned by a component's `render` method. So in the following example\n\n```js\nfunction Parent() {\n  return <Child />\n}\n```\n\nThe child fiber of `Parent` corresponds to `Child`.\n\nThe sibling field accounts for the case where `render` returns multiple children (a new feature in Fiber!):\n\n```js\nfunction Parent() {\n  return [<Child1 />, <Child2 />]\n}\n```\n\nThe child fibers form a singly-linked list whose head is the first child. So in this example, the child of `Parent` is `Child1` and the sibling of `Child1` is `Child2`.\n\nGoing back to our function analogy, you can think of a child fiber as a [tail-called function](https://en.wikipedia.org/wiki/Tail_call).\n\n#### `return`\n\nThe return fiber is the fiber to which the program should return after processing the current one. It is conceptually the same as the return address of a stack frame. It can also be thought of as the parent fiber.\n\nIf a fiber has multiple child fibers, each child fiber's return fiber is the parent. So in our example in the previous section, the return fiber of `Child1` and `Child2` is `Parent`.\n\n#### `pendingProps` and `memoizedProps`\n\nConceptually, props are the arguments of a function. A fiber's `pendingProps` are set at the beginning of its execution, and `memoizedProps` are set at the end.\n\nWhen the incoming `pendingProps` are equal to `memoizedProps`, it signals that the fiber's previous output can be reused, preventing unnecessary work.\n\n#### `pendingWorkPriority`\n\nA number indicating the priority of the work represented by the fiber. The [ReactPriorityLevel](https://github.com/facebook/react/blob/master/src/renderers/shared/fiber/ReactPriorityLevel.js) module lists the different priority levels and what they represent.\n\nWith the exception of `NoWork`, which is 0, a larger number indicates a lower priority. For example, you could use the following function to check if a fiber's priority is at least as high as the given level:\n\n```js\nfunction matchesPriority(fiber, priority) {\n  return fiber.pendingWorkPriority !== 0 &&\n         fiber.pendingWorkPriority <= priority\n}\n```\n\n*This function is for illustration only; it's not actually part of the React Fiber codebase.*\n\nThe scheduler uses the priority field to search for the next unit of work to perform. This algorithm will be discussed in a future section.\n\n#### `alternate`\n\n<dl>\n  <dt>flush</dt>\n  <dd>To flush a fiber is to render its output onto the screen.</dd>\n\n  <dt>work-in-progress</dt>\n  <dd>A fiber that has not yet completed; conceptually, a stack frame which has not yet returned.</dd>\n</dl>\n\nAt any time, a component instance has at most two fibers that correspond to it: the current, flushed fiber, and the work-in-progress fiber.\n\nThe alternate of the current fiber is the work-in-progress, and the alternate of the work-in-progress is the current fiber.\n\nA fiber's alternate is created lazily using a function called `cloneFiber`. Rather than always creating a new object, `cloneFiber` will attempt to reuse the fiber's alternate if it exists, minimizing allocations.\n\nYou should think of the `alternate` field as an implementation detail, but it pops up often enough in the codebase that it's valuable to discuss it here.\n\n#### `output`\n\n<dl>\n  <dt>host component</dt>\n  <dd>The leaf nodes of a React application. They are specific to the rendering environment (e.g., in a browser app, they are `div`, `span`, etc.). In JSX, they are denoted using lowercase tag names.</dd>\n</dl>\n\nConceptually, the output of a fiber is the return value of a function.\n\nEvery fiber eventually has output, but output is created only at the leaf nodes by **host components**. The output is then transferred up the tree.\n\nThe output is what is eventually given to the renderer so that it can flush the changes to the rendering environment. It's the renderer's responsibility to define how the output is created and updated.\n\n## Future sections\n\nThat's all there is for now, but this document is nowhere near complete. Future sections will describe the algorithms used throughout the lifecycle of an update. Topics to cover include:\n\n- how the scheduler finds the next unit of work to perform.\n- how priority is tracked and propagated through the fiber tree.\n- how the scheduler knows when to pause and resume work.\n- how work is flushed and marked as complete.\n- how side-effects (such as lifecycle methods) work.\n- what a coroutine is and how it can be used to implement features like context and layout.\n\n## Related Videos\n- [What's Next for React (ReactNext 2016)](https://youtu.be/aV1271hd9ew)",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": "https://github.com/acdlite/react-fiber-architecture/blob/master/README.md"
    },
    {
      "id": 17,
      "title": "Jquery",
      "subTitle": "",
      "image": "https://source.unsplash.com/WkfDrhxDMC8",
      "content": "New Wave JavaScript\n==================================================\n\n[![FOSSA Status](https://app.fossa.io/api/projects/git%2Bgithub.com%2Fjquery%2Fjquery.svg?type=shield)](https://app.fossa.io/projects/git%2Bgithub.com%2Fjquery%2Fjquery?ref=badge_shield)\n\n[![Gitter](https://badges.gitter.im/jquery/jquery.svg)](https://gitter.im/jquery/jquery?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge)\n\nContribution Guides\n--------------------------------------\n\nIn the spirit of open source software development, jQuery always encourages community code contribution. To help you get started and before you jump into writing code, be sure to read these important contribution guidelines thoroughly:\n\n1. [Getting Involved](https://contribute.jquery.org/)\n2. [Core Style Guide](https://contribute.jquery.org/style-guide/js/)\n3. [Writing Code for jQuery Foundation Projects](https://contribute.jquery.org/code/)\n\n\nEnvironments in which to use jQuery\n--------------------------------------\n\n- [Browser support](https://jquery.com/browser-support/)\n- jQuery also supports Node, browser extensions, and other non-browser environments.\n\n\nWhat you need to build your own jQuery\n--------------------------------------\n\nTo build jQuery, you need to have the latest Node.js/npm and git 1.7 or later. Earlier versions might work, but are not supported.\n\nFor Windows, you have to download and install [git](https://git-scm.com/downloads) and [Node.js](https://nodejs.org/en/download/).\n\nmacOS users should install [Homebrew](https://brew.sh/). Once Homebrew is installed, run `brew install git` to install git,\nand `brew install node` to install Node.js.\n\nLinux/BSD users should use their appropriate package managers to install git and Node.js, or build from source\nif you swing that way. Easy-peasy.\n\n\nHow to build your own jQuery\n----------------------------\n\nFirst, [clone the jQuery git repo](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository).\n\nThen, enter the jquery directory and run the build script:\n```bash\ncd jquery && npm run build\n```\nThe built version of jQuery will be put in the `dist/` subdirectory, along with the minified copy and associated map file.\n\nIf you want to create custom build or help with jQuery development, it would be better to install [grunt command line interface](https://github.com/gruntjs/grunt-cli) as a global package:\n\n```\nnpm install -g grunt-cli\n```\nMake sure you have `grunt` installed by testing:\n```\ngrunt -V\n```\n\nNow by running the `grunt` command, in the jquery directory, you can build a full version of jQuery, just like with an `npm run build` command:\n```\ngrunt\n```\n\nThere are many other tasks available for jQuery Core:\n```\ngrunt -help\n```\n\n### Modules\n\nSpecial builds can be created that exclude subsets of jQuery functionality.\nThis allows for smaller custom builds when the builder is certain that those parts of jQuery are not being used.\nFor example, an app that only used JSONP for `$.ajax()` and did not need to calculate offsets or positions of elements could exclude the offset and ajax/xhr modules.\n\nAny module may be excluded except for `core`, and `selector`. To exclude a module, pass its path relative to the `src` folder (without the `.js` extension).\n\nSome example modules that can be excluded are:\n\n- **ajax**: All AJAX functionality: `$.ajax()`, `$.get()`, `$.post()`, `$.ajaxSetup()`, `.load()`, transports, and ajax event shorthands such as `.ajaxStart()`.\n- **ajax/xhr**: The XMLHTTPRequest AJAX transport only.\n- **ajax/script**: The `<script>` AJAX transport only; used to retrieve scripts.\n- **ajax/jsonp**: The JSONP AJAX transport only; depends on the ajax/script transport.\n- **css**: The `.css()` method. Also removes **all** modules depending on css (including **effects**, **dimensions**, and **offset**).\n- **css/showHide**:  Non-animated `.show()`, `.hide()` and `.toggle()`; can be excluded if you use classes or explicit `.css()` calls to set the `display` property. Also removes the **effects** module.\n- **deprecated**: Methods documented as deprecated but not yet removed.\n- **dimensions**: The `.width()` and `.height()` methods, including `inner-` and `outer-` variations.\n- **effects**: The `.animate()` method and its shorthands such as `.slideUp()` or `.hide(\"slow\")`.\n- **event**: The `.on()` and `.off()` methods and all event functionality. Also removes `event/alias`.\n- **event/alias**: All event attaching/triggering shorthands like `.click()` or `.mouseover()`.\n- **event/trigger**: The `.trigger()` and `.triggerHandler()` methods. Used by the **alias** module.\n- **offset**: The `.offset()`, `.position()`, `.offsetParent()`, `.scrollLeft()`, and `.scrollTop()` methods.\n- **wrap**: The `.wrap()`, `.wrapAll()`, `.wrapInner()`, and `.unwrap()` methods.\n- **core/ready**: Exclude the ready module if you place your scripts at the end of the body. Any ready callbacks bound with `jQuery()` will simply be called immediately. However, `jQuery(document).ready()` will not be a function and `.on(\"ready\", ...)` or similar will not be triggered.\n- **deferred**: Exclude jQuery.Deferred. This also removes jQuery.Callbacks. *Note* that modules that depend on jQuery.Deferred(AJAX, effects, core/ready) will not be removed and will still expect jQuery.Deferred to be there. Include your own jQuery.Deferred implementation or exclude those modules as well (`grunt custom:-deferred,-ajax,-effects,-core/ready`).\n- **exports/global**: Exclude the attachment of global jQuery variables ($ and jQuery) to the window.\n- **exports/amd**: Exclude the AMD definition.\n\nThe build process shows a message for each dependent module it excludes or includes.\n\n##### AMD name\n\nAs an option, you can set the module name for jQuery's AMD definition. By default, it is set to \"jquery\", which plays nicely with plugins and third-party libraries, but there may be cases where you'd like to change this. Simply set the `\"amd\"` option:\n\n```bash\ngrunt custom --amd=\"custom-name\"\n```\n\nOr, to define anonymously, set the name to an empty string.\n\n```bash\ngrunt custom --amd=\"\"\n```\n\n#### Custom Build Examples\n\nTo create a custom build, first check out the version:\n\n```bash\ngit pull; git checkout VERSION\n```\n\nWhere VERSION is the version you want to customize. Then, make sure all Node dependencies are installed:\n\n```bash\nnpm install\n```\n\nCreate the custom build using the `grunt custom` option, listing the modules to be excluded.\n\nExclude all **ajax** functionality:\n\n```bash\ngrunt custom:-ajax\n```\n\nExcluding **css** removes modules depending on CSS: **effects**, **offset**, **dimensions**.\n\n```bash\ngrunt custom:-css\n```\n\nExclude a bunch of modules:\n\n```bash\ngrunt custom:-ajax,-css,-deprecated,-dimensions,-effects,-event/alias,-offset,-wrap\n```\n\nFor questions or requests regarding custom builds, please start a thread on the [Developing jQuery Core](https://forum.jquery.com/developing-jquery-core) section of the forum. Due to the combinatorics and custom nature of these builds, they are not regularly tested in jQuery's unit test process.\n\nRunning the Unit Tests\n--------------------------------------\n\nMake sure you have the necessary dependencies:\n\n```bash\nnpm install\n```\n\nStart `grunt watch` or `npm start` to auto-build jQuery as you work:\n\n```bash\ngrunt watch\n```\n\n\nRun the unit tests with a local server that supports PHP. Ensure that you run the site from the root directory, not the \"test\" directory. No database is required. Pre-configured php local servers are available for Windows and Mac. Here are some options:\n\n- Windows: [WAMP download](http://www.wampserver.com/en/)\n- Mac: [MAMP download](https://www.mamp.info/en/downloads/)\n- Linux: [Setting up LAMP](https://www.linux.com/learn/tutorials/288158-easy-lamp-server-installation)\n- [Mongoose (most platforms)](https://code.google.com/p/mongoose/)\n\n\n\n\nBuilding to a different directory\n---------------------------------\n\nTo copy the built jQuery files from `/dist` to another directory:\n\n```bash\ngrunt && grunt dist:/path/to/special/location/\n```\nWith this example, the output files would be:\n\n```bash\n/path/to/special/location/jquery.js\n/path/to/special/location/jquery.min.js\n```\n\nTo add a permanent copy destination, create a file in `dist/` called \".destination.json\". Inside the file, paste and customize the following:\n\n```json\n\n{\n  \"/Absolute/path/to/other/destination\": true\n}\n```\n\nAdditionally, both methods can be combined.\n\n\n\nEssential Git\n-------------\n\nAs the source code is handled by the Git version control system, it's useful to know some features used.\n\n### Cleaning ###\n\nIf you want to purge your working directory back to the status of upstream, the following commands can be used (remember everything you've worked on is gone after these):\n\n```bash\ngit reset --hard upstream/master\ngit clean -fdx\n```\n\n### Rebasing ###\n\nFor feature/topic branches, you should always use the `--rebase` flag to `git pull`, or if you are usually handling many temporary \"to be in a github pull request\" branches, run the following to automate this:\n\n```bash\ngit config branch.autosetuprebase local\n```\n(see `man git-config` for more information)\n\n### Handling merge conflicts ###\n\nIf you're getting merge conflicts when merging, instead of editing the conflicted files manually, you can use the feature\n`git mergetool`. Even though the default tool `xxdiff` looks awful/old, it's rather useful.\n\nThe following are some commands that can be used there:\n\n* `Ctrl + Alt + M` - automerge as much as possible\n* `b` - jump to next merge conflict\n* `s` - change the order of the conflicted lines\n* `u` - undo a merge\n* `left mouse button` - mark a block to be the winner\n* `middle mouse button` - mark a line to be the winner\n* `Ctrl + S` - save\n* `Ctrl + Q` - quit\n\n[QUnit](https://api.qunitjs.com) Reference\n-----------------\n\n### Test methods ###\n\n```js\nexpect( numAssertions );\nstop();\nstart();\n```\n\n\n*Note*: QUnit's eventual addition of an argument to stop/start is ignored in this test suite so that start and stop can be passed as callbacks without worrying about their parameters.\n\n### Test assertions ###\n\n\n```js\nok( value, [message] );\nequal( actual, expected, [message] );\nnotEqual( actual, expected, [message] );\ndeepEqual( actual, expected, [message] );\nnotDeepEqual( actual, expected, [message] );\nstrictEqual( actual, expected, [message] );\nnotStrictEqual( actual, expected, [message] );\nthrows( block, [expected], [message] );\n```\n\n\nTest Suite Convenience Methods Reference (See [test/data/testinit.js](https://github.com/jquery/jquery/blob/master/test/data/testinit.js))\n------------------------------\n\n### Returns an array of elements with the given IDs ###\n\n```js\nq( ... );\n```\n\nExample:\n\n```js\nq(\"main\", \"foo\", \"bar\");\n\n=> [ div#main, span#foo, input#bar ]\n```\n\n### Asserts that a selection matches the given IDs ###\n\n```js\nt( testName, selector, [ \"array\", \"of\", \"ids\" ] );\n```\n\nExample:\n\n```js\nt(\"Check for something\", \"//[a]\", [\"foo\", \"bar\"]);\n```\n\n\n\n### Fires a native DOM event without going through jQuery ###\n\n```js\nfireNative( node, eventType )\n```\n\nExample:\n\n```js\nfireNative( jQuery(\"#elem\")[0], \"click\" );\n```\n\n### Add random number to url to stop caching ###\n\n```js\nurl( \"some/url\" );\n```\n\nExample:\n\n```js\nurl(\"index.html\");\n\n=> \"data/index.html?10538358428943\"\n\n\nurl(\"mock.php?foo=bar\");\n\n=> \"data/mock.php?foo=bar&10538358345554\"\n```\n\n\n### Run tests in an iframe ###\n\nSome tests may require a document other than the standard test fixture, and\nthese can be run in a separate iframe. The actual test code and assertions\nremain in jQuery's main test files; only the minimal test fixture markup\nand setup code should be placed in the iframe file.\n\n```js\ntestIframe( testName, fileName,\n  function testCallback(\n      assert, jQuery, window, document,\n\t  [ additional args ] ) {\n\t...\n  } );\n```\n\nThis loads a page, constructing a url with fileName `\"./data/\" + fileName`.\nThe iframed page determines when the callback occurs in the test by\nincluding the \"/test/data/iframeTest.js\" script and calling\n`startIframeTest( [ additional args ] )` when appropriate. Often this\nwill be after either document ready or `window.onload` fires.\n\nThe `testCallback` receives the QUnit `assert` object created by `testIframe`\nfor this test, followed by the global `jQuery`, `window`, and `document` from\nthe iframe. If the iframe code passes any arguments to `startIframeTest`,\nthey follow the `document` argument.\n\n\nQuestions?\n----------\n\nIf you have any questions, please feel free to ask on the\n[Developing jQuery Core forum](https://forum.jquery.com/developing-jquery-core) or in #jquery on irc.freenode.net.",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": "https://github.com/jquery/jquery/blob/master/README.md"
    },
    {
      "id": 16,
      "title": "How to Contribute",
      "subTitle": "",
      "image": "https://source.unsplash.com/1SAnrIxw5OY",
      "content": "---\nid: how-to-contribute\ntitle: How to Contribute\nlayout: contributing\npermalink: docs/how-to-contribute.html\nnext: codebase-overview.html\nredirect_from:\n  - \"contributing/how-to-contribute.html\"\n  - \"tips/introduction.html\"\n---\n\nReact is one of Facebook's first open source projects that is both under very active development and is also being used to ship code to everybody on [facebook.com](https://www.facebook.com). We're still working out the kinks to make contributing to this project as easy and transparent as possible, but we're not quite there yet. Hopefully this document makes the process for contributing clear and answers some questions that you may have.\n\n### [Code of Conduct](https://github.com/facebook/react/blob/master/CODE_OF_CONDUCT.md) {#code-of-conduct}\n\nFacebook has adopted the [Contributor Covenant](https://www.contributor-covenant.org/) as its Code of Conduct, and we expect project participants to adhere to it. Please read [the full text](https://github.com/facebook/react/blob/master/CODE_OF_CONDUCT.md) so that you can understand what actions will and will not be tolerated.\n\n### Open Development {#open-development}\n\nAll work on React happens directly on [GitHub](https://github.com/facebook/react). Both core team members and external contributors send pull requests which go through the same review process.\n\n### Semantic Versioning {#semantic-versioning}\n\nReact follows [semantic versioning](https://semver.org/). We release patch versions for critical bugfixes, minor versions for new features or non-essential changes, and major versions for any breaking changes. When we make breaking changes, we also introduce deprecation warnings in a minor version so that our users learn about the upcoming changes and migrate their code in advance. Learn more about our commitment to stability and incremental migration in [our versioning policy](https://reactjs.org/docs/faq-versioning.html).\n\nEvery significant change is documented in the [changelog file](https://github.com/facebook/react/blob/master/CHANGELOG.md).\n\n### Branch Organization {#branch-organization}\n\nSubmit all changes directly to the [`master branch`](https://github.com/facebook/react/tree/master). We don't use separate branches for development or for upcoming releases. We do our best to keep `master` in good shape, with all tests passing.\n\nCode that lands in `master` must be compatible with the latest stable release. It may contain additional features, but no breaking changes. We should be able to release a new minor version from the tip of `master` at any time.\n\n### Feature Flags {#feature-flags}\n\nTo keep the `master` branch in a releasable state, breaking changes and experimental features must be gated behind a feature flag.\n\nFeature flags are defined in [`packages/shared/ReactFeatureFlags.js`](https://github.com/facebook/react/blob/master/packages/shared/ReactFeatureFlags.js). Some builds of React may enable different sets of feature flags; for example, the React Native build may be configured differently than React DOM. These flags are found in [`packages/shared/forks`](https://github.com/facebook/react/tree/master/packages/shared/forks). Feature flags are statically typed by Flow, so you can run `yarn flow` to confirm that you've updated all the necessary files.\n\nReact's build system will strip out disabled feature branches before publishing. A continuous integration job runs on every commit to check for changes in bundle size. You can use the change in size as a signal that a feature was gated correctly.\n\n### Bugs {#bugs}\n\n#### Where to Find Known Issues {#where-to-find-known-issues}\n\nWe are using [GitHub Issues](https://github.com/facebook/react/issues) for our public bugs. We keep a close eye on this and try to make it clear when we have an internal fix in progress. Before filing a new task, try to make sure your problem doesn't already exist.\n\n#### Reporting New Issues {#reporting-new-issues}\n\nThe best way to get your bug fixed is to provide a reduced test case. This [JSFiddle template](https://jsfiddle.net/Luktwrdm/) is a great starting point.\n\n#### Security Bugs {#security-bugs}\n\nFacebook has a [bounty program](https://www.facebook.com/whitehat/) for the safe disclosure of security bugs. With that in mind, please do not file public issues; go through the process outlined on that page.\n\n### How to Get in Touch {#how-to-get-in-touch}\n\n* IRC: [#reactjs on freenode](https://webchat.freenode.net/?channels=reactjs)\n* [Discussion forums](https://reactjs.org/community/support.html#popular-discussion-forums)\n\nThere is also [an active community of React users on the Discord chat platform](https://www.reactiflux.com/) in case you need help with React.\n\n### Proposing a Change {#proposing-a-change}\n\nIf you intend to change the public API, or make any non-trivial changes to the implementation, we recommend [filing an issue](https://github.com/facebook/react/issues/new). This lets us reach an agreement on your proposal before you put significant effort into it.\n\nIf you're only fixing a bug, it's fine to submit a pull request right away but we still recommend to file an issue detailing what you're fixing. This is helpful in case we don't accept that specific fix but want to keep track of the issue.\n\n### Your First Pull Request {#your-first-pull-request}\n\nWorking on your first Pull Request? You can learn how from this free video series:\n\n**[How to Contribute to an Open Source Project on GitHub](https://egghead.io/series/how-to-contribute-to-an-open-source-project-on-github)**\n\nTo help you get your feet wet and get you familiar with our contribution process, we have a list of **[good first issues](https://github.com/facebook/react/issues?q=is:open+is:issue+label:\"good+first+issue\")** that contain bugs that have a relatively limited scope. This is a great place to get started.\n\nIf you decide to fix an issue, please be sure to check the comment thread in case somebody is already working on a fix. If nobody is working on it at the moment, please leave a comment stating that you intend to work on it so other people don't accidentally duplicate your effort.\n\nIf somebody claims an issue but doesn't follow up for more than two weeks, it's fine to take it over but you should still leave a comment.\n\n### Sending a Pull Request {#sending-a-pull-request}\n\nThe core team is monitoring for pull requests. We will review your pull request and either merge it, request changes to it, or close it with an explanation. For API changes we may need to fix our internal uses at Facebook.com, which could cause some delay. We'll do our best to provide updates and feedback throughout the process.\n\n**Before submitting a pull request,** please make sure the following is done:\n\n1. Fork [the repository](https://github.com/facebook/react) and create your branch from `master`.\n2. Run `yarn` in the repository root.\n3. If you've fixed a bug or added code that should be tested, add tests!\n4. Ensure the test suite passes (`yarn test`). Tip: `yarn test --watch TestName` is helpful in development.\n5. Run `yarn test-prod` to test in the production environment. It supports the same options as `yarn test`.\n6. If you need a debugger, run `yarn debug-test --watch TestName`, open `chrome://inspect`, and press \"Inspect\".\n7. Format your code with [prettier](https://github.com/prettier/prettier) (`yarn prettier`).\n8. Make sure your code lints (`yarn lint`). Tip: `yarn linc` to only check changed files.\n9. Run the [Flow](https://flowtype.org/) typechecks (`yarn flow`).\n10. If you haven't already, complete the CLA.\n\n### Contributor License Agreement (CLA) {#contributor-license-agreement-cla}\n\nIn order to accept your pull request, we need you to submit a CLA. You only need to do this once, so if you've done this for another Facebook open source project, you're good to go. If you are submitting a pull request for the first time, just let us know that you have completed the CLA and we can cross-check with your GitHub username.\n\n**[Complete your CLA here.](https://code.facebook.com/cla)**\n\n### Contribution Prerequisites {#contribution-prerequisites}\n\n* You have [Node](https://nodejs.org) installed at v8.0.0+ and [Yarn](https://yarnpkg.com/en/) at v1.2.0+.\n* You have `gcc` installed or are comfortable installing a compiler if needed. Some of our dependencies may require a compilation step. On OS X, the Xcode Command Line Tools will cover this. On Ubuntu, `apt-get install build-essential` will install the required packages. Similar commands should work on other Linux distros. Windows will require some additional steps, see the [`node-gyp` installation instructions](https://github.com/nodejs/node-gyp#installation) for details.\n* You are familiar with Git.\n\n### Development Workflow {#development-workflow}\n\nAfter cloning React, run `yarn` to fetch its dependencies.\nThen, you can run several commands:\n\n* `yarn lint` checks the code style.\n* `yarn linc` is like `yarn lint` but faster because it only checks files that differ in your branch.\n* `yarn test` runs the complete test suite.\n* `yarn test --watch` runs an interactive test watcher.\n* `yarn test <pattern>` runs tests with matching filenames.\n* `yarn test-prod` runs tests in the production environment. It supports all the same options as `yarn test`.\n* `yarn debug-test` is just like `yarn test` but with a debugger. Open `chrome://inspect` and press \"Inspect\".\n* `yarn flow` runs the [Flow](https://flowtype.org/) typechecks.\n* `yarn build` creates a `build` folder with all the packages.\n* `yarn build react/index,react-dom/index --type=UMD` creates UMD builds of just React and ReactDOM.\n\nWe recommend running `yarn test` (or its variations above) to make sure you don't introduce any regressions as you work on your change. However it can be handy to try your build of React in a real project.\n\nFirst, run `yarn build`. This will produce pre-built bundles in `build` folder, as well as prepare npm packages inside `build/packages`.\n\nThe easiest way to try your changes is to run `yarn build react/index,react-dom/index --type=UMD` and then open `fixtures/packaging/babel-standalone/dev.html`. This file already uses `react.development.js` from the `build` folder so it will pick up your changes.\n\nIf you want to try your changes in your existing React project, you may copy `build/dist/react.development.js`, `build/dist/react-dom.development.js`, or any other build products into your app and use them instead of the stable version. If your project uses React from npm, you may delete `react` and `react-dom` in its dependencies and use `yarn link` to point them to your local `build` folder:\n\n```sh\ncd ~/path_to_your_react_clone/build/node_modules/react\nyarn link\ncd ~/path_to_your_react_clone/build/node_modules/react-dom\nyarn link\ncd /path/to/your/project\nyarn link react react-dom\n```\n\nEvery time you run `yarn build` in the React folder, the updated versions will appear in your project's `node_modules`. You can then rebuild your project to try your changes.\n\nWe still require that your pull request contains unit tests for any new functionality. This way we can ensure that we don't break your code in the future.\n\n### Style Guide {#style-guide}\n\nWe use an automatic code formatter called [Prettier](https://prettier.io/).\nRun `yarn prettier` after making any changes to the code.\n\nThen, our linter will catch most issues that may exist in your code.\nYou can check the status of your code styling by simply running `yarn linc`.\n\nHowever, there are still some styles that the linter cannot pick up. If you are unsure about something, looking at [Airbnb's Style Guide](https://github.com/airbnb/javascript) will guide you in the right direction.\n\n### Introductory Video {#introductory-video}\n\nYou may be interested in watching [this short video](https://www.youtube.com/watch?v=wUpPsEcGsg8) (26 mins) which gives an introduction on how to contribute to React.\n\n#### Video highlights: {#video-highlights}\n- [4:12](https://youtu.be/wUpPsEcGsg8?t=4m12s) - Building and testing React locally\n- [6:07](https://youtu.be/wUpPsEcGsg8?t=6m7s) - Creating and sending pull requests\n- [8:25](https://youtu.be/wUpPsEcGsg8?t=8m25s) - Organizing code\n- [14:43](https://youtu.be/wUpPsEcGsg8?t=14m43s) - React npm registry\n- [19:15](https://youtu.be/wUpPsEcGsg8?t=19m15s) - Adding new React features\n\nFor a realistic overview of what it _feels_ like to contribute to React for the first time, check out [this entertaining ReactNYC talk](https://www.youtube.com/watch?v=GWCcZ6fnpn4).\n\n### Request for Comments (RFC) {#request-for-comments-rfc}\n\nMany changes, including bug fixes and documentation improvements can be implemented and reviewed via the normal GitHub pull request workflow.\n\nSome changes though are \"substantial\", and we ask that these be put through a bit of a design process and produce a consensus among the React core team.\n\nThe \"RFC\" (request for comments) process is intended to provide a consistent and controlled path for new features to enter the project. You can contribute by visiting the [rfcs repository](https://github.com/reactjs/rfcs).\n\n### License {#license}\n\nBy contributing to React, you agree that your contributions will be licensed under its MIT license.\n\n### What Next? {#what-next}\n\nRead the [next section](/docs/codebase-overview.html) to learn how the codebase is organized.",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": "https://github.com/reactjs/reactjs.org/blob/master/content/docs/how-to-contribute.md"
    },
    {
      "id": 15,
      "title": "React How to",
      "subTitle": "",
      "image": "https://source.unsplash.com/Bd7gNnWJBkU",
      "content": "# react-howto\n\nIf you’re new to React (or frontend in general) you may find the ecosystem confusing. There are a few reasons for this.\n\n* React has historically been targeted at early-adopters and experts\n* Facebook only open-sources what it actually uses, so it doesn’t focus on tooling for smaller-than-Facebook projects\n* There’s a lot of bad marketing masquerading as React guides\n\nThroughout this document, I’ll assume you’ve built a web page with HTML, CSS and JavaScript.\n\n## Why should you listen to me?\n\nThere’s a ton of conflicting advice about React out there; why listen to me?\n\nI was one of the original members of the Facebook team that built and open-sourced React. I’m no longer at Facebook and I’m now at a small startup, so I have a non-Facebook perspective as well.\n\n## How to tackle the React ecosystem\n\nAll software is built on a stack of technologies, and you need to understand enough of that stack to build your app. The reason why the React ecosystem of tooling seems overwhelming is because it’s always explained in the wrong order.\n\nYou should learn, in this order, **without skipping ahead or learning concurrently**:\n\n* [React itself](#learning-react-itself)\n* [`npm`](#learning-npm)\n* [JavaScript “bundlers”](#learning-javascript-bundlers)\n* [ES6](#learning-es6)\n* [Routing](#learning-routing)\n* [Flux](#learning-flux)\n\n**You don't need to learn all of these to be productive with React.** Only move to the next step if you have a problem that needs to be solved.\n\nAdditionally, there are a few topics that are often mentioned in the React community that are \"bleeding edge\". The topics below are interesting, but they're difficult to understand, are far less popular than the above topics and **aren't required for most apps**.\n* [Inline styles](#learning-inline-styles)\n* [Server rendering](#learning-server-rendering)\n* [Immutable.js](#learning-immutablejs)\n* [Relay, Falcor, etc](#learning-relay-falcor-etc)\n\n## Learning React itself\n\nIt’s a common misconception that you need to waste a lot of time setting up tooling to start to learn React. In the official documentation you’ll find a [copy-paste HTML template](https://facebook.github.io/react/docs/getting-started.html#quick-start-without-npm) that you can save in an `.html` file and get started right away. **No tooling is required for this step, and don’t start learning extra tooling until you’re comfortable with React basics.**\n\nI still think the easiest way to learn React is [the official tutorial](https://facebook.github.io/react/docs/tutorial.html).\n\n## Learning `npm`\n\n`npm` is the Node.js package manager and is the most popular way front-end engineers and designers share JavaScript code. It includes a module system called `CommonJS` and lets you install command-line tools written in JavaScript. Read [this post](http://0fps.net/2013/01/22/commonjs-why-and-how/) for background on why `CommonJS` is necessary for browsers, or the [CommonJS Spec Wiki](http://wiki.commonjs.org/wiki/Introduction) for more on the `CommonJS` API.\n\nMost reusable components, libraries and tools in the React ecosystem are available as `CommonJS` modules and are installed with `npm`.\n\n## Learning JavaScript bundlers\n\nFor a number of good technical reasons `CommonJS` modules (i.e. everything in `npm`) cannot be used natively in the browser. You need a JavaScript “bundler” to “bundle” these modules into `.js` files that you can include in your web page with a `<script>` tag.\n\nExamples of JavaScript bundlers include `webpack` and `browserify`. Both are good choices, but I prefer `webpack` since it has a lot of features that make development of large apps easier. Since its documentation can be confusing, I have a [plug-and-play template for getting started](https://github.com/petehunt/react-webpack-template) and I wrote a [how-to guide for webpack](https://github.com/petehunt/webpack-howto) for more complex use cases.\n\nReact also now offers [an officially supported CLI tool called Create React App](https://github.com/facebookincubator/create-react-app). It lets you create React projects powered by `webpack` without any configuration. It has its limitations, but it can serve as a great starting point, and its updates will add more features over time. It also offers an \"ejection\" feature that copies all configs and dependencies into your project so you have full control over them.\n\nOne thing to keep in mind: `CommonJS` uses the `require()` function to import modules, so a lot of people get confused and think that it has something to do with a project called `require.js`. For a number of technical reasons, I would suggest that you avoid `require.js`. It’s also not very popular in the React ecosystem.\n\n## Learning ES6\n\nOutside of JSX (which you learned in the React tutorial), you may see some funny syntax in React examples. This is called ES6, and it’s the latest version of JavaScript so you may not have learned it yet. Since it’s so new, it’s not supported in browsers yet, but your bundler can translate it for you with the proper configuration.\n\nIf you just want to get things done with React, **you can skip learning ES6**, or try to pick it up along the way.\n\nYou may see some talk about ES6 classes being the preferred way to create React components. This is untrue. Most people (including Facebook) are using `React.createClass()`.\n\n## Learning routing\n\n“Single-page applications” are all the rage these days. These are web pages that load once, and when the user clicks on a link or a button, JavaScript running on the page updates the address bar, but the web page is not refreshed. Management of the address bar is done by something called a **router**.\n\nThe most popular router in the React ecosystem is [react-router](https://github.com/rackt/react-router). If you’re building a single-page application, use it unless you have a good reason not to.\n\n**Don’t use a router if you aren’t building a single-page application**. Most projects start out as smaller components inside of a larger application anyway.\n\n## Learning Flux\n\nYou’ve probably heard of Flux. There’s a *ton* of misinformation about Flux out there.\n\nA lot of people sit down to build an app and want to define their data model, and they think they need to use Flux to do it. **This is the wrong way to adopt Flux. Flux should only be added once many components have already been built.**\n\nReact components are arranged in a hierarchy. Most of the time, your data model also follows a hierarchy. In these situations Flux doesn’t buy you much. Sometimes, however, your data model is not hierarchical. When your React components start to receive `props` that feel extraneous, or you have a small number of components starting to get very complex, then you might want to look into Flux.\n\n**You’ll know when you need Flux. If you aren’t sure if you need it, you don’t need it.**\n\nIf you have decided to use Flux, the most popular and well-documented Flux library is [Redux](http://redux.js.org/). There are *a lot* of alternatives out there, and you’ll be tempted to evaluate lots of them, but my advice is to just stick with the most popular one.\n\n## Learning inline styles\n\nPre-React, a lot of people reused CSS styles with complicated style sheets built by preprocessors like SASS. Since React makes writing reusable components easy, your stylesheets can be less complicated. Many in the community (including myself) are experimenting with getting rid of stylesheets altogether.\n\nThis is a fairly crazy idea for a number of reasons. It makes media queries more difficult, and it's possible that there are  performance limitations using this technique. **When starting out with React, just style things the way you normally would.**\n\nOnce you've got a feel for how React works, you can look at alternate techniques. One popular one is [BEM](https://en.bem.info/). I recommend phasing out your CSS preprocessor, since React gives you a more powerful way to reuse styles (by reusing components) and your JavaScript bundler can generate more efficient stylesheets for you (I gave [a talk about this at OSCON](https://www.youtube.com/watch?v=VkTCL6Nqm6Y)). With that said, React, like any other JavaScript library, will work just fine with a CSS preprocessor.\n\nAlternatively, you can also use [CSS Modules](http://glenmaddern.com/articles/css-modules), more specifically [react-css-modules](https://github.com/gajus/react-css-modules). With CSS Modules you'll still write CSS (or SASS/LESS/Stylus), but you can manage and compose your CSS files like you'd do with inline styles in React. And you don't need to worry about managing your class names using methodologies like BEM, as this will be handled for you under the hood by the module system.\n\n## Learning server rendering\n\nServer rendering is often called \"universal\" or \"isomorphic\" JS. It means that you can take your React components and render them to static HTML on the server. This improves initial startup performance because the user does not need to wait for JS to download in order to see the initial UI, and React can re-use the server-rendered HTML so it doesn't need to generate it client-side.\n\nYou need server rendering if you notice that your initial render is too slow or if you want to improve your search engine ranking. While it's true that Google now indexes client-rendered content, as of January 2016 every time it's been measured it's been shown to negatively affect ranking, potentially because of the performance penalty of client-side rendering.\n\nServer rendering still requires a lot of tooling to get right. Since it transparently supports React components written without server rendering in mind, you should build your app first and worry about server rendering later. You won't need to rewrite all of your components to support it.\n\n## Learning Immutable.js\n\n[Immutable.js](https://facebook.github.io/immutable-js/) provides a set of data structures that can help to solve certain performance issues when building React apps. It's a great library, and you'll probably use it a lot in your apps moving forward, but it's completely unnecessary until you have an appreciation of the performance implications. \n\n## Learning Relay, Falcor etc\n\nThese are technologies that help you reduce the number of AJAX requests. They’re still very cutting-edge, so if you don’t have a problem with too many AJAX requests, you don’t need Relay or Falcor.",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": "https://github.com/petehunt/react-howto/blob/master/README.md"
    },
    {
      "id": 14,
      "title": "리엑트의 첫걸음",
      "subTitle": "",
      "image": "https://source.unsplash.com/5fNmWej4tAA",
      "content": "# react 첫걸음\n\n당신이 React(혹은 프론트엔드개발) 초심자라면 생태계가 혼란스럽다는 사실을 발견할 것입니다. 거기에는 몇 가지 이유가 있습니다.\n\n* React는 역사적으로 얼리어답터와 전문가 집단을 겨냥해서 만들어졌습니다.\n* Facebook은 실제로 사용하는 것만을 오픈 소스화 합니다, 그래서 페이스북보다 작은 프로젝트들을 위해 오픈 소스를 다듬어 가는 데 집중하지 않습니다.\n* React 개발 지침이라고 자처하지만 홍보를 위한 거짓부렁이 많습니다.\n\n예상하건데, 이 글을 읽다 보면 당신은 HTML, CSS 그리고 JavaScript로 페이지를 작성할 것입니다.\n\n## 제 얘기를 왜 들어야 할까요?\n\n여기저기 React에 대해서 모순되는 충고들이 차고 넘칩니다; 제 얘기를 왜 들어야 할까요?\n\n저는 Facebook에서 React를 오픈소스화한 팀의 원년멤버였습니다. 지금은 Facebook 에서 나와 작은 스타트업에 있습니다. 그래서 Facebook 이 아닌 사람들의 관점도 잘 알고 있습니다.\n\n## React 생태계와 씨름하는 방법\n\n모든 소프트웨어는 기술의 집합으로 이루어져 있습니다. 그리고 당신이 애플리케이션을 만들기 위해서는 그 기술 요소들을 충분히 이해할 필요가 있습니다. 잘못된 순서로 대부분 이 기술들을 기술되기 때문에 React 생태계의 tooling(자동화 및 툴 개발)이 부담스럽게만 여겨잡니다.\n\n다음과 같은 순서로 배우셔야 합니다. **순서를 뛰어넘거나 동시에 하시면 안됩니다**:\n\n* [React 자체를 배우기](#learning-react-itself)\n* [`npm`](#learning-npm)\n* [JavaScript “번들러”](#learning-javascript-bundlers)\n* [ES6](#learning-es6)\n* [Routing](#learning-routing)\n* [Flux](#learning-flux)\n\n**React를 잘하기 위해서 이 모든 걸 할 필요는 없습니다.** 단지 문제 해결을 위해서만 다음 단계로 이동하세요.\n\n좀더 추가하자면, 안정적이지는 않지만 React 커뮤니티에서 종종 언급되는 (소위 \"bleeding edge\") 토픽들이 몇 가지 있습니다. 아래 보이는 토픽들은 흥미롭기는 하지만, 이해하기 힘들고 앞에 언급된 토픽들에비해 대중적이지 않습니다. 그리고 **대부분의 앱에서는 필요하지 않습니다.**\n* [Inline styles](#learning-inline-styles)\n* [Server rendering](#learning-server-rendering)\n* [Immutable.js](#learning-immutablejs)\n* [Relay, Falcor, etc](#learning-relay-falcor-etc)\n\n## React 자체를 배우기\n\n일반적으로 잘못 알려진 이야기가 React를 배우기 시작하기 위한 세팅시간이 많이 걸린다는 것입니다. 공식문서에서 ([복사-붙여넣기 용 HTML template](https://facebook.github.io/react/docs/getting-started.html#quick-start-without-npm)) 을 이용해서 `.html` 파일로 저장해서 바로 시작할 수 있습니다. **이 단계에서는 어떤 툴 및 세팅이 필요없고 기본 React에 익숙해 질때까지는 다른 툴 및 세팅을 시작하지 마십시오**\n\n저는 아직도 React를 배우는 가장 쉬운 방법은 [공식문서](https://facebook.github.io/react/docs/tutorial.html) 라고 생각합니다.\n\n## `npm` 배우기\n\n`npm`은 Node.js용 패키지 관리자입니다. 프론트엔드 엔지니어와 디자이너들이 Javascript 코드를 공유하는 가장 보편적인 방법입니다. `CommonJS`라고 불리는 모듈 시스템을 포함하고 있으며 Javacript 로 작성된 CLI(command-line interface) 기반으로 모듈을 설치 할 수 있습니다. 브라우저를 위해 `CommonJS` 가 왜 필요한지에 대한 배경을 알기 위해서는 [이 글](http://0fps.net/2013/01/22/commonjs-why-and-how/) 을 읽어보시고, `CommonJS` API에 대한 이해를 위해서는 [CommonJS Spec Wiki](http://wiki.commonjs.org/wiki/Introduction) 를 읽어보십시오.\n\n대부분의 React 생태계의 재사용 가능한 컴포넌트, 라이브러리, 툴은 `CommonJS` 모듈을 통해 사용가능하고 `npm`으로 설치됩니다.\n\n## JavaScript 번들러 배우기\n\n몇가지 많은 기술적 이유들 때문에 `CommonJS` 모듈 (`npm` 에 있는 모든 모듈)들은 브라우저에서 그대로 사용할 수 없습니다. 이 모듈들을 웹페이지의 `<script>` 태그에 포함된 `.js` 파일들을 포함하기 위해서는 Javascript 번들러가 필요합니다.\n\nJavascript 번들러의 예를 들자면 `webpack` 과 `browserify`가 있습니다. 모두 좋은 선택입니다. 하지만 저는 큰 애플리케이션의 개발을 쉽게 도와주는 기능이 많은 `webpack` 을 선호합니다. 문서화가 좀 헷갈린다면 [개발 시작을 위한 플러그앤 플레이 템플릿](https://github.com/petehunt/react-webpack-template)이 있고, 조금 더 복잡한 경우에는 제가 작성한 [webpack 사용기](https://github.com/petehunt/webpack-howto)도 있습니다.\n\n명심할 점 : `CommonJS`는 `require()` 함수를 모듈 임포트에 사용합니다. 그래서 많은 사람들이 `require.js`로 불리는 프로젝트와 뭔가 해야하는 지 헷갈립니다. 여러가지 기술적 이유로 `require.js`를 쓰지 말것을 추천해 드립니다. React생태계에서도 일반적이지는 않습니다.\n\n## ES6 배우기\n\nReact 예제에서 JSX(React 튜토리얼을 배울때 보던)를 감싸고 있던 코드에서 아마 당신은 재미있는 문법들을 보았을 것입니다. ES6 라고 불리는 이것은 Javascript의 최신버전입니다. 그래서 아직 당신은 이것을 배운적이 없었을 겁니다. 브라우저에서 아직은 완전히 지원되지 않지만, 번들러는 적합한 설정과 함께 브라우저가 이해할 수 있게 변환시켜 줍니다.\n\n만약 당신이 작업을 그저 React를 통해 완수하려면  **ES6배우는 것은 건너뛰거나** 혹은 작업 중에 시도해 볼 수도 있습니다.\n\nReact 컴포넌트를 만들기 위해서 더 선호되는 방법이 ES6라는 이야기를 많이 들었을 수도 있습니다. 사실이 아닙니다. 대부분 사람은 (Facebook 엔지니어 포함) `React.createClass()` 로 클래스를 만듭니다.\n(역자 주. ES6에서는 function 처럼 class 키워드를 통해 생성합니다.)\n\n## routing 배우기\n\n싱글페이지 앱(SPA)은 요즘 일시적인 대 유행입니다. 이들은 한번 페이지를 로딩한 뒤, 사용자가 링크나 버튼을 클릭하면 페이지에서 돌고 있던 javascript 가 주소창을 바꿉니다. 그러나 웹페이지가 갱신되지 않습니다. 주소창의 주소를 관리하는 것은 이른바 **router** 가 관장합니다.\n\nReact 생태계의 가장 유명한 router는 [react-router](https://github.com/rackt/react-router) 입니다. 만약 싱글페이지 앱을 만든다면 쓰면 안 되는 좋은 이유가 없는 한 이용하시면 됩니다.\n\n**싱글페이지앱을 만들지 않는다면 router를 사용하지 마세요***. 대부분 프로젝트는 어쨌든 더 큰 애플리케이션의 안쪽에서 동작하는 작은 컴포넌트로 시작합니다.\n\n## Flux 배우기\n\nFlux를 아마도 들어보셨을 거라고 봅니다. Flux에 대해서는 엄청나게 많은 잘못 알려진 정보들 투성이입니다.\n\n많은 사람이 애플리케이션을 만들고 자신들의 데이터 모델을 정의하기를 원합니다. 그래서 그 일들을 위해 Flux를 사용하기 원합니다. **이것은 Flux를 적용하는 나쁜 방법입니다. Flux는 오직 많은 컴포넌트가 만들어지고 난 뒤 한 번만 더해져야 합니다.**\n\nReact 컴포넌트는 계층적으로 정돈됩니다. 대부분의 경우에, 당신의 데이터 모델은 계층구조를 따릅니다. 이런 상황에서는 Flux가 당신에게 쓸모없습니다. 하지만 때때로 당신의 데이터 모델이 계층적이지 않을 수 있습니다. React 컴포넌트가 본 기능에 충실하지 않은 `props`를 받아야 하는 상황들이 시작된다거나, 작은 컴포넌트들이 매우 복작하게 엉키기 시작한다면 Flux를 고려할 시간입니다.\n\n**당신이 Flux가 필요할때 알게 될 것입니다. 만약 당신이 확실한 필요성이 느껴지지 않는 상태면 사용할 필요 없습니다..**\n\nFlux를 사용하기로 했다면 가장 유명하고 잘 문서화 되어 있는 Flux 라이브러리는 [Redux](http://redux.js.org/)입니다. 대체할 만한 것들은 *많고* 일일이 평가해보고 싶은 생각이 드시겠지만, 제 충고는 일단 가장 유명한 것을 사용해 보는 것입니다.\n\n## 인라인 스타일 배우기\n\nReact가 생겨나기 전에, 많은 사람은 CSS 스타일들을 SASS같은 전처리기로 만들어진 복잡한 스타일 시트와 함께 재사용했습니다. React가 재사용 가능한 컴포넌트를 쉽게 만들 수 있게 한 이후로, 스타일 시트는 다소 복잡함이 줄어들 수 있게 되었습니다. 커뮤니티의 다수(나를 포함해서)들은 스타일시트를 완전히 제거하는 실험들을 하고 있습니다.\n\n이것은 여러 가지 이유를 고려하면 상당히 미친 아이디어 입니다. 이렇게 하면 미디어쿼리가 더 어려워지고 이런 기술을 사용하는 데에는 성능의 한계가 있을 수도 있습니다. **React를 시작할 때에는 style 관련된 것들은 하던데로 진행하십시오**\n\nReact가 어떻게 동작하는지 감이 오고 나면 대체 가능한 기술들을 찾아보게 될 것입니다. 그중 유명한 녀석이 [BEM](https://en.bem.info/)입니다. 단계적으로 CSS 전처리기를 폐지하기를 추천합니다. 왜냐하면, React는 당신에게 스타일들을 재사용할 수 있는 강력한 방법들을 (컴포넌트를 재사용하면서) 제공하기 때문이고 Javascript 번들러는 더 효과적인 방법으로 스타일 시트들을 만들어내기 때문입니다. ( [OSCON에서 제가 한 발표](https://www.youtube.com/watch?v=VkTCL6Nqm6Y) 를 공유합니다.) 보시면 아시겠지만 다른 Javascript 라이브러리와 마찬가지로 CSS 전처리기와 궁합이 좋습니다.\n\n대안으로 [CSS Modules](http://glenmaddern.com/articles/css-modules) 을 사용할 수도 있고, 조금 더 자세하게는 [react-css-modules](https://github.com/gajus/react-css-modules) 를 살펴볼 수도 있습니다. CSS 모듈들과 함께 여전히 CSS (or SASS/LESS/Stylus)를 작성할 수 있지만 React 안의 인라인 스타일로 CSS 파일을 구성할 수 있습니다.  BEM 같은 방법론을 사용한다면 class name을 관리하는 것을 걱정할 필요도 없습니다. 이것은 모듈 시스템안에서 다뤄지기 때문입니다.\n\n## 서버 렌더링 배우기\n\n서버 렌더링은 종종 \"유니버설\" 혹은 \"동형\" 자바스크립트로 불립니다. 이것이 의미하는 바는 React 컴포넌트를 사용해 static HTML을 서버에서 그릴 수 있다는 이야기 입니다. 이렇게 하면 첫화면 UI를 보기위해 JS 파일을 다운받는 시간이 절약되고 React는 서버에서 렌더링한 HTML을 재사용해 클라이언트에서 페이지를 만들 필요가 없기 때문에 페이지 초기 진입 과정의 성능을 개선시켜줍니다.\n\n만약 초기 렌더링 속도가 너무 느리다거나 서치엔진의 순위를 개선하고 싶다면 서버 렌더링이 필요합니다. 구글이 클라이언트 렌더링 콘텐츠에 대해 index를 만드는 것은 사실이지만, 2016년 1월까지는 클라이언트 렌더링의 성능에 대한 패널티 때문에 잠재적으로 검색 순위에 부정적인 영향을 미치는 것으로 측정되었습니다.\n\n서버 렌더링은 제대로 하기 위해서는 아직은 많은 세팅을 필요로 합니다. 서버 렌더링을 염두에 두지 않고 React 컴포넌트는 작성되었기 때문에(투명하게 지원하지만), 일단 애플리케이션을 만들고 서버 렌더링은 이후에 생각해야 합니다. 서버 렌더링을 지원하기 위해 모든 컴포넌트를 새로 짤 필요는 없을 것입니다.\n\n## Immutable.js 배우기\n\n[Immutable.js](https://facebook.github.io/immutable-js/) 는 React 앱을 만들때 발생하는 특정한 성능 이슈를 해결하는 데 도움을 주는 데이터 구조체들의 집합을 제공합니다. 이 훌륭한 라이브러리를 앞으로 많이 사용하게 될것입니다. 하지만 당신이 성능에 미치는 영향의 진가를 알아볼 때까지는 완전히 불필요할 것입니다.\n\n## Relay, Falcor 등등\n\n이 기술들은 AJAX 요청들을 줄여주는 도움을 줄 것입니다. 아직 그것들은 최신 기술에 속하므로 너무 많은 AJAX 요청 때문에 문제가 되는 일이 아니라면 Relay나 Falcor 등은 필요 없습니다.",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": "https://github.com/petehunt/react-howto/blob/master/README-ko.md"
    },
    {
      "id": 13,
      "title": "React",
      "subTitle": "A declarative, efficient, and flexible JavaScript library for building user interfaces.",
      "image": "https://source.unsplash.com/m_HRfLhgABo",
      "content": "# [React](https://reactjs.org/) &middot; [![GitHub license](https://img.shields.io/badge/license-MIT-blue.svg)](https://github.com/facebook/react/blob/master/LICENSE) [![npm version](https://img.shields.io/npm/v/react.svg?style=flat)](https://www.npmjs.com/package/react) [![CircleCI Status](https://circleci.com/gh/facebook/react.svg?style=shield&circle-token=:circle-token)](https://circleci.com/gh/facebook/react) [![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg)](https://reactjs.org/docs/how-to-contribute.html#your-first-pull-request)\n\nReact is a JavaScript library for building user interfaces.\n\n* **Declarative:** React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable, simpler to understand, and easier to debug.\n* **Component-Based:** Build encapsulated components that manage their own state, then compose them to make complex UIs. Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM.\n* **Learn Once, Write Anywhere:** We don't make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code. React can also render on the server using Node and power mobile apps using [React Native](https://facebook.github.io/react-native/).\n\n[Learn how to use React in your own project](https://reactjs.org/docs/getting-started.html).\n\n## Installation\n\nReact has been designed for gradual adoption from the start, and **you can use as little or as much React as you need**:\n\n* Use [Online Playgrounds](https://reactjs.org/docs/getting-started.html#online-playgrounds) to get a taste of React.\n* [Add React to a Website](https://reactjs.org/docs/add-react-to-a-website.html) as a `<script>` tag in one minute.\n* [Create a New React App](https://reactjs.org/docs/create-a-new-react-app.html) if you're looking for a powerful JavaScript toolchain.\n\nYou can use React as a `<script>` tag from a [CDN](https://reactjs.org/docs/cdn-links.html), or as a `react` package on [npm](https://www.npmjs.com/).\n\n## Documentation\n\nYou can find the React documentation [on the website](https://reactjs.org/docs).  \n\nCheck out the [Getting Started](https://reactjs.org/docs/getting-started.html) page for a quick overview.\n\nThe documentation is divided into several sections:\n\n* [Tutorial](https://reactjs.org/tutorial/tutorial.html)\n* [Main Concepts](https://reactjs.org/docs/hello-world.html)\n* [Advanced Guides](https://reactjs.org/docs/jsx-in-depth.html)\n* [API Reference](https://reactjs.org/docs/react-api.html)\n* [Where to Get Support](https://reactjs.org/community/support.html)\n* [Contributing Guide](https://reactjs.org/docs/how-to-contribute.html)\n\nYou can improve it by sending pull requests to [this repository](https://github.com/reactjs/reactjs.org).\n\n## Examples\n\nWe have several examples [on the website](https://reactjs.org/). Here is the first one to get you started:\n\n```jsx\nfunction HelloMessage({ name }) {\n  return <div>Hello {name}</div>;\n}\n\nReactDOM.render(\n  <HelloMessage name=\"Taylor\" />,\n  document.getElementById('container')\n);\n```\n\nThis example will render \"Hello Taylor\" into a container on the page.\n\nYou'll notice that we used an HTML-like syntax; [we call it JSX](https://reactjs.org/docs/introducing-jsx.html). JSX is not required to use React, but it makes code more readable, and writing it feels like writing HTML. If you're using React as a `<script>` tag, read [this section](https://reactjs.org/docs/add-react-to-a-website.html#optional-try-react-with-jsx) on integrating JSX; otherwise, the [recommended JavaScript toolchains](https://reactjs.org/docs/create-a-new-react-app.html) handle it automatically.\n\n## Contributing\n\nThe main purpose of this repository is to continue to evolve React core, making it faster and easier to use. Development of React happens in the open on GitHub, and we are grateful to the community for contributing bugfixes and improvements. Read below to learn how you can take part in improving React.\n\n### [Code of Conduct](https://code.fb.com/codeofconduct)\n\nFacebook has adopted a Code of Conduct that we expect project participants to adhere to. Please read [the full text](https://code.fb.com/codeofconduct) so that you can understand what actions will and will not be tolerated.\n\n### [Contributing Guide](https://reactjs.org/contributing/how-to-contribute.html)\n\nRead our [contributing guide](https://reactjs.org/contributing/how-to-contribute.html) to learn about our development process, how to propose bugfixes and improvements, and how to build and test your changes to React.\n\n### Good First Issues\n\nTo help you get your feet wet and get you familiar with our contribution process, we have a list of [good first issues](https://github.com/facebook/react/labels/good%20first%20issue) that contain bugs which have a relatively limited scope. This is a great place to get started.\n\n### License\n\nReact is [MIT licensed](./LICENSE).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 12,
      "title": "TypeScript",
      "subTitle": "TypeScript is a superset of JavaScript that compiles to clean JavaScript output.",
      "image": "https://source.unsplash.com/2FPjlAyMQTA",
      "content": "\n# TypeScript\n\n[![Build Status](https://travis-ci.org/microsoft/TypeScript.svg?branch=master)](https://travis-ci.org/microsoft/TypeScript)\n[![VSTS Build Status](https://dev.azure.com/typescript/TypeScript/_apis/build/status/Typescript/node10)](https://dev.azure.com/typescript/TypeScript/_build/latest?definitionId=4&view=logs)\n[![npm version](https://badge.fury.io/js/typescript.svg)](https://www.npmjs.com/package/typescript)\n[![Downloads](https://img.shields.io/npm/dm/typescript.svg)](https://www.npmjs.com/package/typescript)\n\n[TypeScript](https://www.typescriptlang.org/) is a language for application-scale JavaScript. TypeScript adds optional types to JavaScript that support tools for large-scale JavaScript applications for any browser, for any host, on any OS. TypeScript compiles to readable, standards-based JavaScript. Try it out at the [playground](https://www.typescriptlang.org/play/), and stay up to date via [our blog](https://blogs.msdn.microsoft.com/typescript) and [Twitter account](https://twitter.com/typescript).\n\nFind others who are using TypeScript at [our community page](https://www.typescriptlang.org/community/).\n\n## Installing\n\nFor the latest stable version:\n\n```bash\nnpm install -g typescript\n```\n\nFor our nightly builds:\n\n```bash\nnpm install -g typescript@next\n```\n\n## Contribute\n\nThere are many ways to [contribute](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md) to TypeScript.\n* [Submit bugs](https://github.com/microsoft/TypeScript/issues) and help us verify fixes as they are checked in.\n* Review the [source code changes](https://github.com/microsoft/TypeScript/pulls).\n* Engage with other TypeScript users and developers on [StackOverflow](https://stackoverflow.com/questions/tagged/typescript).\n* Help each other in the [TypeScript Community Discord](https://discord.gg/typescript).\n* Join the [#typescript](https://twitter.com/search?q=%23TypeScript) discussion on Twitter.\n* [Contribute bug fixes](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md).\n* Read the language specification ([docx](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.docx?raw=true),\n [pdf](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.pdf?raw=true), [md](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)).\n\nThis project has adopted the [Microsoft Open Source Code of Conduct](https://opensource.microsoft.com/codeofconduct/). For more information see\nthe [Code of Conduct FAQ](https://opensource.microsoft.com/codeofconduct/faq/) or contact [opencode@microsoft.com](mailto:opencode@microsoft.com)\nwith any additional questions or comments.\n\n## Documentation\n\n*  [TypeScript in 5 minutes](https://www.typescriptlang.org/docs/handbook/typescript-in-5-minutes.html)\n*  [Programming handbook](https://www.typescriptlang.org/docs/handbook/basic-types.html)\n*  [Language specification](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)\n*  [Homepage](https://www.typescriptlang.org/)\n\n## Building\n\nIn order to build the TypeScript compiler, ensure that you have [Git](https://git-scm.com/downloads) and [Node.js](https://nodejs.org/) installed.\n\nClone a copy of the repo:\n\n```bash\ngit clone https://github.com/microsoft/TypeScript.git\n```\n\nChange to the TypeScript directory:\n\n```bash\ncd TypeScript\n```\n\nInstall [Gulp](https://gulpjs.com/) tools and dev dependencies:\n\n```bash\nnpm install -g gulp\nnpm install\n```\n\nUse one of the following to build and test:\n\n```\ngulp local             # Build the compiler into built/local.\ngulp clean             # Delete the built compiler.\ngulp LKG               # Replace the last known good with the built one.\n                       # Bootstrapping step to be executed when the built compiler reaches a stable state.\ngulp tests             # Build the test infrastructure using the built compiler.\ngulp runtests          # Run tests using the built compiler and test infrastructure.\n                       # Some low-value tests are skipped when not on a CI machine - you can use the\n                       # --skipPercent=0 command to override this behavior and run all tests locally.\n                       # You can override the specific suite runner used or specify a test for this command.\n                       # Use --tests=<testPath> for a specific test and/or --runner=<runnerName> for a specific suite.\n                       # Valid runners include conformance, compiler, fourslash, project, user, and docker\n                       # The user and docker runners are extended test suite runners - the user runner\n                       # works on disk in the tests/cases/user directory, while the docker runner works in containers.\n                       # You'll need to have the docker executable in your system path for the docker runner to work.\ngulp runtests-parallel # Like runtests, but split across multiple threads. Uses a number of threads equal to the system\n                       # core count by default. Use --workers=<number> to adjust this.\ngulp baseline-accept   # This replaces the baseline test results with the results obtained from gulp runtests.\ngulp lint              # Runs eslint on the TypeScript source.\ngulp help              # List the above commands.\n```\n\n\n## Usage\n\n```bash\nnode built/local/tsc.js hello.ts\n```\n\n\n## Roadmap\n\nFor details on our planned features and future direction please refer to our [roadmap](https://github.com/microsoft/TypeScript/wiki/Roadmap).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 11,
      "title": "React",
      "subTitle": "A declarative, efficient, and flexible JavaScript library for building user interfaces.",
      "image": "https://source.unsplash.com/OqtafYT5kTw",
      "content": "# [React](https://reactjs.org/) &middot; [![GitHub license](https://img.shields.io/badge/license-MIT-blue.svg)](https://github.com/facebook/react/blob/master/LICENSE) [![npm version](https://img.shields.io/npm/v/react.svg?style=flat)](https://www.npmjs.com/package/react) [![CircleCI Status](https://circleci.com/gh/facebook/react.svg?style=shield&circle-token=:circle-token)](https://circleci.com/gh/facebook/react) [![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg)](https://reactjs.org/docs/how-to-contribute.html#your-first-pull-request)\n\nReact is a JavaScript library for building user interfaces.\n\n* **Declarative:** React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable, simpler to understand, and easier to debug.\n* **Component-Based:** Build encapsulated components that manage their own state, then compose them to make complex UIs. Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM.\n* **Learn Once, Write Anywhere:** We don't make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code. React can also render on the server using Node and power mobile apps using [React Native](https://facebook.github.io/react-native/).\n\n[Learn how to use React in your own project](https://reactjs.org/docs/getting-started.html).\n\n## Installation\n\nReact has been designed for gradual adoption from the start, and **you can use as little or as much React as you need**:\n\n* Use [Online Playgrounds](https://reactjs.org/docs/getting-started.html#online-playgrounds) to get a taste of React.\n* [Add React to a Website](https://reactjs.org/docs/add-react-to-a-website.html) as a `<script>` tag in one minute.\n* [Create a New React App](https://reactjs.org/docs/create-a-new-react-app.html) if you're looking for a powerful JavaScript toolchain.\n\nYou can use React as a `<script>` tag from a [CDN](https://reactjs.org/docs/cdn-links.html), or as a `react` package on [npm](https://www.npmjs.com/).\n\n## Documentation\n\nYou can find the React documentation [on the website](https://reactjs.org/docs).  \n\nCheck out the [Getting Started](https://reactjs.org/docs/getting-started.html) page for a quick overview.\n\nThe documentation is divided into several sections:\n\n* [Tutorial](https://reactjs.org/tutorial/tutorial.html)\n* [Main Concepts](https://reactjs.org/docs/hello-world.html)\n* [Advanced Guides](https://reactjs.org/docs/jsx-in-depth.html)\n* [API Reference](https://reactjs.org/docs/react-api.html)\n* [Where to Get Support](https://reactjs.org/community/support.html)\n* [Contributing Guide](https://reactjs.org/docs/how-to-contribute.html)\n\nYou can improve it by sending pull requests to [this repository](https://github.com/reactjs/reactjs.org).\n\n## Examples\n\nWe have several examples [on the website](https://reactjs.org/). Here is the first one to get you started:\n\n```jsx\nfunction HelloMessage({ name }) {\n  return <div>Hello {name}</div>;\n}\n\nReactDOM.render(\n  <HelloMessage name=\"Taylor\" />,\n  document.getElementById('container')\n);\n```\n\nThis example will render \"Hello Taylor\" into a container on the page.\n\nYou'll notice that we used an HTML-like syntax; [we call it JSX](https://reactjs.org/docs/introducing-jsx.html). JSX is not required to use React, but it makes code more readable, and writing it feels like writing HTML. If you're using React as a `<script>` tag, read [this section](https://reactjs.org/docs/add-react-to-a-website.html#optional-try-react-with-jsx) on integrating JSX; otherwise, the [recommended JavaScript toolchains](https://reactjs.org/docs/create-a-new-react-app.html) handle it automatically.\n\n## Contributing\n\nThe main purpose of this repository is to continue to evolve React core, making it faster and easier to use. Development of React happens in the open on GitHub, and we are grateful to the community for contributing bugfixes and improvements. Read below to learn how you can take part in improving React.\n\n### [Code of Conduct](https://code.fb.com/codeofconduct)\n\nFacebook has adopted a Code of Conduct that we expect project participants to adhere to. Please read [the full text](https://code.fb.com/codeofconduct) so that you can understand what actions will and will not be tolerated.\n\n### [Contributing Guide](https://reactjs.org/contributing/how-to-contribute.html)\n\nRead our [contributing guide](https://reactjs.org/contributing/how-to-contribute.html) to learn about our development process, how to propose bugfixes and improvements, and how to build and test your changes to React.\n\n### Good First Issues\n\nTo help you get your feet wet and get you familiar with our contribution process, we have a list of [good first issues](https://github.com/facebook/react/labels/good%20first%20issue) that contain bugs which have a relatively limited scope. This is a great place to get started.\n\n### License\n\nReact is [MIT licensed](./LICENSE).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 10,
      "title": "TypeScript",
      "subTitle": "TypeScript is a superset of JavaScript that compiles to clean JavaScript output.",
      "image": "https://source.unsplash.com/OVbeSXRk_9E",
      "content": "\n# TypeScript\n\n[![Build Status](https://travis-ci.org/microsoft/TypeScript.svg?branch=master)](https://travis-ci.org/microsoft/TypeScript)\n[![VSTS Build Status](https://dev.azure.com/typescript/TypeScript/_apis/build/status/Typescript/node10)](https://dev.azure.com/typescript/TypeScript/_build/latest?definitionId=4&view=logs)\n[![npm version](https://badge.fury.io/js/typescript.svg)](https://www.npmjs.com/package/typescript)\n[![Downloads](https://img.shields.io/npm/dm/typescript.svg)](https://www.npmjs.com/package/typescript)\n\n[TypeScript](https://www.typescriptlang.org/) is a language for application-scale JavaScript. TypeScript adds optional types to JavaScript that support tools for large-scale JavaScript applications for any browser, for any host, on any OS. TypeScript compiles to readable, standards-based JavaScript. Try it out at the [playground](https://www.typescriptlang.org/play/), and stay up to date via [our blog](https://blogs.msdn.microsoft.com/typescript) and [Twitter account](https://twitter.com/typescript).\n\nFind others who are using TypeScript at [our community page](https://www.typescriptlang.org/community/).\n\n## Installing\n\nFor the latest stable version:\n\n```bash\nnpm install -g typescript\n```\n\nFor our nightly builds:\n\n```bash\nnpm install -g typescript@next\n```\n\n## Contribute\n\nThere are many ways to [contribute](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md) to TypeScript.\n* [Submit bugs](https://github.com/microsoft/TypeScript/issues) and help us verify fixes as they are checked in.\n* Review the [source code changes](https://github.com/microsoft/TypeScript/pulls).\n* Engage with other TypeScript users and developers on [StackOverflow](https://stackoverflow.com/questions/tagged/typescript).\n* Help each other in the [TypeScript Community Discord](https://discord.gg/typescript).\n* Join the [#typescript](https://twitter.com/search?q=%23TypeScript) discussion on Twitter.\n* [Contribute bug fixes](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md).\n* Read the language specification ([docx](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.docx?raw=true),\n [pdf](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.pdf?raw=true), [md](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)).\n\nThis project has adopted the [Microsoft Open Source Code of Conduct](https://opensource.microsoft.com/codeofconduct/). For more information see\nthe [Code of Conduct FAQ](https://opensource.microsoft.com/codeofconduct/faq/) or contact [opencode@microsoft.com](mailto:opencode@microsoft.com)\nwith any additional questions or comments.\n\n## Documentation\n\n*  [TypeScript in 5 minutes](https://www.typescriptlang.org/docs/handbook/typescript-in-5-minutes.html)\n*  [Programming handbook](https://www.typescriptlang.org/docs/handbook/basic-types.html)\n*  [Language specification](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)\n*  [Homepage](https://www.typescriptlang.org/)\n\n## Building\n\nIn order to build the TypeScript compiler, ensure that you have [Git](https://git-scm.com/downloads) and [Node.js](https://nodejs.org/) installed.\n\nClone a copy of the repo:\n\n```bash\ngit clone https://github.com/microsoft/TypeScript.git\n```\n\nChange to the TypeScript directory:\n\n```bash\ncd TypeScript\n```\n\nInstall [Gulp](https://gulpjs.com/) tools and dev dependencies:\n\n```bash\nnpm install -g gulp\nnpm install\n```\n\nUse one of the following to build and test:\n\n```\ngulp local             # Build the compiler into built/local.\ngulp clean             # Delete the built compiler.\ngulp LKG               # Replace the last known good with the built one.\n                       # Bootstrapping step to be executed when the built compiler reaches a stable state.\ngulp tests             # Build the test infrastructure using the built compiler.\ngulp runtests          # Run tests using the built compiler and test infrastructure.\n                       # Some low-value tests are skipped when not on a CI machine - you can use the\n                       # --skipPercent=0 command to override this behavior and run all tests locally.\n                       # You can override the specific suite runner used or specify a test for this command.\n                       # Use --tests=<testPath> for a specific test and/or --runner=<runnerName> for a specific suite.\n                       # Valid runners include conformance, compiler, fourslash, project, user, and docker\n                       # The user and docker runners are extended test suite runners - the user runner\n                       # works on disk in the tests/cases/user directory, while the docker runner works in containers.\n                       # You'll need to have the docker executable in your system path for the docker runner to work.\ngulp runtests-parallel # Like runtests, but split across multiple threads. Uses a number of threads equal to the system\n                       # core count by default. Use --workers=<number> to adjust this.\ngulp baseline-accept   # This replaces the baseline test results with the results obtained from gulp runtests.\ngulp lint              # Runs eslint on the TypeScript source.\ngulp help              # List the above commands.\n```\n\n\n## Usage\n\n```bash\nnode built/local/tsc.js hello.ts\n```\n\n\n## Roadmap\n\nFor details on our planned features and future direction please refer to our [roadmap](https://github.com/microsoft/TypeScript/wiki/Roadmap).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 9,
      "title": "React",
      "subTitle": "A declarative, efficient, and flexible JavaScript library for building user interfaces.",
      "image": "https://source.unsplash.com/iIJrUoeRoCQ",
      "content": "# [React](https://reactjs.org/) &middot; [![GitHub license](https://img.shields.io/badge/license-MIT-blue.svg)](https://github.com/facebook/react/blob/master/LICENSE) [![npm version](https://img.shields.io/npm/v/react.svg?style=flat)](https://www.npmjs.com/package/react) [![CircleCI Status](https://circleci.com/gh/facebook/react.svg?style=shield&circle-token=:circle-token)](https://circleci.com/gh/facebook/react) [![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg)](https://reactjs.org/docs/how-to-contribute.html#your-first-pull-request)\n\nReact is a JavaScript library for building user interfaces.\n\n* **Declarative:** React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable, simpler to understand, and easier to debug.\n* **Component-Based:** Build encapsulated components that manage their own state, then compose them to make complex UIs. Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM.\n* **Learn Once, Write Anywhere:** We don't make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code. React can also render on the server using Node and power mobile apps using [React Native](https://facebook.github.io/react-native/).\n\n[Learn how to use React in your own project](https://reactjs.org/docs/getting-started.html).\n\n## Installation\n\nReact has been designed for gradual adoption from the start, and **you can use as little or as much React as you need**:\n\n* Use [Online Playgrounds](https://reactjs.org/docs/getting-started.html#online-playgrounds) to get a taste of React.\n* [Add React to a Website](https://reactjs.org/docs/add-react-to-a-website.html) as a `<script>` tag in one minute.\n* [Create a New React App](https://reactjs.org/docs/create-a-new-react-app.html) if you're looking for a powerful JavaScript toolchain.\n\nYou can use React as a `<script>` tag from a [CDN](https://reactjs.org/docs/cdn-links.html), or as a `react` package on [npm](https://www.npmjs.com/).\n\n## Documentation\n\nYou can find the React documentation [on the website](https://reactjs.org/docs).  \n\nCheck out the [Getting Started](https://reactjs.org/docs/getting-started.html) page for a quick overview.\n\nThe documentation is divided into several sections:\n\n* [Tutorial](https://reactjs.org/tutorial/tutorial.html)\n* [Main Concepts](https://reactjs.org/docs/hello-world.html)\n* [Advanced Guides](https://reactjs.org/docs/jsx-in-depth.html)\n* [API Reference](https://reactjs.org/docs/react-api.html)\n* [Where to Get Support](https://reactjs.org/community/support.html)\n* [Contributing Guide](https://reactjs.org/docs/how-to-contribute.html)\n\nYou can improve it by sending pull requests to [this repository](https://github.com/reactjs/reactjs.org).\n\n## Examples\n\nWe have several examples [on the website](https://reactjs.org/). Here is the first one to get you started:\n\n```jsx\nfunction HelloMessage({ name }) {\n  return <div>Hello {name}</div>;\n}\n\nReactDOM.render(\n  <HelloMessage name=\"Taylor\" />,\n  document.getElementById('container')\n);\n```\n\nThis example will render \"Hello Taylor\" into a container on the page.\n\nYou'll notice that we used an HTML-like syntax; [we call it JSX](https://reactjs.org/docs/introducing-jsx.html). JSX is not required to use React, but it makes code more readable, and writing it feels like writing HTML. If you're using React as a `<script>` tag, read [this section](https://reactjs.org/docs/add-react-to-a-website.html#optional-try-react-with-jsx) on integrating JSX; otherwise, the [recommended JavaScript toolchains](https://reactjs.org/docs/create-a-new-react-app.html) handle it automatically.\n\n## Contributing\n\nThe main purpose of this repository is to continue to evolve React core, making it faster and easier to use. Development of React happens in the open on GitHub, and we are grateful to the community for contributing bugfixes and improvements. Read below to learn how you can take part in improving React.\n\n### [Code of Conduct](https://code.fb.com/codeofconduct)\n\nFacebook has adopted a Code of Conduct that we expect project participants to adhere to. Please read [the full text](https://code.fb.com/codeofconduct) so that you can understand what actions will and will not be tolerated.\n\n### [Contributing Guide](https://reactjs.org/contributing/how-to-contribute.html)\n\nRead our [contributing guide](https://reactjs.org/contributing/how-to-contribute.html) to learn about our development process, how to propose bugfixes and improvements, and how to build and test your changes to React.\n\n### Good First Issues\n\nTo help you get your feet wet and get you familiar with our contribution process, we have a list of [good first issues](https://github.com/facebook/react/labels/good%20first%20issue) that contain bugs which have a relatively limited scope. This is a great place to get started.\n\n### License\n\nReact is [MIT licensed](./LICENSE).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 8,
      "title": "TypeScript",
      "subTitle": "TypeScript is a superset of JavaScript that compiles to clean JavaScript output.",
      "image": "https://source.unsplash.com/jiVeo0i1EB4",
      "content": "\n# TypeScript\n\n[![Build Status](https://travis-ci.org/microsoft/TypeScript.svg?branch=master)](https://travis-ci.org/microsoft/TypeScript)\n[![VSTS Build Status](https://dev.azure.com/typescript/TypeScript/_apis/build/status/Typescript/node10)](https://dev.azure.com/typescript/TypeScript/_build/latest?definitionId=4&view=logs)\n[![npm version](https://badge.fury.io/js/typescript.svg)](https://www.npmjs.com/package/typescript)\n[![Downloads](https://img.shields.io/npm/dm/typescript.svg)](https://www.npmjs.com/package/typescript)\n\n[TypeScript](https://www.typescriptlang.org/) is a language for application-scale JavaScript. TypeScript adds optional types to JavaScript that support tools for large-scale JavaScript applications for any browser, for any host, on any OS. TypeScript compiles to readable, standards-based JavaScript. Try it out at the [playground](https://www.typescriptlang.org/play/), and stay up to date via [our blog](https://blogs.msdn.microsoft.com/typescript) and [Twitter account](https://twitter.com/typescript).\n\nFind others who are using TypeScript at [our community page](https://www.typescriptlang.org/community/).\n\n## Installing\n\nFor the latest stable version:\n\n```bash\nnpm install -g typescript\n```\n\nFor our nightly builds:\n\n```bash\nnpm install -g typescript@next\n```\n\n## Contribute\n\nThere are many ways to [contribute](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md) to TypeScript.\n* [Submit bugs](https://github.com/microsoft/TypeScript/issues) and help us verify fixes as they are checked in.\n* Review the [source code changes](https://github.com/microsoft/TypeScript/pulls).\n* Engage with other TypeScript users and developers on [StackOverflow](https://stackoverflow.com/questions/tagged/typescript).\n* Help each other in the [TypeScript Community Discord](https://discord.gg/typescript).\n* Join the [#typescript](https://twitter.com/search?q=%23TypeScript) discussion on Twitter.\n* [Contribute bug fixes](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md).\n* Read the language specification ([docx](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.docx?raw=true),\n [pdf](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.pdf?raw=true), [md](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)).\n\nThis project has adopted the [Microsoft Open Source Code of Conduct](https://opensource.microsoft.com/codeofconduct/). For more information see\nthe [Code of Conduct FAQ](https://opensource.microsoft.com/codeofconduct/faq/) or contact [opencode@microsoft.com](mailto:opencode@microsoft.com)\nwith any additional questions or comments.\n\n## Documentation\n\n*  [TypeScript in 5 minutes](https://www.typescriptlang.org/docs/handbook/typescript-in-5-minutes.html)\n*  [Programming handbook](https://www.typescriptlang.org/docs/handbook/basic-types.html)\n*  [Language specification](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)\n*  [Homepage](https://www.typescriptlang.org/)\n\n## Building\n\nIn order to build the TypeScript compiler, ensure that you have [Git](https://git-scm.com/downloads) and [Node.js](https://nodejs.org/) installed.\n\nClone a copy of the repo:\n\n```bash\ngit clone https://github.com/microsoft/TypeScript.git\n```\n\nChange to the TypeScript directory:\n\n```bash\ncd TypeScript\n```\n\nInstall [Gulp](https://gulpjs.com/) tools and dev dependencies:\n\n```bash\nnpm install -g gulp\nnpm install\n```\n\nUse one of the following to build and test:\n\n```\ngulp local             # Build the compiler into built/local.\ngulp clean             # Delete the built compiler.\ngulp LKG               # Replace the last known good with the built one.\n                       # Bootstrapping step to be executed when the built compiler reaches a stable state.\ngulp tests             # Build the test infrastructure using the built compiler.\ngulp runtests          # Run tests using the built compiler and test infrastructure.\n                       # Some low-value tests are skipped when not on a CI machine - you can use the\n                       # --skipPercent=0 command to override this behavior and run all tests locally.\n                       # You can override the specific suite runner used or specify a test for this command.\n                       # Use --tests=<testPath> for a specific test and/or --runner=<runnerName> for a specific suite.\n                       # Valid runners include conformance, compiler, fourslash, project, user, and docker\n                       # The user and docker runners are extended test suite runners - the user runner\n                       # works on disk in the tests/cases/user directory, while the docker runner works in containers.\n                       # You'll need to have the docker executable in your system path for the docker runner to work.\ngulp runtests-parallel # Like runtests, but split across multiple threads. Uses a number of threads equal to the system\n                       # core count by default. Use --workers=<number> to adjust this.\ngulp baseline-accept   # This replaces the baseline test results with the results obtained from gulp runtests.\ngulp lint              # Runs eslint on the TypeScript source.\ngulp help              # List the above commands.\n```\n\n\n## Usage\n\n```bash\nnode built/local/tsc.js hello.ts\n```\n\n\n## Roadmap\n\nFor details on our planned features and future direction please refer to our [roadmap](https://github.com/microsoft/TypeScript/wiki/Roadmap).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 7,
      "title": "React",
      "subTitle": "A declarative, efficient, and flexible JavaScript library for building user interfaces.",
      "image": "https://source.unsplash.com/vZJdYl5JVXY",
      "content": "# [React](https://reactjs.org/) &middot; [![GitHub license](https://img.shields.io/badge/license-MIT-blue.svg)](https://github.com/facebook/react/blob/master/LICENSE) [![npm version](https://img.shields.io/npm/v/react.svg?style=flat)](https://www.npmjs.com/package/react) [![CircleCI Status](https://circleci.com/gh/facebook/react.svg?style=shield&circle-token=:circle-token)](https://circleci.com/gh/facebook/react) [![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg)](https://reactjs.org/docs/how-to-contribute.html#your-first-pull-request)\n\nReact is a JavaScript library for building user interfaces.\n\n* **Declarative:** React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable, simpler to understand, and easier to debug.\n* **Component-Based:** Build encapsulated components that manage their own state, then compose them to make complex UIs. Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM.\n* **Learn Once, Write Anywhere:** We don't make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code. React can also render on the server using Node and power mobile apps using [React Native](https://facebook.github.io/react-native/).\n\n[Learn how to use React in your own project](https://reactjs.org/docs/getting-started.html).\n\n## Installation\n\nReact has been designed for gradual adoption from the start, and **you can use as little or as much React as you need**:\n\n* Use [Online Playgrounds](https://reactjs.org/docs/getting-started.html#online-playgrounds) to get a taste of React.\n* [Add React to a Website](https://reactjs.org/docs/add-react-to-a-website.html) as a `<script>` tag in one minute.\n* [Create a New React App](https://reactjs.org/docs/create-a-new-react-app.html) if you're looking for a powerful JavaScript toolchain.\n\nYou can use React as a `<script>` tag from a [CDN](https://reactjs.org/docs/cdn-links.html), or as a `react` package on [npm](https://www.npmjs.com/).\n\n## Documentation\n\nYou can find the React documentation [on the website](https://reactjs.org/docs).  \n\nCheck out the [Getting Started](https://reactjs.org/docs/getting-started.html) page for a quick overview.\n\nThe documentation is divided into several sections:\n\n* [Tutorial](https://reactjs.org/tutorial/tutorial.html)\n* [Main Concepts](https://reactjs.org/docs/hello-world.html)\n* [Advanced Guides](https://reactjs.org/docs/jsx-in-depth.html)\n* [API Reference](https://reactjs.org/docs/react-api.html)\n* [Where to Get Support](https://reactjs.org/community/support.html)\n* [Contributing Guide](https://reactjs.org/docs/how-to-contribute.html)\n\nYou can improve it by sending pull requests to [this repository](https://github.com/reactjs/reactjs.org).\n\n## Examples\n\nWe have several examples [on the website](https://reactjs.org/). Here is the first one to get you started:\n\n```jsx\nfunction HelloMessage({ name }) {\n  return <div>Hello {name}</div>;\n}\n\nReactDOM.render(\n  <HelloMessage name=\"Taylor\" />,\n  document.getElementById('container')\n);\n```\n\nThis example will render \"Hello Taylor\" into a container on the page.\n\nYou'll notice that we used an HTML-like syntax; [we call it JSX](https://reactjs.org/docs/introducing-jsx.html). JSX is not required to use React, but it makes code more readable, and writing it feels like writing HTML. If you're using React as a `<script>` tag, read [this section](https://reactjs.org/docs/add-react-to-a-website.html#optional-try-react-with-jsx) on integrating JSX; otherwise, the [recommended JavaScript toolchains](https://reactjs.org/docs/create-a-new-react-app.html) handle it automatically.\n\n## Contributing\n\nThe main purpose of this repository is to continue to evolve React core, making it faster and easier to use. Development of React happens in the open on GitHub, and we are grateful to the community for contributing bugfixes and improvements. Read below to learn how you can take part in improving React.\n\n### [Code of Conduct](https://code.fb.com/codeofconduct)\n\nFacebook has adopted a Code of Conduct that we expect project participants to adhere to. Please read [the full text](https://code.fb.com/codeofconduct) so that you can understand what actions will and will not be tolerated.\n\n### [Contributing Guide](https://reactjs.org/contributing/how-to-contribute.html)\n\nRead our [contributing guide](https://reactjs.org/contributing/how-to-contribute.html) to learn about our development process, how to propose bugfixes and improvements, and how to build and test your changes to React.\n\n### Good First Issues\n\nTo help you get your feet wet and get you familiar with our contribution process, we have a list of [good first issues](https://github.com/facebook/react/labels/good%20first%20issue) that contain bugs which have a relatively limited scope. This is a great place to get started.\n\n### License\n\nReact is [MIT licensed](./LICENSE).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 6,
      "title": "TypeScript",
      "subTitle": "TypeScript is a superset of JavaScript that compiles to clean JavaScript output.",
      "image": "https://source.unsplash.com/k_T9Zj3SE8k",
      "content": "\n# TypeScript\n\n[![Build Status](https://travis-ci.org/microsoft/TypeScript.svg?branch=master)](https://travis-ci.org/microsoft/TypeScript)\n[![VSTS Build Status](https://dev.azure.com/typescript/TypeScript/_apis/build/status/Typescript/node10)](https://dev.azure.com/typescript/TypeScript/_build/latest?definitionId=4&view=logs)\n[![npm version](https://badge.fury.io/js/typescript.svg)](https://www.npmjs.com/package/typescript)\n[![Downloads](https://img.shields.io/npm/dm/typescript.svg)](https://www.npmjs.com/package/typescript)\n\n[TypeScript](https://www.typescriptlang.org/) is a language for application-scale JavaScript. TypeScript adds optional types to JavaScript that support tools for large-scale JavaScript applications for any browser, for any host, on any OS. TypeScript compiles to readable, standards-based JavaScript. Try it out at the [playground](https://www.typescriptlang.org/play/), and stay up to date via [our blog](https://blogs.msdn.microsoft.com/typescript) and [Twitter account](https://twitter.com/typescript).\n\nFind others who are using TypeScript at [our community page](https://www.typescriptlang.org/community/).\n\n## Installing\n\nFor the latest stable version:\n\n```bash\nnpm install -g typescript\n```\n\nFor our nightly builds:\n\n```bash\nnpm install -g typescript@next\n```\n\n## Contribute\n\nThere are many ways to [contribute](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md) to TypeScript.\n* [Submit bugs](https://github.com/microsoft/TypeScript/issues) and help us verify fixes as they are checked in.\n* Review the [source code changes](https://github.com/microsoft/TypeScript/pulls).\n* Engage with other TypeScript users and developers on [StackOverflow](https://stackoverflow.com/questions/tagged/typescript).\n* Help each other in the [TypeScript Community Discord](https://discord.gg/typescript).\n* Join the [#typescript](https://twitter.com/search?q=%23TypeScript) discussion on Twitter.\n* [Contribute bug fixes](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md).\n* Read the language specification ([docx](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.docx?raw=true),\n [pdf](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.pdf?raw=true), [md](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)).\n\nThis project has adopted the [Microsoft Open Source Code of Conduct](https://opensource.microsoft.com/codeofconduct/). For more information see\nthe [Code of Conduct FAQ](https://opensource.microsoft.com/codeofconduct/faq/) or contact [opencode@microsoft.com](mailto:opencode@microsoft.com)\nwith any additional questions or comments.\n\n## Documentation\n\n*  [TypeScript in 5 minutes](https://www.typescriptlang.org/docs/handbook/typescript-in-5-minutes.html)\n*  [Programming handbook](https://www.typescriptlang.org/docs/handbook/basic-types.html)\n*  [Language specification](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)\n*  [Homepage](https://www.typescriptlang.org/)\n\n## Building\n\nIn order to build the TypeScript compiler, ensure that you have [Git](https://git-scm.com/downloads) and [Node.js](https://nodejs.org/) installed.\n\nClone a copy of the repo:\n\n```bash\ngit clone https://github.com/microsoft/TypeScript.git\n```\n\nChange to the TypeScript directory:\n\n```bash\ncd TypeScript\n```\n\nInstall [Gulp](https://gulpjs.com/) tools and dev dependencies:\n\n```bash\nnpm install -g gulp\nnpm install\n```\n\nUse one of the following to build and test:\n\n```\ngulp local             # Build the compiler into built/local.\ngulp clean             # Delete the built compiler.\ngulp LKG               # Replace the last known good with the built one.\n                       # Bootstrapping step to be executed when the built compiler reaches a stable state.\ngulp tests             # Build the test infrastructure using the built compiler.\ngulp runtests          # Run tests using the built compiler and test infrastructure.\n                       # Some low-value tests are skipped when not on a CI machine - you can use the\n                       # --skipPercent=0 command to override this behavior and run all tests locally.\n                       # You can override the specific suite runner used or specify a test for this command.\n                       # Use --tests=<testPath> for a specific test and/or --runner=<runnerName> for a specific suite.\n                       # Valid runners include conformance, compiler, fourslash, project, user, and docker\n                       # The user and docker runners are extended test suite runners - the user runner\n                       # works on disk in the tests/cases/user directory, while the docker runner works in containers.\n                       # You'll need to have the docker executable in your system path for the docker runner to work.\ngulp runtests-parallel # Like runtests, but split across multiple threads. Uses a number of threads equal to the system\n                       # core count by default. Use --workers=<number> to adjust this.\ngulp baseline-accept   # This replaces the baseline test results with the results obtained from gulp runtests.\ngulp lint              # Runs eslint on the TypeScript source.\ngulp help              # List the above commands.\n```\n\n\n## Usage\n\n```bash\nnode built/local/tsc.js hello.ts\n```\n\n\n## Roadmap\n\nFor details on our planned features and future direction please refer to our [roadmap](https://github.com/microsoft/TypeScript/wiki/Roadmap).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 5,
      "title": "React",
      "subTitle": "A declarative, efficient, and flexible JavaScript library for building user interfaces.",
      "image": "https://source.unsplash.com/tMI2_-r5Nfo",
      "content": "# [React](https://reactjs.org/) &middot; [![GitHub license](https://img.shields.io/badge/license-MIT-blue.svg)](https://github.com/facebook/react/blob/master/LICENSE) [![npm version](https://img.shields.io/npm/v/react.svg?style=flat)](https://www.npmjs.com/package/react) [![CircleCI Status](https://circleci.com/gh/facebook/react.svg?style=shield&circle-token=:circle-token)](https://circleci.com/gh/facebook/react) [![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg)](https://reactjs.org/docs/how-to-contribute.html#your-first-pull-request)\n\nReact is a JavaScript library for building user interfaces.\n\n* **Declarative:** React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable, simpler to understand, and easier to debug.\n* **Component-Based:** Build encapsulated components that manage their own state, then compose them to make complex UIs. Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM.\n* **Learn Once, Write Anywhere:** We don't make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code. React can also render on the server using Node and power mobile apps using [React Native](https://facebook.github.io/react-native/).\n\n[Learn how to use React in your own project](https://reactjs.org/docs/getting-started.html).\n\n## Installation\n\nReact has been designed for gradual adoption from the start, and **you can use as little or as much React as you need**:\n\n* Use [Online Playgrounds](https://reactjs.org/docs/getting-started.html#online-playgrounds) to get a taste of React.\n* [Add React to a Website](https://reactjs.org/docs/add-react-to-a-website.html) as a `<script>` tag in one minute.\n* [Create a New React App](https://reactjs.org/docs/create-a-new-react-app.html) if you're looking for a powerful JavaScript toolchain.\n\nYou can use React as a `<script>` tag from a [CDN](https://reactjs.org/docs/cdn-links.html), or as a `react` package on [npm](https://www.npmjs.com/).\n\n## Documentation\n\nYou can find the React documentation [on the website](https://reactjs.org/docs).  \n\nCheck out the [Getting Started](https://reactjs.org/docs/getting-started.html) page for a quick overview.\n\nThe documentation is divided into several sections:\n\n* [Tutorial](https://reactjs.org/tutorial/tutorial.html)\n* [Main Concepts](https://reactjs.org/docs/hello-world.html)\n* [Advanced Guides](https://reactjs.org/docs/jsx-in-depth.html)\n* [API Reference](https://reactjs.org/docs/react-api.html)\n* [Where to Get Support](https://reactjs.org/community/support.html)\n* [Contributing Guide](https://reactjs.org/docs/how-to-contribute.html)\n\nYou can improve it by sending pull requests to [this repository](https://github.com/reactjs/reactjs.org).\n\n## Examples\n\nWe have several examples [on the website](https://reactjs.org/). Here is the first one to get you started:\n\n```jsx\nfunction HelloMessage({ name }) {\n  return <div>Hello {name}</div>;\n}\n\nReactDOM.render(\n  <HelloMessage name=\"Taylor\" />,\n  document.getElementById('container')\n);\n```\n\nThis example will render \"Hello Taylor\" into a container on the page.\n\nYou'll notice that we used an HTML-like syntax; [we call it JSX](https://reactjs.org/docs/introducing-jsx.html). JSX is not required to use React, but it makes code more readable, and writing it feels like writing HTML. If you're using React as a `<script>` tag, read [this section](https://reactjs.org/docs/add-react-to-a-website.html#optional-try-react-with-jsx) on integrating JSX; otherwise, the [recommended JavaScript toolchains](https://reactjs.org/docs/create-a-new-react-app.html) handle it automatically.\n\n## Contributing\n\nThe main purpose of this repository is to continue to evolve React core, making it faster and easier to use. Development of React happens in the open on GitHub, and we are grateful to the community for contributing bugfixes and improvements. Read below to learn how you can take part in improving React.\n\n### [Code of Conduct](https://code.fb.com/codeofconduct)\n\nFacebook has adopted a Code of Conduct that we expect project participants to adhere to. Please read [the full text](https://code.fb.com/codeofconduct) so that you can understand what actions will and will not be tolerated.\n\n### [Contributing Guide](https://reactjs.org/contributing/how-to-contribute.html)\n\nRead our [contributing guide](https://reactjs.org/contributing/how-to-contribute.html) to learn about our development process, how to propose bugfixes and improvements, and how to build and test your changes to React.\n\n### Good First Issues\n\nTo help you get your feet wet and get you familiar with our contribution process, we have a list of [good first issues](https://github.com/facebook/react/labels/good%20first%20issue) that contain bugs which have a relatively limited scope. This is a great place to get started.\n\n### License\n\nReact is [MIT licensed](./LICENSE).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 4,
      "title": "TypeScript",
      "subTitle": "TypeScript is a superset of JavaScript that compiles to clean JavaScript output.",
      "image": "https://source.unsplash.com/iusJ25iYu1c",
      "content": "\n# TypeScript\n\n[![Build Status](https://travis-ci.org/microsoft/TypeScript.svg?branch=master)](https://travis-ci.org/microsoft/TypeScript)\n[![VSTS Build Status](https://dev.azure.com/typescript/TypeScript/_apis/build/status/Typescript/node10)](https://dev.azure.com/typescript/TypeScript/_build/latest?definitionId=4&view=logs)\n[![npm version](https://badge.fury.io/js/typescript.svg)](https://www.npmjs.com/package/typescript)\n[![Downloads](https://img.shields.io/npm/dm/typescript.svg)](https://www.npmjs.com/package/typescript)\n\n[TypeScript](https://www.typescriptlang.org/) is a language for application-scale JavaScript. TypeScript adds optional types to JavaScript that support tools for large-scale JavaScript applications for any browser, for any host, on any OS. TypeScript compiles to readable, standards-based JavaScript. Try it out at the [playground](https://www.typescriptlang.org/play/), and stay up to date via [our blog](https://blogs.msdn.microsoft.com/typescript) and [Twitter account](https://twitter.com/typescript).\n\nFind others who are using TypeScript at [our community page](https://www.typescriptlang.org/community/).\n\n## Installing\n\nFor the latest stable version:\n\n```bash\nnpm install -g typescript\n```\n\nFor our nightly builds:\n\n```bash\nnpm install -g typescript@next\n```\n\n## Contribute\n\nThere are many ways to [contribute](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md) to TypeScript.\n* [Submit bugs](https://github.com/microsoft/TypeScript/issues) and help us verify fixes as they are checked in.\n* Review the [source code changes](https://github.com/microsoft/TypeScript/pulls).\n* Engage with other TypeScript users and developers on [StackOverflow](https://stackoverflow.com/questions/tagged/typescript).\n* Help each other in the [TypeScript Community Discord](https://discord.gg/typescript).\n* Join the [#typescript](https://twitter.com/search?q=%23TypeScript) discussion on Twitter.\n* [Contribute bug fixes](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md).\n* Read the language specification ([docx](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.docx?raw=true),\n [pdf](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.pdf?raw=true), [md](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)).\n\nThis project has adopted the [Microsoft Open Source Code of Conduct](https://opensource.microsoft.com/codeofconduct/). For more information see\nthe [Code of Conduct FAQ](https://opensource.microsoft.com/codeofconduct/faq/) or contact [opencode@microsoft.com](mailto:opencode@microsoft.com)\nwith any additional questions or comments.\n\n## Documentation\n\n*  [TypeScript in 5 minutes](https://www.typescriptlang.org/docs/handbook/typescript-in-5-minutes.html)\n*  [Programming handbook](https://www.typescriptlang.org/docs/handbook/basic-types.html)\n*  [Language specification](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)\n*  [Homepage](https://www.typescriptlang.org/)\n\n## Building\n\nIn order to build the TypeScript compiler, ensure that you have [Git](https://git-scm.com/downloads) and [Node.js](https://nodejs.org/) installed.\n\nClone a copy of the repo:\n\n```bash\ngit clone https://github.com/microsoft/TypeScript.git\n```\n\nChange to the TypeScript directory:\n\n```bash\ncd TypeScript\n```\n\nInstall [Gulp](https://gulpjs.com/) tools and dev dependencies:\n\n```bash\nnpm install -g gulp\nnpm install\n```\n\nUse one of the following to build and test:\n\n```\ngulp local             # Build the compiler into built/local.\ngulp clean             # Delete the built compiler.\ngulp LKG               # Replace the last known good with the built one.\n                       # Bootstrapping step to be executed when the built compiler reaches a stable state.\ngulp tests             # Build the test infrastructure using the built compiler.\ngulp runtests          # Run tests using the built compiler and test infrastructure.\n                       # Some low-value tests are skipped when not on a CI machine - you can use the\n                       # --skipPercent=0 command to override this behavior and run all tests locally.\n                       # You can override the specific suite runner used or specify a test for this command.\n                       # Use --tests=<testPath> for a specific test and/or --runner=<runnerName> for a specific suite.\n                       # Valid runners include conformance, compiler, fourslash, project, user, and docker\n                       # The user and docker runners are extended test suite runners - the user runner\n                       # works on disk in the tests/cases/user directory, while the docker runner works in containers.\n                       # You'll need to have the docker executable in your system path for the docker runner to work.\ngulp runtests-parallel # Like runtests, but split across multiple threads. Uses a number of threads equal to the system\n                       # core count by default. Use --workers=<number> to adjust this.\ngulp baseline-accept   # This replaces the baseline test results with the results obtained from gulp runtests.\ngulp lint              # Runs eslint on the TypeScript source.\ngulp help              # List the above commands.\n```\n\n\n## Usage\n\n```bash\nnode built/local/tsc.js hello.ts\n```\n\n\n## Roadmap\n\nFor details on our planned features and future direction please refer to our [roadmap](https://github.com/microsoft/TypeScript/wiki/Roadmap).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 3,
      "title": "React",
      "subTitle": "A declarative, efficient, and flexible JavaScript library for building user interfaces.",
      "image": "https://source.unsplash.com/XJXWbfSo2f0",
      "content": "# [React](https://reactjs.org/) &middot; [![GitHub license](https://img.shields.io/badge/license-MIT-blue.svg)](https://github.com/facebook/react/blob/master/LICENSE) [![npm version](https://img.shields.io/npm/v/react.svg?style=flat)](https://www.npmjs.com/package/react) [![CircleCI Status](https://circleci.com/gh/facebook/react.svg?style=shield&circle-token=:circle-token)](https://circleci.com/gh/facebook/react) [![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg)](https://reactjs.org/docs/how-to-contribute.html#your-first-pull-request)\n\nReact is a JavaScript library for building user interfaces.\n\n* **Declarative:** React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable, simpler to understand, and easier to debug.\n* **Component-Based:** Build encapsulated components that manage their own state, then compose them to make complex UIs. Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM.\n* **Learn Once, Write Anywhere:** We don't make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code. React can also render on the server using Node and power mobile apps using [React Native](https://facebook.github.io/react-native/).\n\n[Learn how to use React in your own project](https://reactjs.org/docs/getting-started.html).\n\n## Installation\n\nReact has been designed for gradual adoption from the start, and **you can use as little or as much React as you need**:\n\n* Use [Online Playgrounds](https://reactjs.org/docs/getting-started.html#online-playgrounds) to get a taste of React.\n* [Add React to a Website](https://reactjs.org/docs/add-react-to-a-website.html) as a `<script>` tag in one minute.\n* [Create a New React App](https://reactjs.org/docs/create-a-new-react-app.html) if you're looking for a powerful JavaScript toolchain.\n\nYou can use React as a `<script>` tag from a [CDN](https://reactjs.org/docs/cdn-links.html), or as a `react` package on [npm](https://www.npmjs.com/).\n\n## Documentation\n\nYou can find the React documentation [on the website](https://reactjs.org/docs).  \n\nCheck out the [Getting Started](https://reactjs.org/docs/getting-started.html) page for a quick overview.\n\nThe documentation is divided into several sections:\n\n* [Tutorial](https://reactjs.org/tutorial/tutorial.html)\n* [Main Concepts](https://reactjs.org/docs/hello-world.html)\n* [Advanced Guides](https://reactjs.org/docs/jsx-in-depth.html)\n* [API Reference](https://reactjs.org/docs/react-api.html)\n* [Where to Get Support](https://reactjs.org/community/support.html)\n* [Contributing Guide](https://reactjs.org/docs/how-to-contribute.html)\n\nYou can improve it by sending pull requests to [this repository](https://github.com/reactjs/reactjs.org).\n\n## Examples\n\nWe have several examples [on the website](https://reactjs.org/). Here is the first one to get you started:\n\n```jsx\nfunction HelloMessage({ name }) {\n  return <div>Hello {name}</div>;\n}\n\nReactDOM.render(\n  <HelloMessage name=\"Taylor\" />,\n  document.getElementById('container')\n);\n```\n\nThis example will render \"Hello Taylor\" into a container on the page.\n\nYou'll notice that we used an HTML-like syntax; [we call it JSX](https://reactjs.org/docs/introducing-jsx.html). JSX is not required to use React, but it makes code more readable, and writing it feels like writing HTML. If you're using React as a `<script>` tag, read [this section](https://reactjs.org/docs/add-react-to-a-website.html#optional-try-react-with-jsx) on integrating JSX; otherwise, the [recommended JavaScript toolchains](https://reactjs.org/docs/create-a-new-react-app.html) handle it automatically.\n\n## Contributing\n\nThe main purpose of this repository is to continue to evolve React core, making it faster and easier to use. Development of React happens in the open on GitHub, and we are grateful to the community for contributing bugfixes and improvements. Read below to learn how you can take part in improving React.\n\n### [Code of Conduct](https://code.fb.com/codeofconduct)\n\nFacebook has adopted a Code of Conduct that we expect project participants to adhere to. Please read [the full text](https://code.fb.com/codeofconduct) so that you can understand what actions will and will not be tolerated.\n\n### [Contributing Guide](https://reactjs.org/contributing/how-to-contribute.html)\n\nRead our [contributing guide](https://reactjs.org/contributing/how-to-contribute.html) to learn about our development process, how to propose bugfixes and improvements, and how to build and test your changes to React.\n\n### Good First Issues\n\nTo help you get your feet wet and get you familiar with our contribution process, we have a list of [good first issues](https://github.com/facebook/react/labels/good%20first%20issue) that contain bugs which have a relatively limited scope. This is a great place to get started.\n\n### License\n\nReact is [MIT licensed](./LICENSE).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 2,
      "title": "TypeScript",
      "subTitle": "TypeScript is a superset of JavaScript that compiles to clean JavaScript output.",
      "image": "https://source.unsplash.com/67l-QujB14w",
      "content": "\n# TypeScript\n\n[![Build Status](https://travis-ci.org/microsoft/TypeScript.svg?branch=master)](https://travis-ci.org/microsoft/TypeScript)\n[![VSTS Build Status](https://dev.azure.com/typescript/TypeScript/_apis/build/status/Typescript/node10)](https://dev.azure.com/typescript/TypeScript/_build/latest?definitionId=4&view=logs)\n[![npm version](https://badge.fury.io/js/typescript.svg)](https://www.npmjs.com/package/typescript)\n[![Downloads](https://img.shields.io/npm/dm/typescript.svg)](https://www.npmjs.com/package/typescript)\n\n[TypeScript](https://www.typescriptlang.org/) is a language for application-scale JavaScript. TypeScript adds optional types to JavaScript that support tools for large-scale JavaScript applications for any browser, for any host, on any OS. TypeScript compiles to readable, standards-based JavaScript. Try it out at the [playground](https://www.typescriptlang.org/play/), and stay up to date via [our blog](https://blogs.msdn.microsoft.com/typescript) and [Twitter account](https://twitter.com/typescript).\n\nFind others who are using TypeScript at [our community page](https://www.typescriptlang.org/community/).\n\n## Installing\n\nFor the latest stable version:\n\n```bash\nnpm install -g typescript\n```\n\nFor our nightly builds:\n\n```bash\nnpm install -g typescript@next\n```\n\n## Contribute\n\nThere are many ways to [contribute](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md) to TypeScript.\n* [Submit bugs](https://github.com/microsoft/TypeScript/issues) and help us verify fixes as they are checked in.\n* Review the [source code changes](https://github.com/microsoft/TypeScript/pulls).\n* Engage with other TypeScript users and developers on [StackOverflow](https://stackoverflow.com/questions/tagged/typescript).\n* Help each other in the [TypeScript Community Discord](https://discord.gg/typescript).\n* Join the [#typescript](https://twitter.com/search?q=%23TypeScript) discussion on Twitter.\n* [Contribute bug fixes](https://github.com/microsoft/TypeScript/blob/master/CONTRIBUTING.md).\n* Read the language specification ([docx](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.docx?raw=true),\n [pdf](https://github.com/microsoft/TypeScript/blob/master/doc/TypeScript%20Language%20Specification.pdf?raw=true), [md](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)).\n\nThis project has adopted the [Microsoft Open Source Code of Conduct](https://opensource.microsoft.com/codeofconduct/). For more information see\nthe [Code of Conduct FAQ](https://opensource.microsoft.com/codeofconduct/faq/) or contact [opencode@microsoft.com](mailto:opencode@microsoft.com)\nwith any additional questions or comments.\n\n## Documentation\n\n*  [TypeScript in 5 minutes](https://www.typescriptlang.org/docs/handbook/typescript-in-5-minutes.html)\n*  [Programming handbook](https://www.typescriptlang.org/docs/handbook/basic-types.html)\n*  [Language specification](https://github.com/microsoft/TypeScript/blob/master/doc/spec.md)\n*  [Homepage](https://www.typescriptlang.org/)\n\n## Building\n\nIn order to build the TypeScript compiler, ensure that you have [Git](https://git-scm.com/downloads) and [Node.js](https://nodejs.org/) installed.\n\nClone a copy of the repo:\n\n```bash\ngit clone https://github.com/microsoft/TypeScript.git\n```\n\nChange to the TypeScript directory:\n\n```bash\ncd TypeScript\n```\n\nInstall [Gulp](https://gulpjs.com/) tools and dev dependencies:\n\n```bash\nnpm install -g gulp\nnpm install\n```\n\nUse one of the following to build and test:\n\n```\ngulp local             # Build the compiler into built/local.\ngulp clean             # Delete the built compiler.\ngulp LKG               # Replace the last known good with the built one.\n                       # Bootstrapping step to be executed when the built compiler reaches a stable state.\ngulp tests             # Build the test infrastructure using the built compiler.\ngulp runtests          # Run tests using the built compiler and test infrastructure.\n                       # Some low-value tests are skipped when not on a CI machine - you can use the\n                       # --skipPercent=0 command to override this behavior and run all tests locally.\n                       # You can override the specific suite runner used or specify a test for this command.\n                       # Use --tests=<testPath> for a specific test and/or --runner=<runnerName> for a specific suite.\n                       # Valid runners include conformance, compiler, fourslash, project, user, and docker\n                       # The user and docker runners are extended test suite runners - the user runner\n                       # works on disk in the tests/cases/user directory, while the docker runner works in containers.\n                       # You'll need to have the docker executable in your system path for the docker runner to work.\ngulp runtests-parallel # Like runtests, but split across multiple threads. Uses a number of threads equal to the system\n                       # core count by default. Use --workers=<number> to adjust this.\ngulp baseline-accept   # This replaces the baseline test results with the results obtained from gulp runtests.\ngulp lint              # Runs eslint on the TypeScript source.\ngulp help              # List the above commands.\n```\n\n\n## Usage\n\n```bash\nnode built/local/tsc.js hello.ts\n```\n\n\n## Roadmap\n\nFor details on our planned features and future direction please refer to our [roadmap](https://github.com/microsoft/TypeScript/wiki/Roadmap).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    },
    {
      "id": 1,
      "title": "React: JavaScript library for building user interfaces.",
      "subTitle": "A declarative, efficient, and flexible JavaScript library for building user interfaces.",
      "image": "https://source.unsplash.com/wmkPVpQlZSc",
      "content": "# [React](https://reactjs.org/) &middot; [![GitHub license](https://img.shields.io/badge/license-MIT-blue.svg)](https://github.com/facebook/react/blob/master/LICENSE) [![npm version](https://img.shields.io/npm/v/react.svg?style=flat)](https://www.npmjs.com/package/react) [![CircleCI Status](https://circleci.com/gh/facebook/react.svg?style=shield&circle-token=:circle-token)](https://circleci.com/gh/facebook/react) [![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg)](https://reactjs.org/docs/how-to-contribute.html#your-first-pull-request)\n\nReact is a JavaScript library for building user interfaces.\n\n* **Declarative:** React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable, simpler to understand, and easier to debug.\n* **Component-Based:** Build encapsulated components that manage their own state, then compose them to make complex UIs. Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM.\n* **Learn Once, Write Anywhere:** We don't make assumptions about the rest of your technology stack, so you can develop new features in React without rewriting existing code. React can also render on the server using Node and power mobile apps using [React Native](https://facebook.github.io/react-native/).\n\n[Learn how to use React in your own project](https://reactjs.org/docs/getting-started.html).\n\n## Installation\n\nReact has been designed for gradual adoption from the start, and **you can use as little or as much React as you need**:\n\n* Use [Online Playgrounds](https://reactjs.org/docs/getting-started.html#online-playgrounds) to get a taste of React.\n* [Add React to a Website](https://reactjs.org/docs/add-react-to-a-website.html) as a `<script>` tag in one minute.\n* [Create a New React App](https://reactjs.org/docs/create-a-new-react-app.html) if you're looking for a powerful JavaScript toolchain.\n\nYou can use React as a `<script>` tag from a [CDN](https://reactjs.org/docs/cdn-links.html), or as a `react` package on [npm](https://www.npmjs.com/).\n\n## Documentation\n\nYou can find the React documentation [on the website](https://reactjs.org/docs).  \n\nCheck out the [Getting Started](https://reactjs.org/docs/getting-started.html) page for a quick overview.\n\nThe documentation is divided into several sections:\n\n* [Tutorial](https://reactjs.org/tutorial/tutorial.html)\n* [Main Concepts](https://reactjs.org/docs/hello-world.html)\n* [Advanced Guides](https://reactjs.org/docs/jsx-in-depth.html)\n* [API Reference](https://reactjs.org/docs/react-api.html)\n* [Where to Get Support](https://reactjs.org/community/support.html)\n* [Contributing Guide](https://reactjs.org/docs/how-to-contribute.html)\n\nYou can improve it by sending pull requests to [this repository](https://github.com/reactjs/reactjs.org).\n\n## Examples\n\nWe have several examples [on the website](https://reactjs.org/). Here is the first one to get you started:\n\n```jsx\nfunction HelloMessage({ name }) {\n  return <div>Hello {name}</div>;\n}\n\nReactDOM.render(\n  <HelloMessage name=\"Taylor\" />,\n  document.getElementById('container')\n);\n```\n\nThis example will render \"Hello Taylor\" into a container on the page.\n\nYou'll notice that we used an HTML-like syntax; [we call it JSX](https://reactjs.org/docs/introducing-jsx.html). JSX is not required to use React, but it makes code more readable, and writing it feels like writing HTML. If you're using React as a `<script>` tag, read [this section](https://reactjs.org/docs/add-react-to-a-website.html#optional-try-react-with-jsx) on integrating JSX; otherwise, the [recommended JavaScript toolchains](https://reactjs.org/docs/create-a-new-react-app.html) handle it automatically.\n\n## Contributing\n\nThe main purpose of this repository is to continue to evolve React core, making it faster and easier to use. Development of React happens in the open on GitHub, and we are grateful to the community for contributing bugfixes and improvements. Read below to learn how you can take part in improving React.\n\n### [Code of Conduct](https://code.fb.com/codeofconduct)\n\nFacebook has adopted a Code of Conduct that we expect project participants to adhere to. Please read [the full text](https://code.fb.com/codeofconduct) so that you can understand what actions will and will not be tolerated.\n\n### [Contributing Guide](https://reactjs.org/contributing/how-to-contribute.html)\n\nRead our [contributing guide](https://reactjs.org/contributing/how-to-contribute.html) to learn about our development process, how to propose bugfixes and improvements, and how to build and test your changes to React.\n\n### Good First Issues\n\nTo help you get your feet wet and get you familiar with our contribution process, we have a list of [good first issues](https://github.com/facebook/react/labels/good%20first%20issue) that contain bugs which have a relatively limited scope. This is a great place to get started.\n\n### License\n\nReact is [MIT licensed](./LICENSE).",
      "createdTime": "2019-12-30T16:59:46.443Z",
      "source": ""
    }
  ]
}